[
    {
        "title": "",
        "name": "Laura Zoni",
        "pic_url": null,
        "intro_desc": "Laura Zoni is an Affiliate Professor of Accounting & Control at SDA Bocconi School of Management. She is a Full Professor in Accounting and Management Control at the Università Cattolica del Sacro Cuore, Milan, Faculty of Economics and Law.At SDA Bocconi, she has been the Coordinator of all Accounting and Management Control courses in the MBA (Full Time). She teaches Accounting and Control mainly in the Excecutive MBA, Global Executive MBA, Master in Fashion and Design (MAFED), Master in Corporate Finance (MCF) and Custom Executive Education. Starting in 2012, she has contributed to the design of Accounting and Control courses at the Mumbai International School of Business Bocconi (SDA Bocconi Asia Center, India), where she currently teaches in the Post Graduate Program in Business (PGPB). She has conducted research and several education projects with leading firms operating in the food, packaging, cable, energy and telecommunications and online retail industries.Her research activities focus on performance evaluation and incentives, management accounting system change and organizational change, structure and processes of the Accounting, Control and Finance function. Currently, she is further analyzing the following main topics: the effectiveness of incentives in relation to corporate social performance, the digitalization of enterprises and innovation, business communication quality based on non-financial indicators and on Integrated Reporting (IR) systems.She is the author of numerous books and articles on her topics of interest. Her works have been published in leading academic journals such as European Accounting Review, the Asia-Pacific Journal of Accounting and Economics, the Journal of Accounting and Organizational Change, the Journal of Accounting Auditing and Finance, Management Control Review. She is a consultant for the design and implementation of management control systems. She has been a Visiting Faculty at the Stern School of Business (New York University), at the Amos Tuck School of Business (Hanover, USA), at Marshall School of Business (Los Angeles, USA) and at Insead (Fontainebleau, France). She has won numerous prizes and awards including the 2008 Highly Commended Award of the Emerald Literati Network. She is a member of the Faculty Committee of the PhD Program in Economia e Innovazione at the Università Cattolica del Sacro Cuore. She acts as an independent director in major listed and unlisted companies.  Laura earned a degree and a Ph.D. in Business Administration from Università Bocconi. She is married with a son.  She is a passionate globe trotter.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/laura-zoni?pdf=LauraZoni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Leonardo Luca Etro",
        "pic_url": null,
        "intro_desc": "Leonardo Etro is the Director of International Development, a Board Member and anAssociate Professor of Practice in Corporate Finance at SDA Bocconi. He is a contract Professor of Corporate Finance & Business Valuation at Università Bocconi.At SDA Bocconi, he has directed the Accounting, Control, Corporate and Real Estate Finance Department and was a Board Member in the 2015-2016 biennium. He is currently the Director of the Executive Master in Financial Management and the Executive Master in Finance, Banking and Real Estate programs. He is the Director of Executive Program in Corporate Finance. He is the Scientific Director of the Best Performance Award, the annual SDA Bocconi prize (in partnership with JP Morgan, PwC, EQT Private Equity, Bureau Van Dijk, Havas) dedicated to Italian companies which have distinguished themselves for excellence in sustainable development. He has conducted numerous research, education and consulting projects with the leading multinationals operating in the fashion, food, pharma, manufacturing, E-commerce and banking industries.His research activities focus on issues of a financial nature such as M&A and restructuring, private equity & venture capital, capital structure and company valuation. Currently, his research focuses on three main areas: the first is the study of optimal capital structure for listed Italian and European companies; the second is the relationship between corporate governance and company value; the third is aimed at determining how to create value in M&A Cross Border transactions.He is the author of numerous books and articles on his topics of interest. His works have been published in leading national and international journals including Applied Financial Economics, the Journal of Management Development, the International Journal of Finance and Banking, Thunderbird International Business Review and Economia & Management. He has won many awards for his research such as the prize for Best Innovation in Research Projects, Divisione Claudio Dematté Research in 2014. In 2015-2016, he won the Bocconi Teaching Award. He serves on the Advisory Board of various Italian SMEs.Leonardo earned a degree with Honors in Business Administration from Università Bocconi and an ITP (International Teachers Programme) organized by Kellogg School of Management, Northwestern University (Chicago). He is a Faculty Member of SDA Bocconi Asia Center in Mumbai, India. He has two great passions: skiing and travelling to discover new cultures and emotions.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/leonardo-luca-etro?pdf=LeonardoLucaEtro.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Karin Zaghi",
        "pic_url": null,
        "intro_desc": "Zaghi Karin is an Associate Professor of Practice of Channel and Retail at SDA Bocconi School of Management. She is a Professor of Marketing at Università Bocconi.At SDA Bocconi, she is in charge of the Channel & Retail Category. She is also the coordinator of three Executive Programs: Trade Marketing, Visual Merchandising and Store Management. She is a lecturer for the MFB (Master in Food & Beverage) on the topics of Retailing, Visual Merchandising and Trade Marketing. She runs research, education and consulting projects with leading firms operating in the fashion, design, automotive, electronics and grocery industries.Her research activities focus on retailing, visual merchandising and trade marketing. Currently, she is analyzing four main topics linked with her previous research: store design and visual merchandising, buying behavior and experiential shopping, trade marketing and category management, and channel management in fashion, design, motorbike, electronics, household products and grocery.Her works have beenpublished in leading academic and management journals such as Micro&Macro Marketing, Economia&Management, Largo Consumo. She is the author of many books including: “Visual Merchandising e relazioni di canale”, FrancoAngeli, 2013; “Visual merchandising. Orientamenti e paradigmi della comunicazione del punto vendita”, FrancoAngeli, 2014; “Visual merchandising. La comunicazione per dare valore all’esperienza del cliente”, FrancoAngeli, 2018; “Visual merchandising. In-store Communication to Enhance Customer Value”, Egea, 2018.Karin earned a degree from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/karin-zaghi?pdf=KarinZaghi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Maria Cristina Cito",
        "pic_url": null,
        "intro_desc": "Maria Cristina Cito is a Lecturer in Brand and Communication at SDA Bocconi School of Management. Since January 2017 she is has been a Visiting Professor at Rotterdam School of Management (Netherlands).At SDA Bocconi Maria Cristina Cito is the Program Director of the courses Marketing Serale, Marketing Edizione Intensivaand Comunicare per Creare Valore.  Her research activities focus on consumer behavior, consumer experience and consumer identity.  Her current research addresses three main questions. The first is the impact of digitalization on consumer preferences in identity-relevant domains. The second is the impact of identity changes on consumer preferences. The third focuses on the role of emotions in the consumer experience for performing arts.Her work has been published in Psychology and Marketing and Economia and Management. In 2017 Maria Cristina Cito won a Marketing Science Institute Research Grant for her project on digitalization and identityMaria Cristina Cito earned an MSc in Economics and Management for Arts, Culture and Communication from Università Bocconi, a PhD in General Management from Alma Mater Studiorum, Università di Bologna, and a Bachelor degree in Communication from  Università La Sapienza, Rome. She is married with one daughter.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/maria-cristina-cito?pdf=MariaCristinaCito.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Andreina Mandelli",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Philosophy, University of Milan, 1983\nPh.D. in Mass Communication, Indiana University (Bloomington, USA), 1998Adjunct Professor, Department of Management, Bocconi University, MilanResearch Interests: Innovation in communication and marketing, Digital marketing, Social media metrics, Online reputation, Consumer Behavior, Markets as networks, Service networks",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andreina-mandelli?pdf=AndreinaMandelli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Chiara Piancatelli",
        "pic_url": null,
        "intro_desc": "Chiara Piancatelli, PhD, is Junior Lecturer of Digital Marketing at SDA Bocconi School of Management, Milan. Since January, 2019 she is Executive Program Director of the courses Digital Communication (Ed. Online & Ed. Blended) and Marketing (Ed. Evening) and Adjunct Professor of Marketing at Bocconi University.Her research activities focus on Digital Marketing, Social Media Marketing, Event Marketing and Big Data & AI Marketing. Chiara's current research projects aims to determine how digital technologies and tools help marketing to become more precise and predictive in order to create an augmented value for customers. She is research associate at Deakin University, Australia, where she spent a visiting period during her PhD in Management & Innovation.She is the author of numerous articles and book chapters on the subject. Among others academic journals, her work has been published on International Journal of Market Research (IJMR) and Journal of Strategic Marketing (JSM). She is a member of the World Internet Project (WIP) and she presented at the International Conference of Arts and Cultural Management (AIMAC 2017 Beijing, 2019 Venice) and during the European Academy of Management (EURAM 2018, Reykjavík).Chiara earned a MSc in Economics and Management from Bocconi University and a PhD in Management & Innovation from Cattolica del Sacro Cuore University.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/chiara-piancatelli?pdf=ChiaraPiancatelli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Alessandro Arbore",
        "pic_url": null,
        "intro_desc": "Alessandro Arbore is a Professor of Practice in Marketing at SDA Bocconi School of Management. At SDA Bocconi he is the Faculty Deputy of the Marketing and Sales group, Director of the international programs \"Senior Management Program” and \"Customer-based strategies & new revenue models\". He is also in charge of the course \"Digital For Non Digital Managers\" and of the Marketing Category for the Open Market Division. He is a former Director of the Executive Master in Marketing and Sales, in parthership with Esade Business School. He teaches Strategic Marketing in the Executive MBA program. He has held marketing courses, workshops, research and professional projects with enterprises operating in many industries, both B2C and B2B, including the automotive, energy and pharmaceutical industries.His research activities focus on four main topics: market strategies and competition, marketing of innovations, customer value management and marketing metrics.He is the author of numerous books and articles on his topics of interest. His works have been published in Economia & Management, Journal of the Association for Information Systems, Journal of Retailing and Consumer Services and Journal of Service Management, among others. He has been a Visiting professor at the Wharton Business School, University of Pennsylvania, USA.Alessandro Arbore earned a degree in Business Administration with a specialization in Marketing from Università Bocconi, a Ph.D. in Public Policy and a Master in the field of Telecommunications, both from George Washington University, Washington D.C.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alessandro-arbore?pdf=AlessandroArbore.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Giacomo Morri",
        "pic_url": null,
        "intro_desc": "Giacomo Morri, Ph.D., MRICS, is the Faculty Deputy and an Associate Professor of Practice in Corporate Finance and Real Estate at SDA Bocconi School of Management and a Real Estate Finance lecturer at Università Bocconi. \nHe has been the director of the Master in Real Estate of the Executive Master in Corporate Finance and Banking and he has been in charge of real estate executive education.Following his degree in Business Administration at Università Bocconi, he obtained his Ph.D. in Finance at the Università degli Studi di Trieste. He was a visiting scholar in the Department of Real Estate at the University of Reading and a visiting researcher at Cass Business School, City University, London. He was a visiting professor at the MBA in Hospitality Management IMHI at ESSEC Business School and is currently a  visiting professor at ISEG Universidade de Lisboa.He is a freelance advisor for several real estate companies and asset managers, and he is the non-executive director at UnipolSai Investimenti SGR. He serves on the advisory board for several real estate funds. He is an Italian chartered accountant and statutory auditor and an expert in real estate litigation and valuation. \nHe is the past president and board member of the editorial board of the Journal of European Real Estate Research and Territorio Italia.\nHe is Member, Registered Valuer and Assessor of the Royal Institution of Chartered Surveyors and in the Bocconi Alumni Community he is the Faculty expert on Corporate Finance and Real Estate.\nHe has published several books and articles on real estate, finance, appraisal, REITs and investment funds.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giacomo-morri?pdf=GiacomoMorri.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Piero Almiento",
        "pic_url": null,
        "intro_desc": "Piero Almiento has been teaching Marketing Management at SDA Bocconi since 2006.He is Director of the Online Programs \"Sport Marketing & Sponsorship\" and \"Real Estate Marketing\". Since the first edition, he has been responsible for the marketing and sales module of the “General Management of Small and Medium Enterprises” course, a program that saw him among the creators. He is the reference teacher for the marketing area in Tourism Management and Hospitality courses as well as in those dealing with SMEs, Real Estate and Sport Management. He was lecturer and mentor of \"Speed Mi Up\", an incubator of Bocconi University and now plays the same role for \"B4i - Bocconi for Innovation\", the accelerator of Bocconi University dedicated to innovative startups.His research activities focus on competitive advantage and the creation of value that can be achieved with the application of the strategic marketing approach in the development of a business. Among the numerous themes deriving from this approach, he focuses his attention in particular on the importance of linking the different phases of a marketing planning (analysis, strategy, execution and control), on customer centricity in designing the processes and organization of the company and the opportunities offered by the synergies between marketing and digital transformation. Making use of his professional experience, first as a manager and now as a consultant for many important companies, in teaching activities he seeks the balance between theoretical solidity and pragmatism required by the market.In his professional activity, the numerous interventions in the real estate field place him as the main national reference for marketing in real estate. In the tourism sector, he was among the protagonists of the introduction of the internet in the sector with the tour operator Orizzonti, the first to make it possible to purchase a tourist service online in Italy through a credit card, an activity that helped him to be included among the national finalists of the “Marketing Man of the Year” award (1999), assigned by “ADICO” and “Valdani Vicari & Associati”. In sport management, he held the role of marketing advisor to the Italian Golf Federation and was among the creators of the “Varese nel cuore” consortium, a shared ownership model that allowed the economic sustainability of Varese Basketball, which was later adopted by other sports clubs. In the field of SMEs, he has carried out managerial activities in very different sectors: Hospitality, Eyewear, Electrical Supplies, Underwear, Accessories, Publishing, Cosmetics, Software, Wellness, Medical Products, Food Products and Catering.He is the author of numerous popular articles on SMEs, Real Estate, Sport Management and Tourism Marketing. On the same topics, he organizes and participates, as moderator or speaker, in numerous conferences and workshops. He is often a guest of television programs in thematic programs on management. It is continuously present on the schedule of \"Quotidiano Immobiliare\", the most important network and information body of the Italian real estate world, where it hosts a series of broadcasts entitled \"Marketing & Real Estate\".He graduated in Economics and Commerce from the University of Cagliari and specialized in marketing and sales management through a course of executive courses at SDA Bocconi. From 2013 to 2018, he was the creator and developer of \"Adopt a brain\", a financing project for the development of multimedia in the Liceo Classico Beccaria, the oldest in Milan and the school of his two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/piero-almiento?pdf=PieroAlmiento.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Bettina Gehrke",
        "pic_url": null,
        "intro_desc": "SDA Fellow “Vordiplom“ in Economia Politica e Storia, Universität Heidelberg, 1983 \nLaurea in Economia Aziendale, Technische Universität Berlin, 1985\nPh.D. (Dr. rer. oec.) Technische Universität Berlin, 1990Professore a contratto, Università L. Bocconi, Milano \n\"The Intercultural Approach\",  IAHT (International Academy of Tourism and Hospitality), Cernobbio 2015-2016\n\"Global Responsible Leadership\", Università Bocconi 2014-2016\n\"Cross Cultural Management\", Università Bocconi 2007-2013\n\"Cross Cultural Management\", GSOM St. Petersburg State University 2012\n\"Collaborative Competences\", Fudan University Shanghai 2010Aree di interesse e di ricerca: Competenze Leadership interculturale e globale, Team multiculturali, Diversity Management, Comportamento organizzativo, Leadership Responsabile",
        "pdf_url": "https://www.sdabocconi.it/it/faculty/bettina-gehrke?pdf=BettinaGehrke.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Emanuele Vendramini",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/emanuele-vendramini?pdf=EmanueleVendramini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Monica Otto",
        "pic_url": null,
        "intro_desc": "Monica Otto is a Lecturer at the Department of Social and Political Sciences at Università Bocconi.At SDA Bocconi, she was the Director of the Master in Public Management (2010-2013) and of the Executive Master of Management in International Organizations (2015-2016). She coordinates the Pharmaceutical Observatory at CERGAS, the course in pharmaceutical policy in the Master in Mangement per la Sanità (MIMS), and the Specialization in Pharmaceuticals and Medical Technologies of the Master in Healthcare, Management, Economics and Policy (MIHMEP). She carries out research and education projects with pharmaceutical companies and associations on topics concerning pharmaceutical policy and management, and market access. Since 2018, she has been the Director of Executive Education in Health, Government and Non Profit.Her research activities focus on economics, policies and the pharmaceutical care and management systems in the field of biotechnology, comparative business and government relations.She is the author of numerous essays and papers on her topics of research and interests. Her works have been published in international journals, such as Frontiers in Pharmacology, Clinical Therapeutics, Health Policy, the Journal of Medical Marketing, The European Journal of Health Economics as well as national journals, such as Economia & Management, Mecosan, Numeri e Indici dell’Automedicazione, and Economia e Politica del Farmaco, among others. She published a a case study in the Case Center concerning the partnership for development between Ikea and Unicef. She has held seminars at the European University of Market Access (Emaud) in Paris.She was a Visiting Student and Researcher at the Health Care Management Department (WHO Collaborating Centre for Health Systems Research and Management) at Technische Universität in Berlin. She has presented her own papers at AIES, ISPOR and EHMA conferences.Monica earned a degree in Public Administration and International Institutions Management (CLAPI) and a Ph.D. in Business Administration and Management both from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/monica-otto?pdf=MonicaOtto.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Viviana Mangiaterra",
        "pic_url": null,
        "intro_desc": "Viviana Mangiaterra is a SDA Associate Professor of Practice. Her collaboration with SDA Bocconi began in January 2019. She is a dedicated professional with a global career in international public health. The main focus of her work has been on strategic planning; policy development; health system strengthening; technical advice for program implementation in the field of reproductive, maternal, child and adolescent health, gender, HIV and malaria; and partnership-building with a wide range of stakeholders. She has gained broad operational research experience in public healthcare in developing countries.She has carried out several research projects in key areas of public health. For the Global Fund  to Fight AIDS, Tuberculosis and Malaria, she has led  ongoing 3-year multi-country quality improvement operational research on the integration of HIV, TB and malaria services in antenatal care using a standards based assessment methodology. Her research aims to assess the effectiveness and efficiency of integrated service delivery on outcomes and impact for these three diseases in mothers and newborns.For the World Health Organization (WHO) she has led many research projects including the operational research of the Reproductive Health and Research Team on Essential Medicines with a main focus on pre-qualification and regulatory aspects of female condoms and emergency contraception; a major research initiative, including study design, questionnaire development, surveyor training, data collection and analysis of a new methodology developed by the London School of Tropical Medicine, for an under 5 mortality household survey in 7 provinces of Indonesia; various  research protocols for the study of vitamin A and iodine deficiency disorders in Rwanda.She has had a long and significant professional career in the global public health arena. She has worked in several leading international organizations at all levels – headquarters, regional and county-based – including the World Health Organization, the World Bank and currently the Global Fund to Fight HIV, Tuberculosis and Malaria.  Through this experience, she has developed proven leadership skills in building strong partnerships with internal and external stakeholders, as well as significant knowledge of working with funding mechanisms of major partner organizations engaged in global public health.  As such, she has established a broad network of contacts with stakeholders in the public and private sectors. In her country-based work in Rwanda, Indonesia, Moldova, Sudan, Egypt, the Central Asian Republics and the Caucasus, she has directly influenced policies and the allocation of resources, provided high-quality technical advice, supported national capacity building and the strengthening of health systems, guided evaluation processes and performed operational research. She has successfully led teams with a proven track record for delivering results and success in providing resources for the identified priorities and scope of work.She has been a visiting professor in Bocconi’s Masters in International Health Management, Economics and Policy (MIHMEP), she has also gained teaching experience at the Johns Hopkins, School of Advanced International Studies, co-teaching the course on Health Problems, Policies and Practices in Developing Countries.  She has also taught at Butare University in Rwanda. She has published more than 70 articles in Italian and in international journals, mainly in the areas of public health, maternal and child health, health systems and AIDS, Tuberculosis and Malaria.She earned a degree  in Medicine and Surgery from the Università di Milano; a Master in Pediatrics and  a Master in Gastroenterology, also from the Università di Milano, with residential research in child nutrition in Brussels (Hôpital St. Pierre) and Paris (Hôpital des Enfants malades) and a Diploma in International Epidemiology at the Center for Disease Control, Atlanta USA.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/viviana-mangiaterra?pdf=VivianaMangiaterra.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Rosanna Tarricone",
        "pic_url": null,
        "intro_desc": "Rosanna Tarricone is the Associate Dean at SDA Bocconi School of Management and Associate Professor in Public Administration at Università Bocconi, Department of Social and Political Science, Milan. She graduated in Business Administration at Università Bocconi and holds an MSc in Health Services Management and a PhD in Public Health and Policy, both from the London School of Hygiene and Tropical Medicine, University of London, UK. She has over 100 publications in the areas of health policy, healthcare management, the economic analysis of health care services and health technology assessment (HTA).In the last 10 years Rosanna has been awarded over 10 multi-annual competitive research grants from international institutions such as the European Union, the Swiss Bridge Award and InHealth (USA). She has been the leader of MedtecHTA, a major, three-year EU-funded research project which has made recommendations on how to improve methods for assessing the effectiveness and cost-effectiveness of medical devices and she currently serves as a scientific supervisor of COMED, a three-year EU-funded research project on improving assessment methods of costs and outcome analysis of medical technologies, including mhealth.Rosanna serves as an expert for the DG Research and DG Health of the European Commission. She facilitates the continuous exchange of experiences and harmonization of methods and procedures between the HTA Agencies of the EU Member States within EUnetHTA. Since 2007 Rosanna has been an advisor for the Ministry of Health (MoH) in Italy and has contributed to the design and development of the National Programme of HTA for Medical Devices. She is part of the Panel of Experts aimed at advising the MoH on the future of the Italian National Health Service.Between 2005 and 2010 Rosanna held the position of Director of Economic Affairs at Medtech Europe and contributed to developing research and generating robust evidence around medical devices by launching the European Health Technology Institute for Socio-Economic Research, a partnership between European universities (Università Bocconi, London School of Economics and Technische Universität Berlin) and policymakers (European Commission, WHO).Rosanna is an active member of ISPOR. She served on the ISPOR Board of Directors from 2016-2018, and currently chairs the Publications Management Advisory Board (MAB). She was Co-Chair of the 2019 North America Conference in New Orleans.\nRosanna is also a member of iHEA (International Health Economics Association)  and of HTAi (Health Technology Assessment International).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/rosanna-tarricone?pdf=RosannaTarricone.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Gaia Rubera",
        "pic_url": null,
        "intro_desc": "Gaia Rubera è Amplifon Chair in Customer Science, Direttore del Dipartimento di Marketing, Professore Ordinario presso l’Università Bocconi e SDA Bocconi School of Management.Presso SDA Bocconi è Direttore dell’online program Fundamentals of Python e insegna Social Media Marketing nel programma MBA full time.Le sue aree di interesse scientifico si focalizzano su Business Analytics, Social media marketing, Innovazione e sviluppo nuovi prodotti, Marketing strategico, Innovazione di design e Creatività. Gaia è stata responsabile per la ricerca presso il Center for Innovation alla Marshall School of Business, University of Southern California (2007-2008). Dal 2008 al 2012, è stata Assistant Professor nel dipartimento di Marketing della Michigan State University.E’stata autrice di numerosi articoli che riguardano i temi da lei trattati. I suoi lavori sono stati pubblicati su importanti journal quali Marketing Science, Journal of Marketing, Strategic Management Journal, Journal of the Academy of Marketing Science, Journal of Service Research, Journal of Product Innovation Management e Journal of International Business Studies. E’ inoltre Associate Editor del Journal of the Academy of Marketing Science e membro dell'editorial board del Journal of Product Innovation Management e del Journal of International Marketing. Siede nell’Academic Committee della Product Development Management Association (USA).Gaia ha conseguito una laurea in Economia Aziendale e un PhD in Economia Aziendale e Management presso l'Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/it/faculty/gaia-rubera?pdf=GaiaRubera.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Maria Carmela Ostillio",
        "pic_url": null,
        "intro_desc": "Maria Carmela Ostillio is an Associate Professor of Practice of Marketing and Sales at SDA Bocconi School of Management. She teaches and is in charge of the course Brand Management at Università Bocconi.At SDA Bocconi, she is a Core Faculty Member and Director of the Brand Academy. She has been responsible for research and education projects (\"Customized-Programs”) for companies focused on consumer goods, Services and B2B.Her research activities focus mainly on branding, strategic brand management, marketing & corporate communications. She is currently working on other issues linked to her previous research, in particular, direct & interactive marketing, marketing One to One, customer database and marketing information systems.She is the author of numerous books and articles on her topics of interest. Her works have been published in the Journal of Interactive Marketing, the Journal of Global Fashion Marketing: bridging Fashion and marketing, the International Journal of Arts Management, Economia & Management and Micromacro Marketing, among others. She has been a Visiting Scholar in many universities, including Columbia University (New York, Usa), Northwestern University (Evanston, Usa), Tuck School of Business (Hanover, Usa) and Eller School of Management at the University of Arizona (Tucson, Usa). She won the best paper award for Aimac in 2013.Maria Carmela earned a degree in Political Sciences, focused on International Economy, from the Università degli Studi di Bari and an MBA – Master in Business Administration - from SDA Bocconi. She is married with two sons. For years, she has been dedicated to volunteering for humanitarian causes and aid focused on children, the elderly and the poor in general. Her activities have taken her to various developing countries (Mali, Namibia, Somalia, etc.) as well as Italy; since 2008 she has volunteered to work with children and teenagers for Dynamo Camp, part of the Serius Fun network.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/maria-carmela-ostillio?pdf=MariaCarmelaOstillio.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Renata Trinca Colonel",
        "pic_url": null,
        "intro_desc": "Renata Trinca Colonel is Associate Professor of Practice of Decision Sciences & Business Analytics at SDA Bocconi School of Management. Since January 2021 she has been the Director of the Executive MBA Programs, both weekend and modular format, and she is also the coordinator of the category Business Data Analytics for Open Programs. She is Adjunct Professor of Statistics at Bocconi University.Her cooperation with SDA Bocconi began in 2002. Since then, she has run various courses on Business Analytics and she still is Faculty member of many Specialized Master Programs and Executive MBA Programs. She is Program Director of the online course Data Analysis for Business and the course Research, Organization and Quantative Data Analysis. She conducted research, training and consulting projects for important Italian and multinational companies in the energy, transportation, retail, banking, insurance, publishing and real estate industry (with Indian Railways, Trenord, Enel Green Power, Ferrero, Banca Mediolanum, Aruba and others). Her research activities focus on business analytics, data visualization, sampling and marketing research, applications and statistical analysis in different fields, scoring and rating statistical models, forecasting and quantitative techniques in general.She is the author of books and numerous articles on her topics of interest. Her works have been published in the Journal of Product Innovation Management, Critical Perspectives on International Business, the European Journal of Finance, the Journal of Financial Regulation and Compliance and Economia&Management, among others. Renata won the Bocconi Innovation in Teaching Award in 2019. Since 2002, she has been a corporate consultant in data analytics, modelling, predictive analytics, market research.Renata earned a degree in Economic and Social Disciplines (D.E.S.) from Università Bocconi and an ITP (International Teachers Programme) from SDA Bocconi School of Management in 2009.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/renata-trinca-colonel?pdf=RenataTrincaColonel.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Cinzia Parolini",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Business Administration, Bocconi University, 1983Full Professor of Economia Aziendale Università di Modena e Reggio EmiliaResearch Interests: Tourism and destination management, Entrepreneurship and Business planning, Models for strategic analysis, E-business, E-business in emerging economies",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/cinzia-parolini?pdf=CinziaParolini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "title": "",
        "name": "Alfonso Gambardella",
        "pic_url": null,
        "intro_desc": "April 1991: Ph.D, Department of Economics, Stanford University, Stanford, California, USA.October 1986: Master of Arts (Economics), New York University, New York, USA.January 1984: Laurea (Economics & Business), University of Genoa, Italy.Diploma 1982: Music Conservatory “Niccolò Paganini”, Genoa, Italy (flute) Full Professor of Management and Technology2004-today Professor, Department of Management & Technology, Bocconi University, Milan, Italy2001-2004 Associate Professor, Sant’Anna School of Advanced Studies, Pisa, Italy1992-2001 Associate Professor, University of Urbino, Urbino, ItalyResearch Interests: Strategy, Innovation, Management",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alfonso-gambardella?pdf=AlfonsoGambardella.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Claudio Jommi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Claudio Jommi is Professor of Practice in Health Policy at SDA Bocconi School of Management  - Government, Health and Not for Profit Knowledge Group.He is also Member of the Executive Committee, Director of the Health Policy Area and Scientific Coordinator of the Pharmaceutical Observatory at Cergas (Centre for Research on Health and Social Care Management), SDA Bocconi.He is Director of the Master of International Health Care Management Economics and Policy (MIHMEP). He has been a visiting professor at Essec Business School, Cergy (Paris), at the Herivan K. Haub School of Business, St Joseph University, Philadelphia (US), at the Andrija School of Public Health, Zagreb and the University of Claude Bernard Lyon 1 (European Market Access University Diploma) (Paris).He was the President of the Italian Health Economics Association (2014-2017).His research activity is focused on Market Access for Medicines and other Medical Technologies, Pharmaceutical Economics, Policy and Management, Health Technology Assessment and Decision Making in Health Care.He has had his work published in many international and national journals, including BMJ Open, Drug Design Development and Therapy, Frontiers in Pharmacology, European Journal of Health Economics, Health Policy, International Journal of Health Planning and Management, Journal of Medical Marketing, Pharmacoeconomics, PLOS and PLOS Neglected Diseases, Public Money and Management, Social Science and Medicine, Value in Health.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/claudio-jommi?pdf=ClaudioJommi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Rotolo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Rotolo is a SDA Lecturer of Government, Health & Not for Profit at SDA Bocconi School of Management. He is also a contract professor at Università Bocconi, teaching Public Administration in undergraduate courses.He has participated in and coordinated several research and executive education programs involving the leading actors of the Italian healthcare and social system, dealing with public and private (for profit and not for profit) health care and welfare organizations, regional governments, municipalities and pharmaceutical companies. Since September 2018 he has also been a Teaching Assistant for the MIHMEP Master Program.His research interests and scientific publications revolve around healthcare management, focusing on the topics of strategic planning, performance management, organization and integration between social and healthcare services and digital innovation.He is the author of several papers published in national and international journals such as Public Management Review, BMC Health Services Research, Mecosan and Welfare Oggi. He has also contributed to various editions of Rapporto OASI, the annual report about the state-of-the-art of the Italian health care system. He is the author of the OCAP White Paper 1/2019 about digital innovation in welfare services.He earned an MSc in Economics and Mangement of Public Administration and International Institutions at Università Bocconi in 2010.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-rotolo?pdf=AndreaRotolo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Patrizio Armeni",
        "title": "",
        "pic_url": null,
        "intro_desc": "Patrizio Armeni is Associate Professor of Practice in Government, Health and Not for Profit at SDA Bocconi School of Management.Patrizio’s collaboration with SDA Bocconi started in 2009. He has gradually widened the scope of his research and teaching which began withthe Osservatorio Farmaci (Pharmaceutical Observatory) and went on to include, over time, other research areas related to public management, with a particular focus on the healthcare sector. His knowledge of healthcare organizations has awakened his interest in studying organizational behaviors of individuals and teams and led him to adopt   an educational approach based on the daily practice of ethical principles in the workplace (leadership in practice).He has directed various executive programs for employees of pharmaceutical and medical device companies and has coordinated several sponsored educational programs dedicated to physicians and other healthcare and public sector professionals.He supervises a category of open market courses including programs dedicated to the interaction between the national health service and technology providers (pharma, medical devices, services).He also teaches «Public Management» and «Innovation and competition in life science»  at undergraduate level, andseveral courses on national and international master programs: «Economics of healthcare organizations», «Pharmaceutical policy», «Economic Evaluations - advanced» and «Evidence-based health policy evaluation», «Policy Evaluation».He coordinates the research area «Health Economics & HTA» at CERGAS (Center for Research on Health and Social Care Management) at SDA Bocconi. His current research activity is focused on three themes: 1) economic evaluations of healthcare technologies (cost-effectiveness, cost-utility and budget impact analysis) and related methodological developments founded on the pillar of value-based healthcare; 2) analysis and support for policymakers for public policy design and implementation; 3) analysis of pharmaceutical and health technology markets in terms of performance, innovation and reaction to public policies. He has published several articles in international peer-reviewed journals and is the author of a number of chapters in monographic works. Since 2009 he has authored the chapter on healthcare expenditure in the OASI (Observatory on Healthcare Organizations and Policies in Italy) report, the leading annual Italian publication on issues relating to the healthcare system. Patrizio’s production and diffusion of knowledge is coupled with frequent participation as a speaker in international and national congresses and conferences. He serves as an expert on advisory boards for companies operating in the pharmaceutical / medical devices industry. He also writes for specialized newspapers and has been repeatedly interviewed by national television broadcasting services.   He holds a PhD in Business Administration and Management from Università Bocconi, with a dissertation focused on the consequences of emotional (positive and negative) relationships among colleagues in the workplace. He obtained an MSc in Economics and Finance (Università LUISS Guido Carli, Rome) and a BSc in Economics and Management of Services (Università LUISS Guido Carli, Rome).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/patrizio-armeni?pdf=PatrizioArmeni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Luca Brusati",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Management, Bocconi University, Milan, Italy, 1991 \nPh.D. in Management, Bocconi University, Milan, Italy, 1996Associate Professor of General Management, Udine State University, Italy\nScientific Coordinator, LAREM (Laboratory of Research in Economics and Management), Udine State University, Gorizia Branch, ItalyResearch interests: Business-government relations, Public affairs and corporate political strategy, Management of international organizations, Strategy and finance in governmental organizations, Comparative public management, with an emphasis on transition countries.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/luca-brusati?pdf=LucaBrusati.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Luca Buccoliero",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/luca-buccoliero?pdf=LucaBuccoliero.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giuditta Callea",
        "title": "",
        "pic_url": null,
        "intro_desc": "Callea Giuditta is an Associate Professor of Practice in Health Economics and HTA at SDA Bocconi School of Management.Her collaboration with SDA Bocconi began in 2010. She has coordinated major national and international research projects. Her projects have been funded by external sources, both public and private. She has also been part of the research team for other projects. She has coordinated several education activities for major companies operating in the medical devices industry and has taught in numerous executive courses.Her research activities focus on economic evaluation and Health Technology Assessment of medical devices, funding and reimbursement of medical technologies, patient classification systems, procurement of medical technologies, determinants of adoption and diffusion of new medical technologies, and traceability of new medical technologies in administrative databases. She has always dealt with systems of governance for theintroduction of new technologies. She has carried out and is still involved in research on the impact of centralized procurement of medical goods and services, whose results have been published at international and national level. More recently, she has been involved in research on the impact of new European Regulations on Medical Devices (MDR).She is the author of several papers published in leading international and national journals such as Social Science and Medicine, Health Economics, Health Economics, Policy and Law, Clinical Therapeutics, Economic Modelling, Empirical Economics, the Journal of Medical Marketing, the Journal of Comparative Effectiveness Research, EuroIntervention, Hepato-Pancreato Biliary, Mecosan. Her article “The effects of upcoding, cream skimming and readmissions on the efficiency of Italian hospitals: a Population–based Investigation” (coaut.  P. Berta, G. Vittadini, G. Martni) was awarded the Fabio Gobbo Best Paper Award from the Italian Society of Industrial Economics and Politics. She is the coordinatoor of the CERGAS (Centro di Ricerche sulla Gestione dell'Assistenza Sanitaria e Sociale)-the SDA Bocconi Observatory on Public Procurement Management in Health Care. She is the Topic Editor of the journal Clinical Therapeutics for the Pharmacoeconomics, Outcomes, and Health Policy area. Giuditta earned a degree in Management Engineering from the Università degli Studi di Brescia and a Ph.D. in Economics and Technology Management from the Università degli Studi di Bergamo.Callea Giuditta is an Associate Professor of Practice in Health Economics and HTA at SDA Bocconi School of Management.Her collaboration with SDA Bocconi began in 2010. She has coordinated major national and international research projects. Her projects have been funded by external sources, both public and private. She has also been part of the research team for other projects. She has coordinated several education activities for major companies operating in the medical devices industry and has taught in numerous executive courses.Her research activities focus on economic evaluation and Health Technology Assessment of medical devices, funding and reimbursement of medical technologies, patient classification systems, procurement of medical technologies, determinants of adoption and diffusion of new medical technologies, and traceability of new medical technologies in administrative databases. She has always dealt with systems of governance for theintroduction of new technologies. She has carried out and is still involved in research on the impact of centralized procurement of medical goods and services, whose results have been published at international and national level. More recently, she has been involved in research on the impact of new European Regulations on Medical Devices (MDR).She is the author of several papers published in leading international and national journals such as Social Science and Medicine, Health Economics, Health Economics, Policy and Law, Clinical Therapeutics, Economic Modelling, Empirical Economics, the Journal of Medical Marketing, the Journal of Comparative Effectiveness Research, EuroIntervention, Hepato-Pancreato Biliary, Mecosan. Her article “The effects of upcoding, cream skimming and readmissions on the efficiency of Italian hospitals: a Population–based Investigation” (coaut.  P. Berta, G. Vittadini, G. Martni) was awarded the Fabio Gobbo Best Paper Award from the Italian Society of Industrial Economics and Politics. She is the coordinatoor of the CERGAS (Centro di Ricerche sulla Gestione dell'Assistenza Sanitaria e Sociale)-the SDA Bocconi Observatory on Public Procurement Management in Health Care. She is the Topic Editor of the journal Clinical Therapeutics for the Pharmacoeconomics, Outcomes, and Health Policy area. Giuditta earned a degree in Management Engineering from the Università degli Studi di Brescia and a Ph.D. in Economics and Technology Management from the Università degli Studi di Bergamo.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giuditta-callea?pdf=GiudittaCallea.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Marianna Cavazza Rossi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Marianna Cavazza is an Associtate Professor of Practice in Health Policy at SDA Bocconi School of Management At SDA Bocconi Marianna runs courses on private health insurance in MiMS (Master in Management della Sanità) and MIHMEP (Master of International Healthcare Management, Economics and Policy) and she coordinates the \"Aziende Associate Cergas\" Network involving several pharmaceutical and medical device companies (e.g. Bayer, Novartis, Ipsen, Medtronic, Teva, Biogen etc. etc.). Moreover, she is a team member of the Observatory on Private Healthcare Consumption (OCPS - Osservatorio sui Consumi Privati in Sanità). She has led courses on private health insurance and clinical research management and policies with public and private healthcare clients. Her research activities focus on private health consumption and private health insurance, cost and organization analysis in the healthcare sector,  and on public policies analysis for instance in the blood transfusion sector and in specific areas of the pharmaceutical sector.  Her current research addresses three main questions. The first concerns private health insurance sector changes in the near future. The second is about the relationship between the public and private healthcare sectors in the perspective, for instance, of  the design of new services and information systems integration. The last one addresses public policy organization involving a wide range of stakeholders and the related governance tools. Marianna is the author of numerous books and articles on her topics of interest. Her works have been published in the European Journal of Health Economics, Health Policy, PLOS ONE, the Journal of Public Administration Research and Theory, Nutrition, among others. Marianna earned a BA in Political Science from Università degli Studi di Milano (Italy),  an MSc in Economics from the University of York (UK) and a PhD in Economics  from the Università Cattolica del Sacro Cuore di Milano  (Italy). She is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/marianna-cavazza-rossi?pdf=MariannaCavazzaRossi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Oriana Ciani",
        "title": "",
        "pic_url": null,
        "intro_desc": "Ciani Oriana is an Associate Professor of Practice, Public Management and Policy Group, Health Economics & HTA (Health Technology Assessment) at SDA Bocconi School of Management.Her collaboration with SDA Bocconi began in 2010. She leads the Epidemiology and Issues in the Public Health module for the Master of International Health Care Management, Economics and Politics (MIHMEP) at SDA Bocconi. She has taught in numerous executive courses and has been involved in several educational activities targeting professionals in the Healthcare industry.Her research interests are centred around the use and impact of (HTA) on decision-making in healthcare, on the methodological aspects of the evaluation of health technologies, particularly medical devices, and on the use of evidence synthesis techniques to inform policy decisions and health policies. She is also a Research Fellow at the University of Exeter Medical School (UK) where she received her PhD with a thesis focusing on the evaluation of surrogate endpoints in HTA, which remains one of her main research topics. Oriana has been involved in many national and international research projects, often involving coordination among several partners, such as MedTecHTA (FP7 no. 305694), Mapping NCD (FP7 no. 602536) and, more recently, COMED (H2020 no.779306). Oriana is a 2020 Fulbright Research Scholar at Yale School of Medicine and Yale School of Public Health. She is the author of several publications in HTA, health economics and health services research and a reviewer for many international academic journals. She is a member of the Early Career Committee of the European Health Economics Association (EuHEA), a member of HTAi (Health Technology Assessment International), of the International Association of Health Economics (iHEA), of the International Society of Pharmacoeconomics and Outcomes Research (ISPOR), of the Italian Association of Health Economics (AIES), of the International Federation for Medical and Biological Engineering (IFMBE) and of the Italian Association of Clinical Engineers (AIIC). Her paper published in the International Journal of Health Technology Assessment (2015) on HTA practices for Medical Devices received  the 2016 Egon Jonsson Award. She also received recognition for Outstanding impact in Health and Wellbeing at the Exeter Impact Award Event (2013), Best Student Podium Presentation Award at the 16th ISPOR Annual European Meeting in Dublin (2013) and the Young Researchers Award at 15th AIES Conference (2010).Oriana holds an MSc in Biomedical Engineering from Politecnico di Milano and an MSc in Healthcare Management and Economics from SDA Bocconi. She received her PhD from the Peninsula Technology Assessment Group (PenTAG), University of Exeter Medical School (UK).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/oriana-ciani?pdf=OrianaCiani.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Amelia Compagni",
        "title": "",
        "pic_url": null,
        "intro_desc": "Associate Professor of the Department of Policy Analysis and Public Management at Bocconi UniversityRecipient of the Bocconi Research Fellowship (February 2008) Contracted Research Fellow at CERGASDegree in Biology, University of Pavia, 1995Ph.D. in Genetics, University of Vienna, Austria,  2000MSc in International Healthcare Management, Economics and Policy (MIHMEP), Bocconi University, 2005",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/amelia-compagni?pdf=AmeliaCompagni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giovanni Fattore",
        "title": "",
        "pic_url": null,
        "intro_desc": "Giovanni Fattore is Full Professor of Health Policy at SDA Bocconi School of Management and at Bocconi University.He was Director of the Policy Analysis & Public Management Department of Bocconi University (now Social and Political Sciences) and Director of the Master of International Healthcare Management Economics and Policy (MIHMEP) at SDA Bocconi, from 2002 to 2008, and Deputy Director of CERGAS. His research activities focus on health policy, applied health economics, health planning & management and economic evaluation of healthcare and nutrition interventions. He worked for OECD, WHO and the World Bank and has led several research units for projects funded by the European Commission. He is Associate Editor of Health Policy Journal and author of about 130 publications in scientific journals.Giovanni has a laurea degree in Economics from Bocconi University, a MSc from the Harvard School of Public Health and a PhD from LSE in Social Policy.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giovanni-fattore?pdf=GiovanniFattore.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Lorenzo Fenech",
        "title": "",
        "pic_url": null,
        "intro_desc": "Fenech Lorenzo is an Associate Professor of Practice of Government, Health and Not for Profit at SDA Bocconi School of Management.He teaches Health Operations Management and Private Healthcare Market Management in numerous Executive courses of Healthcare Management. He is the coordinator of the Executive Master in Healthcare Management, EMMAS.His collaboration with SDA Bocconi began in 2012 in the Observatory on Private Healthcare Consumption, where he continues to study trends in the private sector and public entrepreneurship. He then started a collaboration with the Patient Flow Logistics Lab and widened his scope of research and teaching to include health operations management (2017-2018). His researches currently focuses on four topics: emergency care; outpatient flow logistics; healthcare operations and coproduction; private and public integration in patient service operations.  He is the author of a number of essays,articles and chapters  on his topics of interest. His works have been published in Health Policy, Economia&Management, Salute e Territorio, OASI Reports-CERGAS SDA Bocconi, ISTISAN (National Health Authority Reports). His research within the Observatory on Private Health Consumption has been reported in Italian newspapers such as Il Sole24Ore, Corriere della Sera and Repubblica, thus increasing his visibility on a national level. He was a speaker, among other occasions, at the IRSPM CONFERENCE Hong Kong, 13-15 April 2016, and at the EHMA Conference Milan 2017. Lorenzo earned a degree cum laude in Economics from l'Università Sapienza, Rome and a Master in Healthcare Management (MiMS) from SDA Bocconi School of Management. He was a Visiting Scholar at Alfred Lerner College of Business and Economics at UDEL, University of Delaware, USA where he pursued upskilling in his areas of interest and beyond.  Lorenzo holds dual citizenship: Italian and Maltese.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/lorenzo-fenech?pdf=LorenzoFenech.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesca Lecci",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesca Lecci is an Associate Professor of Practice in Government, Health and Not for Profit at SDA Bocconi School of Management.At SDA Bocconi, she is the Director of the Executive Master in Management of Healthcare and Social Organizations (EMMAS) and Program Director of one post experience specialization course (MAS - Management for Healthcare Organizations) and of many open and custom programs. She has conducted many research, education and consulting projects with businesses and public institutions operating in the healthcare, government and cultural sectors. Moreover, she has worked with the leading multinational clients operating in the pharmaceuticals, hospital and entertainment industries.Her research activities focus on management accounting, performance management and corporate finance in healthcare and the public sector. Her current research addresses three main questions. The first is the impact of the use of performance measurement systems on the effectiveness of regional strategy execution in the healthcare sector and on the survival of performing arts organizations. The second relates to the role of management control systems in the change process in hospitals and organizations affected by the spending review. The third focuses on managing capacity costs as an efficiency driver in professional organizations.She is the author of numerous books and articles on her topics of interest. Her works have been published in the International Journal of Public Administration, the Journal Of Management Control, Health Services Management Research, Mecosan and Economia & Management, among others. She is the Coordinator of a research area on Management and a member of the Executive Committee at CERGAS (Centre for Research on Health Care and Social Management) in the Government, Health and Not for Profit Division. In 2017Francesca was appointed Secretary General of the Italian Health Economics Association.Francesca earned a degree in Management of Public Administrations at Università Bocconi and a Ph.D. in Management of Public Administrations from Università degli Studi di Parma. In 2018 she succesfully completed the International Teachers Program. She lives in Milan and she has a child.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesca-lecci?pdf=FrancescaLecci.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesco Longo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesco Longo is an Associate Professor at the Department of Social and Political Sciences at Università Bocconi.At SDA Bocconi, he is a researcher at CERGAS Bocconi (Center for Research on Health and Social Care Management) of which he was Director from 2006 to 2012. He is the Director of OASI, the CERGAS/SDA Bocconi Observatory on the healthcare sector and its companies. He is also the scientific director of Masan (SDA observatory on public procurement). He conducts research, education and change management projects in public and healthcare sectors with ministries, regions, public and private companies.His research activities focus on eight key topics: institutional and governance models of public sector organizations; strategies of companies and public interest networks; platform economy and co-production in the public realm,  organization and human resources management in public companies; healthcare organizations management; management of social and primary health care services; public policys design and evaluatiion in an implementation perspective; and change management in enterprises and public sectors.He is the author of numerous books and articles on his topics of interest. His works have been published in Health Care Management Review, Health Policy, Mecosan, Rivista Trimestrale AGENAS and Azienda Pubblica, among others. He is a reviewer for the international journals Public Administration Review, Health Care Management Review, Managing Accounting Review and The international Journal of Public Sector management; he is a member of the scientific committee of the journals Azienda Pubblica and Prospettive Sociali e Sanitarie and he is a referee for Mecosan and Azienda Pubblica. He is a member of many national committees, scientific committees and boards of directors of many major businesses and national organizations. He has been a Visiting Professor in many universities, including the Erasmus University Rotterdam and the Aix-Marseille University; he has also been a Research Fellow at the Kennedy School of Government (Harvard University) and at the University of Potsdam.Francesco earned a degree in Economics from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesco-longo?pdf=FrancescoLongo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Elisabetta Notarnicola",
        "title": "",
        "pic_url": null,
        "intro_desc": "Notarnicola Elisabetta is an Associate Professor of Practice in Government, Health and Not for Profit at SDA Bocconi School of management.At SDA Bocconi she is involved in many executive education initiatives dealing with the health and social care sectors, and more specifically: service design, network management, integrated care, social innovation. She coordinates many projects for both private and public institutions. She teaches accounting and financial management in selected courses in the masters MIMS, MIMHEP and EMMAS.At CERGAS she is the coordinator of the research area Social Policy and Social Innovation and of the Observatory on Long Term Care. Her research interests revolve mainly around social care policies and more specifically around policy planning and policy-making, network management and coordination between the social and health care sectors. Her research focuses on two areas in particular: services for the non self-sufficient, a topic on which she has conducted numerous national and international comparative research projects and innovation in social services, with a special focus on the themes of the design of services and the application of the theories of the sharing and collaborative economies.Her research also includes the area of accounting, with two specializations: financial and economic performance measurement in healthcare companies and the use of accounting information in decision-making processes and evidence based policy making. At Università Bocconi she teaches in the course Public Accounting and Performance Management. She has written several books on policies and services for non self-sufficient elderly  people in Italy and Europe («Il welfare e la Long Term Care in Europa», Egea 2014; various editions of the Long Term Care Observatory Report) as well as numerous articles published nationally on the themes of welfare and social policies.  She is also the author of a book on social innovation in welfare services (\"Il cambiamento nel welfare locale. Lezioni per il riposizionamento dei servizi pubblici\", Egea 2019). She makes regular contributions to the OASI Report (Observatory on Healthcare Organizations and Policies in Italy). She has also written international papers which have been published in journals such as Social Policy & Administration Health Services Management Research. She is a member of IRSPM and EGPA, a chartered public accountant and statutory auditor.She holds an MSc in Management of Public Administration and International Organizations from Università Bocconi and a PhD in Management and Innovation from the Università Cattolica del Sacro Cuore in Milan.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/elisabetta-notarnicola?pdf=ElisabettaNotarnicola.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesco Petracca",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesco Petracca is Fellow of the Government, Health & Not for Profit Knowledge Group at SDA Bocconi School of Management and Research Fellow at CERGAS (Centre for research on health and social care management) Bocconi. He is an Academic Fellow at the Department of Social and Political Science of Università Bocconi and Assistant to the Director of the Master of Science in Cyber Risk Strategy and Governance. At SDA Bocconi he was Teaching Assistant of the Master in Healthcare Management (MiMS).His research activities focus on digital technologies in the health care sector, with a specific focus on mobile health and mHealth applications, their evaluation methodologies and their impact on chronic disease management. Other areas of interest include: institutional and organizational arrangements in the Italian National Health Service; community and primary care; disease management models. He is currently participating in the EU-funded project COMED EU-H2020. He is the author of several articles on his subjects of interest. His work has been published in BMJ Open, JMIR mHealth uHealth, BMC Nutrition, International Journal of Care Coordination, among others.He earned an MSc in Economics and Management of Public Administration and International Institutions from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesco-petracca?pdf=FrancescoPetracca.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Maurizio Poli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Maurizio Poli is a Senior Lecturer in Decision Sciences & Business Analytics at SDA Bocconi School of Management. Since January 2018, he has been the Decision Sciences & Business Analytics Faculty Deputy.  He is an Adjunct Professor of Statistics and Business Analytics at Università Bocconi.At SDA Bocconi, he was the Director of the Global Executive MBA (GEMBA) and he is currently a Faculty member of many Master and MBA Programs. He is the Director of the Post Graduate Program in Business (PGPB) and the Executive Program in Business Analytics (EPBA) at SDA Bocconi Asia Center in Mumbai. He has conducted numerous research, consulting and education projects and workshops in Europe with the major players in the retail, energy, pharmaceutical and banking industries.The issues on which he conducts research and consultancy include business analytics and modelling, risk analysis, data visualization, project management and control systems. Currently, he is specializing in numerous fields including forecasting analysis with innovative techniques and tools, the use of quantitative techniques for planning and the financial evaluation and control of business performances.He is the author of various books and articles on his topics of interest. His works have been published in Economia & Management and Politeia, among others. He has served as a Visiting Professor in European, Asian and American Schools such as CBS, Fudan, Anderson UCLA. Since 2012, he has beenan Executive MBA Council member and he was a Guest Speaker at the GMAC Conference in 2012. Since 1993, he has been a corporate consultant in data analysis, business simulation, financial modeling, business intelligence and management cost control activities. He won the award for the Best Professor SDA Bocconi Open Market Courses in 2011 and the Best Professor in SDA Bocconi MBA Programs in 2007.Maurizio earned a degree in Economics and Social Disciplines (D.E.S.) from Università Bocconi and the ITP (International Teachers Programme) from the Stern School of Business New York University in 2000.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/maurizio-poli?pdf=MaurizioPoli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Aleksandra Torbica",
        "title": "",
        "pic_url": null,
        "intro_desc": "Aleksandra Torbica is an Associate Professor at the Department of Social and Political Sciences at Università Bocconi.Her collaboration with SDA Bocconi began in 2002. She was first the Coordinator and then Director of the Master in International Health Care Management, Economics and Policy from 2012 to 2015 (MIHMEP). She has coordinated major international research projects funded by the European Commission. Over the years, she has worked on numerous research and education projects for several key actors in the pharmaceutical and medical device industries and for national public institutions. Since 2017, she has been the Director of the Center for Research on Health and Social Care Management (CERGAS) within the Government, Health & Non Profit Division of SDA Bocconi. She is interested in exploring the intersection between three disciplines applied to the healthcare sector: policy, economics and management. She focuses on the different methodologies stemming from these disciplines to investigate how economic evaluation analysis can influence and shape decision-making processes at macro (policy) and micro (management) levels in different contexts. More generally, her research activities focus on analyzing the economic evaluation of healthcare programs, health policy, healthcare management, health technology assessment, health economics and budget impact analysis. Aleksandra is the author of numerous publications in HTA, health economics and health services research and she is a reviewer for many international academic journals such as Social Science and Medicine, Value in Health, Health Economics, Health Care Management Review, Pharmacoeconomics, Health Policy. She is the Principal Investigator of the European project H2020 «COMED - Pushing the boundaries of Cost and Outcome Analysis of Medical Technologies”. She is an active member of the International Association of Health Economics (IHEA), the European Health Economics Association (EuheA), the International Society for Pharmacoeconomics and Outcome Research (ISPOR) and a member of the Executive Committee of the Italian Association of Health Economics. Since 2017 she has been the Co-Editor of Value in Health, one of the leading international journals in the field of health economics and health policy.Aleksandra earned a degree in Pharmacy from the University of Belgrade (summa cum laude) and a Ph.D. in Economics and Management of Public Administrations, from Università di Parma, Italy. She is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/aleksandra-torbica?pdf=AleksandraTorbica.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Veronica Vecchi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Veronica Vecchi is an Associate Professor of Practice of Government, Health and Not for Profit at SDA Bocconi School of Management. She is a contract professor in \"Long Term Investment and Public Private Partnership\" and \"Financial Management\" at Università Bocconi.At SDA Bocconi, she has been the Director of Executive Education at SDA Bocconi Asia Center - Mumbai since 2014 and Director of the International Executive Masters in Business (IEMB) since 2015.She has been the Director of Impact Investing Lab  since 2013,  Director of the executive program in public procurement for the healthcare sector (MASAN) since 2016 and since 2017 she has served as a researcher in the MASAN Observatory, a research group set up by CERGAS Bocconi and SDA Bocconi on public procurement in the healthcare sector. Since 2005 she has been the director of programs (open market and custom) on public private partnerships, local development and public financial management. She has run numerous executive education programs, research and consultancy projects for Institutions and private companies.Her research activities focus on public management; public private partnerships for infrastructure and business development; project finance; business government relations; impact investment and social innovation; public policy and management for entrepreneurial development and competitiveness; financial strategies and evaluation for public investments and infrastructures; public procurement. She is the author of numerous national and international books and scientific articles. Her works have been published in presitgious journals such as Health Policy, Public Management Review, the American Review of Public Administration, the Journal of Economic Policy Reform, the Journal of Comparative Policy Analysis and Public Money Management, the Journal of small business management. She is an external faculty affiliate at Cornell University.  From 2015 to 2018, she served as a member of the Italian Healthcare Ministry board for the assessment of investment projects; she has been a consultant to the African Development Bank, the Asian Development Bank, the World Bank, the Interamerican Development Bank. Since 2012, she has actively taken part in institutional groups, including within   the Italian Treasury Ministry, on public private partnerships. Since 2005, she has been collaborating with Italian local authorities, healthcare organizations and regional authorities in structuring and assessing public private partnership projects. She also serves as a board member of Italgas and is a member of its sustainability committee. Veronica earned a degree in Public Administration and International Institutions from Università Bocconi and a Ph.D. in Public Administration at the Università di Parma.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/veronica-vecchi?pdf=VeronicaVecchi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Sergio Venturini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Sergio Venturini is an Affiliate Professor in the Knowledge Group of Decision Sciences & Business Analytics at SDA Bocconi School of Management. At SDA, he was a member of the Claudio Demattè Research Division Committee from 2006 to 2008. At present, he is a faculty member of the following programs: Master in Business Administration (MBA), Master in Corporate Finance (MCF), Master of International Healthcare Management Economics and Policy (MIHMEP), Master in Public Management (MPM).He has been a Lecturer at the Department of Decision Sciences at Università Bocconi.His research activities focus on business analytics, statistical methods for quality assurance and public health data analysis.He is the author of numerous books and articles on his topics of interest. His works have been published in Annals of Applied Statistics, Cancer Biology & Therapy, Clinical Drug Investigation and Breast Cancer Research and Treatment, among others.He has conducted research and education projects with major enterprises operating in the food industry.He was a Visiting Scholar at Harvard School of Public Health and Johns Hopkins Bloomberg School of Public Health.Sergio earned a degree in Financial Markets and Institutions and a Ph.D. in Statistics both from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/sergio-venturini?pdf=SergioVenturini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Rurale",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Rurale is a Lecturer at the Department of Marketing at Università Bocconi.At SDA Bocconi, he is the Director of the Master in Arts Management and Administration (MAMA). He has conducted research and education projects with major enterprises.His research activities focus on cultural marketing, consumer behaviour, experiential marketing, CRM and marketing communication.He is the author of books and articles on his topics of interest. His works have been published in Psychology and Marketing. He has been a Visiting Professor in many international universities, such as Simon Fraser in Vancouver (Canada), Tinsgua University in Beijing (China), SMU in Dallas (USA), UTS in Sydney (Australia) and Universidad de Aguascalientes (Mexico). He is the Regional President of FAI Lombardia (Fondo Ambiente Italiano) and President of the Istituto musicale superiore Monteverdi Conservatory in Cremona.Andrea earned a degree from Università Bocconi and a PhD in Marketing from Universitat de València.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-rurale?pdf=AndreaRurale.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alex Turrini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Alex Turrini is an Associate Professor at the Department of Social and Political Sciences at Università Bocconi. At SDA Bocconi he has been the Government, Health and Not for Profit Faculty Deputy. Until 2016, he directed the Master in Arts Management and Administration (MAMA) and co-directed the Master in International Arts Management (MIAMM). Between 2012 and 2014, he was the Director of the Executive Master in Management of Public Administration (EMMAP). He has conducted numerous research, education and consulting projects with various national and international public sector organizations.His research activities focus on two main areas. The first is public policies and management in the arts and cultural sector; the second is public network leadership and change in governmental and nonprofit organizations.He is the author of numerous books and articles on these topics. His works have been published in Public Administration Review, Governance, Public Administration, the International Journal of Arts Management, the Journal of Art and Law and Society, among others. He serves as a reviewer for national and international journals and he is the Associate Editor in Management for the International Journal of Arts Management.Alex earned both his degree and his Ph.D. in Management from Università Bocconi. From 2018 to 2020 he was Chair of the Arts Management and Arts Entrpreneurship Division at Southern Methodist University, Dallas (US).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alex-turrini?pdf=AlexTurrini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "David Bardolet",
        "title": "",
        "pic_url": null,
        "intro_desc": "David Bardolet is an Associate Professor of Practice of Strategy and Entrepreneurship at SDA Bocconi School of Management. Since 2018, he has been the Associate Dean for the SDA Bocconi Asia Center.He teaches courses in business strategy, corporate strategy and entrepreneurship. He has also conducted research and education programs with many multi-national companies in a variety of industries. His current research activities focus on helping companies to improve the effectiveness of their corporate entrepreneurship efforts.Recently he has also conducted research on behavioral strategy, resource allocation and strategic decision-making processes. In particular, he studies corporate resource allocation processes and the managerial biases that affect the efficiency of those processes.His works have been published in Journal of Management, Strategic Management Journal and Industrial and Corporate Change, among others, and his research has been presented and discussed at numerous academic conferences. He has won the Bocconi Teaching Excellence Award three times.David earned a degree in Industrial Engineering from Universitat Politècnica de Catalunya in Barcelona (Spain), an MBA from IESE Business School in Barcelona (Spain) and a Ph.D. in Management from the University of California Los Angeles (U.S.).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/david-bardolet?pdf=DavidBardolet.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Beltratti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Beltratti is a Full Professor at the Department of Finance at Università Bocconi. From 2004 to 2008, he was the Dean for the undergraduate area, while from 2000 to 2004 he was the Director of the graduate program in Economics (CLE) and of the Bachelor's degree in Economics and Social Sciences (DES) at Università Bocconi. Since 2016, he has been the Academic Director of the Executive Master in Finance. His research activities focus on four main areas: stock markets, banks, risk and corporate governance. He is the author of several articles on his topics of interest. His works have been published in the Journal of Financial Economics, the Journal of Econometrics, the Journal of Monetary Economics and Oxford Economic Papers, among others. In the early 90s, he coauthored two papers published with Roberto J. Shiller, Nobel Prize winner for Economic Sciences 2013.He has conducted numerous research, education and consulting projects for some of the leading international business groups operating in the industrial and financial sectors. He has been a Teaching Assistant at Yale University, Visiting Scholar at The London School of Economics and at Melbourne University and a Visiting Professor at Stanford University.He has been President of Eurizon capital since 2012 and, between 2010 and 2012, he was Chairman of the Management Board of Intesa Sanpaolo. He has been a member of the Executive Committee of ABI (The Italian Banking Association), and he currently chairs the Fondazione per l’Educazione Finanziaria (Foundation for Financial Education). Internationally, he is a Board member of EFAMA (European Fund and Asset Management Association) and of the Board of Directors of Alfunds Bank, and President of the BSI Gamma Foundation.Andrea earned a degree in Economics from the Università di Torino and a Ph.D. in Economics from Yale University.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-beltratti?pdf=AndreaBeltratti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesca Casalini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesca Casalini is a SDA Junior Lecturer in the Government, Health & Not for Profit Knowledge Group at SDA Bocconi School of Management. She collaborates with the Knowledge Group of Strategy & Entrepreneurship and she is a Teaching Assistant of the Master in Strategy and Entrepreneurship (MISA). Francesca is also a PhD Candidate in Management at the University of St. Gallen in Switzerland.Her research interests focus on innovative business models based on public-private collaborations and digital platforms. Her teaching activities mainly focus on business planning and business modeling in multiple sectors (both for-profit and non-profit, based on traditional collaborations as well as platforms) and strategic data crunching. Francesca has been a research grantee of the European Investment Bank and a Research Assistant for the World Bank, Asian Development Bank and Inter-American Development Bank on the topic of public-private collaborations. She has also worked with several start-ups, private companies and public administrations in the business planning of new strategic projects based on public-private collaborations.Francesca holds a B.Sc. in Economics and Management with honors from the Università di Bologna and an M.Sc. in Management with honors from Università Bocconi. She is currently pursuing a PhD in Management at the University of St. Gallen.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesca-casalini?pdf=FrancescaCasalini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Mikkel Draebye",
        "title": "",
        "pic_url": null,
        "intro_desc": "Mikkel Draebye is an Associate Professor of Practice of Strategy and Entrepreneurship at SDA Bocconi School of Management. At SDA Bocconi, he is the Coordinator for MBA Entrepreneurial Projects and a Tutor in Università Bocconi’s Start-Up Incubator SpeedMiUp. He is also a member of the Core Faculty at SDA Bocconi Asia Center in Mumbai. He conducts research, education and consulting projects for major players in the transportation, financial services, energy and food industries.Currently, he is doing research into the area of corporate entrepreneurship and innovation and he is actively present on blogs where he comments on other academic themes such as Start-Up entrepreneurship, entrepreneurial finance, strategic management, sports management, corporate social responsibility, non-market strategies and business ethics. More specifically, he is working on three main topics: entrepreneurship, innovation and corporate entrepreneurship and strategic management in sports organizations.He is the author of several books, book chapters, articles and cases, including Start-Up Entrepreneurship - The SMART Way, “Return of the Entrepreneur – Towards a better corporate entrepreneurship definition and taxonomy”, “Strategic Management in Sports Governing Bodies”, Strategic Management of Cultural Institutions.. He forms part of the Scientific Entrepreneurship Committee “ESIC Market” and of the board of directors of some journals, such as Sport, Business & Management and Emerald. He has been a Visiting Professor in leading universities, including Chulanlongkorn University in Bangkok and Nyenrode Business Universiteit in Breukelen (Netherlands).Mikkel earned a degree in Political Science and an MSc in Political Science from Aarhus University (Denmark), an MBA from Università Bocconi and a Ph.D. from LIUC in Castellanza (Varese, Italy).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/mikkel-draebye?pdf=MikkelDraebye.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Beatrice Manzoni",
        "title": "",
        "pic_url": null,
        "intro_desc": "Beatrice Manzoni is an Associate Professor of Practice in the Leadership, Organization & Human Resources Knowledge Group at SDA Bocconi School of Management. She is the Program Director of the HR Management and People Management Executive Open Market programs. She coordinated the Executive Master in Strategic Human Resources Management from 2008 to 2014.Her research focuses on four areas: 1) fostering creativity and innovation at the individual, team and organizational level; 2) understanding and managing generational differences (values, working styles, learning styles, relationship with technology) in the workplace; 3) managing people and designing employee experiences and HR processes, with a specific focus on creative industries; 4) designing and implementing effective learning experiences, leveraging on innovative learning models and methods.Her works have been published in European Management Review, the Scandinavian Journal of Management, the International Journal of Arts Management, Harvard Business Review Italia and Economia & Management and in edited books published by Routledge, Springer, Wiley and Egea. She is also the author of several peer-reviewed teaching cases published in The Case Centre.At Università Bocconi, she is head of the “Project and team management” and “The transformation of cultural sector and art market” courses of the Economics and Management in Arts, Culture, Media and Entertainment program. She is a Visiting Professor at IMT School of Advanced Studies in Lucca within the PhD program in “Analysis and Management of Cultural Heritage”. In 2008 she was a Visiting Professor at Fudan University in China. She takes part in international academic conferences, such as EGOS (European Group of Organisation Studies) and ARCOM (Association of Researchers in Construction Management).Beatrice earned a BSc and MSc in Economics and Management in Arts, Culture, Media and Entertainment from Università Bocconi, a BSc in Architecture from the Politecnico di Milano and a PhD in Construction and Project Management from University College  London (UCL). She has also attended professional courses, such as Coaching (International Coach Academy, 2020), Leading for Creativity (IDEO, 2018), Constructive Collaboration (Kellogg School of Management, 2014) and the Art & Craft of Discussion Leadership Workshop (Harvard Business School, 2011). In 2018 she won the Teaching Innovation Award at Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/beatrice-manzoni?pdf=BeatriceManzoni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giulia Miniero",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA Fellow\n\nMaster degree in Economics for Arts, Culture and Communication, Università  Bocconi, Milan, 2004\nPh.D Business Administration and Management, Università  Bocconi, Milan, 2011Post Doctoral Researcher, Università della Svizzera Italiana, Lugano, SwitzerlandResearch interests: Consumer Behavior, Advertising and Branding, Cultural Industries",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giulia-miniero?pdf=GiuliaMiniero.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Piergiacomo Mion Dalle Carbonare",
        "title": "",
        "pic_url": null,
        "intro_desc": "Piergiacomo Mion Dalle Carbonare is a Junior Lecturer in the Government, Health & Not for Profit Knowledge Group at SDA Bocconi School of Management. He is the Coordinator of the Master in Arts Management and Administration (MAMA) and of the International Program in Arts Management (IPAM). He has conducted numerous research, education and consulting projects with cultural and public institutions. His research activities focus on arts management and territorial marketing. Piergiacomo earned a Master of Public Management from SDA Bocconi School of Management and a BSc in Political Science and International Relations from Fitchburg State University (MA), USA. He is currently a PhD candidate at the l'Universitat de Valencia.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/piergiacomo-mion-dalle-carbonare?pdf=PiergiacomoMionDalleCarbonare.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Marco Morelli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Marco Morelli is an Associate Professor of Practice in Accounting and Control at SDA Bocconi School of Management. He also teaches classes at undergraduate and graduate level at Università Bocconi, Accounting Department.He has been working for SDA Bocconi since 2005. He is currently the Program Director of open programs on finance for non finance managers. He has been involved in many research and education projects with some of the major players in the pharmaceutical, healthcare, sport, publishing, fashion, food and beverage and arts industries.His research activities focus on strategic performance measurement and cost management systems in many industries (food and beverage, fashion, sports, entertainment, pharmaceutical and healthcare). Currently, he is concentrating on three topics: managing innovation in management control systems, the evolving role of the controller and value based management.He is the author of books and articles on management control systems. His works have been published in Health Services Management Research, the Journal of Management Control and the Asian Pacific Journal of Accounting and Economics, among others.Marco earned a degree in Economics and Management in Arts, Culture and Communication from Università Bocconi, a Ph.D. in Management from Università Cattolica del Sacro Cuore in Milan and an ITP (International Teachers Programme) at HEC Paris. He is currently a Visiting Professor at HEC Paris.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/marco-morelli?pdf=MarcoMorelli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Cristina Mottironi",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/cristina-mottironi?pdf=CristinaMottironi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Emanuela Prandelli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Emanuela Prandelli (Ph.D. in Business Economics and Management) is an Associate Professor at the Department of Management and Technology at Università Bocconi. She is also an LVMH Associate Professor of Fashion and Luxury Management.At SDA Bocconi, she is the Director of the Master in Fashion, Experience & Design Management (MAFED) and she teaches innovation management, marketing management, technology marketing and fashion & luxury management. She has coordinated ad-hoc initiatives for several companies operating in the fast moving consumer goods industry, publishing and consumer electronics.Her research activities focus on collaborative marketing and open innovation, digital business and social media marketing . She has a special interest in exploring these topics in the fashion, luxury and publishing industries. She uses experimental design research methods. She is the author of numerous books and articles on her topics of interest. She has published several international articles in leading international journals, such as the Journal of Marketing, the Journal of Interactive Marketing, Organization Studies, California Management Review, MIT Sloan Management Review, the Journal of Business Venturing, among others. She is a reviewer for many specialized journals such as Research Policy, the Journal of Interactive Marketing and Economia & Management.  She won the 2001 Accenture Award for the best paper published in California Management Review in 2000, the “Innovation Excellence Award” in custom executive programs in 2012 and the award for best teacher of the Marketing Department at SDA Bocconi in 2007.  She was also a runner-up for the 2012 Carolyn Dexter Award for the Best International Paper, Academy of Management Conference, for the Theo Scholler-Preis 2011, Munich Best Paper Award Innovation Management, and for the JIM’s 2006 Award for the Best Paper published in the Journal of Interactive Marketing in 2005. She served as a Research Assistant at St.Gallen University and at the Research Center on Technology, Innovation, and eCommerce Kellogg School of Management, Northwestern University, where she was also a Visiting Professor. She was also a visiting Professor at WU, Vien. Emanuela holds a Ph.D. in Management from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/emanuela-prandelli?pdf=EmanuelaPrandelli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Marco Sampietro",
        "title": "",
        "pic_url": null,
        "intro_desc": "Marco Sampietro is an Associate Professor of Practice of Leadership, Organization and Human Resources at SDA Bocconi School of Management. He is an Adjunct Professor of Project Management and Project and Team Management at Università Bocconi.At SDA Bocconi, he is the Director of the EMBA China, Director of the Agile Management executive program and co-Director of the Project Management executive program.He is also a Faculty Member of SDA Bocconi Asia Center. He has conducted numerous research and education projects for more than 200 private and public organizations.His research activities analyse several aspects of project management (strategic project management, project portfolio management, predictive, agile and hybrid project management, project followership, agile project management and human factors in project management), agile management and leadership.He is the author of more than 70 publications (books, articles, papers and case studies). His works have been published, in the Project Management World Journal, the Journal of Applied Project Management, Il Project Manager and Economia&Management, among others. He is an International Academic Advisor of the Project Management World Journal, member of the Scientific Committee of the journal Il Project Manager. From 2015 to 2018 he served as a member the Steering Committee of IPMA-Italy. He has been a Visiting Professor at the International Hellenic University, at the Anton de Kom Universty of Suriname and at the University of Queensland. He is the main author of the Tiscali – D case study, published in The Case Centre, and winner of the prize for best selling case.for two consecutive years.Marco earned a degree in Economics and Corporate Finance from the Università dell’Insubria and a Ph.D. in Vocational Education and Training from the University of Bremen.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/marco-sampietro?pdf=MarcoSampietro.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Emanuele Teti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Emanuele Teti (Ph.D.) is Affiliate Professor of Corporate Finance at SDA Bocconi School of Management and contract professor of Corporate Finance at the Bocconi University in Milan, where he teaches Corporate Finance at the CLEAM degree course and the CLEACC degree course. He is an Associate Professor of Corporate Finance at the University of Pisa.His research interests focus on the world of corporate finance. With particular emphasis, he deals with issues relating to financial analysis, capital budgeting, the financial structure of the company and the relationship with corporate value, extraordinary business operations and M&A. His research and publications span various sectors, including the TMT (Technology, Media & Telecommunications) sector, Utilities and the Arts, Entertainment and Culture sectors.He is the author of over 40 peer-reviewed journals in English. Of these papers, over 15 are published in Journals in Fascia A Anvur, including: Industrial and Corporate Change, Journal of Economic Behavior & Organization, Journal of International Financial Management & Accounting, Technological Forecasting & Social Change, Technology Analysis & Strategic Management, Journal of Management and Governance, Energy Policy, Utilities Policy, Economics of Innovation and New Technology, Expert Systems With Applications, Journal of Management Development, Management Decision, Applied Financial Economics, International Journal of Human Resource Management.He has won two awards for the best paper for the year 2018 for the Corporate Governance: International Journal of Business in Society (2018 Highly Commended Paper Winner) and for the best paper for the year 2014 for the magazine Management Decision (2014 Highly Commended Paper Winner). He also won the Best Traditional Case of the year 2003, DIR “Claudio Demattè” Research Division, SDA Bocconi.He is also the author of several books on corporate finance issues, in their various components.After graduating in Business Administration from Bocconi University, he received a Ph.D. (Ph.D.) from London Metropolitan University of London.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/emanuele-teti?pdf=EmanueleTeti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Marco Tortoriello",
        "title": "",
        "pic_url": null,
        "intro_desc": "Marco Tortoriello is a Full Professor at the Department of Management and Technology at Università Bocconi. From January 2017 to December 2020, he was the Associate Dean of, Masters Division of SDA Bocconi.. His collaboration with SDA Bocconi began in 2015.He has extensive experience designing and delivering executive education programs with companies in a variety of industries such as utilities, financial services/insurance, consulting services, car manufacturing/car components and personal products.His research activities focus on three main areas: informal networks within and across organizations, knowledge sharing and organizational innovation. His research has been published in prestigious academic journals such as the Academy of Management Journal, Organization Science, the Strategic Management Journal, Annals of the Academy of Management and Communications of the ACM, among others. He is a member of the Editorial Board of the Academy of Management Journal and Organization Science. He is a referee for some of the leading National Science Foundations including the US National Science Foundation (NSF). He has been an Associate Professor of Strategic Management at IESE Business School and an Assistant Professor of Strategy at HEC Paris. He has won many awards for his research activities, including the Organization Science Extraordinary Service Award to the Editorial Board in 2016 and the Foundation HEC Research Grant award in 2009.Marco has a degree from Università Bocconi, a Master of Science in Industrial Administration from the Graduate School in Industrial Administration, Carnegie Mellon University (Pittsburgh, USA) and a Ph.D. in Industrial Administration from the Tepper School of Business, Carnegie Mellon University (Pittsburgh, USA). Since 2019 he has been an Associate Editor at the Academy of Management Journal.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/marco-tortoriello?pdf=MarcoTortoriello.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Vittoria Veronesi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Vittoria Veronesi is a Lecturer in Operations and Technology at SDA Bocconi School of Management. She is an Adjunct Professor of Technology, Innovation and Operations Management and Business Strategy in Creative Industries at Università Bocconi.At SDA Bocconi, she is the Director of the Master of Management in Food and Beverage, Director of the Eni Program for Management Development and Director of the Altagamma Academy. She is an Official Faculty Member for MFB (Master of Management in Food & Beverage), MAFED (Master in Fashion Experience and Design), and MBA (Luxury Business Management track). She has conducted numerous research and education projects with companies belonging to the food & beverage and fashion & luxury sectors.Her research activities focus on supply chain management strategy and design and on operations management. Recently, she has focused her research on studying the factors determining Italian Excellence and the link with those which characterize Operations Excellence in the food and beverage industry.She is the author of numerous books and articles on her subjects of interest. Her works have been published in Economia & Management and Logistica & Management, among others. She works with the research center CRITOM (Center for Research into Innovation, Technology and Operations Management) of the Istituto di Economia e Gestione delle Imprese and with SPACE (Centro Europeo per gli Studi sulla Protezione Aziendale). She has been a member of the Board of Directors of Zeroquattro Logistica S.r.l., a company which offers integrated logistics services to the fresh food market. In July 2015, she attended GloColl, the Global Colloquium on participant-centered learning, at Harvard Business School.Vittoria earned a degree in Civil Engineering from the Università degli Studi di Brescia, a Master in Economics and Environmental Management from Università Bocconi and a Ph.D. in Logistics and Supply Chain Management from the Università di Bergamo, in collaboration with the Massachusetts Institute of Technology (MIT, Boston) and the Zaragoza Logistic Centre (Spain).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/vittoria-veronesi?pdf=VittoriaVeronesi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Federico Pippo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Federico Pippo is Senior Lecturer of Corporate Finance and M&A and Director of the Master in Corporate Finance (MCF) at SDA Bocconi School of Management. He is Professor of Corporate Finance at Bocconi University, Bachelor Degree in Economics and Management (CLEAM) and Bachelor Degree in Economics and Finance (CLEF).At SDA Bocconi, he is MBA Faculty Member where he teaches Corporate Valuation and Merger & Acquisition, MAFED Faculty Member where he teaches Corporate Finance and M&A and EMBA Faculty Member where he teaches Financial Accounting. He is the Learning Director of Corporate Master Programs delivered to Italian and International Companies involved both in the industrial and in the financial industries. At SDA Bocconi, he has also delivered and coordinated executive education and research projects mainly focused on financial statements analysis, capital budgeting, strategic and financial planning, corporate valuation and merger and acquisitions.Currently, his research activity is focused on Sustainable Finance and, specifically, on the analysis of green bond pricing determinants, and on corporate non-financial performances linked to the ESG (Environmental, Social and Governance) Indexes. Recently, he has also analyzed the competitive dynamics and the corporate financial strategies in the luxury market.He is the author of books and articles on the subject. His works have been published in the SDA Leading Management, in the Journal of Accounting and Organizational Change, in the E&M Journal and in the cleaning house The Case Centre. He is a Chartered Accountant (i.e. Dottore Commercialista) and CPA and he is member of the Finance and Control Commission of the Chartered Accountant Association of Milan. He also acts as advisor of industrial and financial companies and he is also member of the board medium Italian enterprises.Federico earned a Degree in Business Administration from the Catholic University of Milan, a Doctorate in Business Administration (DBA) and a Master in Business Administration (Full time MBA) from SDA Bocconi School of Management. He is a runner and a sportsman and he is also involved in the coordination of the SDA Bocconi Sport Clubs.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/federico-pippo?pdf=FedericoPippo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Antonia Maria Liuzzi",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/antonia-maria-liuzzi?pdf=AntoniaMariaLiuzzi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giulio Allevato",
        "title": "",
        "pic_url": null,
        "intro_desc": "Giulio Allevato is an Affiliate Professor of Tax & Legal in the Accounting & Control Knowledge Group at SDA Bocconi School of Management.He is an Adjunct Professor of International Tax Law at Università Bocconi.He is a Professor of Tax Law at IE University, Madrid.At SDA Bocconi, he coordinates the Tax Policy Unit, teaches in post-graduate master programs (Executive MBA, Executive Master in Finance, Master in Corporate Finance), coordinates the Osservatorio Fiscale e Contabile and manages Executive and Custom Education programs for major national and multinational enterprises, focusing on domestic and international corporate taxation and legal compliance.In the past, he was a Lecturer of Tax & Law at SDA Bocconi (2015-18), Hauser Global Fellow at the New York University School of Law (2018), and Ernst Mach Scholar at the WU Vienna University of Economics and Business (2014). His research activities focus on corporate and international taxation, compliance and tax risk management.He has authored numerous book chapters and articles, which have been published in major national and international journals.He has been awarded prestigious international research grants, such as the Hauser Fellowship (New York University School of Law), the Ernst Mach grant (WU Vienna University of Economics and Business) and the Michigan Grotius Fellowship (University of Michigan Law School).He exercises the profession of lawyer at Baker McKenzie, with a particular focus on advisory activities in legal and tax compliance.Giulio Allevato earned a degree in Law and a PhD in International Law&Economics from Università Bocconi as well as an International Tax LL.M. from the University of Michigan Law School (U.S.A).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giulio-allevato?pdf=GiulioAllevato.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Gabriella Bagnato",
        "title": "",
        "pic_url": null,
        "intro_desc": "Gabriella Bagnato is a Lecturer at the Department of Management and Technology at Università Bocconi. At SDA Bocconi from January 2017 to December 2020 she was Leadership, Organization and Human Resources Faculty Deputy and from 2004 to 2005 she was involved in projects as an HR Development assistant. Since 2015 she has been the Director of the Master in Organization and Human Resources Management (Master OP) at Università Bocconi.She has worked with SDA Bocconi since 1993. She is responsible for open market and custom initiatives dedicated to the development of managerial and leadership skills for high potential middle managers and executives of Italian and international companies operating in various sectors, from the pharmaceutical to the publishing industry. She teaches in open market initiatives and custom programs on the topics of leadership, change and individual learning, of teamwork, of one on one and one on many communication and of the identification and selection of talents and executives. She is a certified coach and Affiliate of the Columbia Coaching Certification Program, she conducts executive coaching, mainly supporting effective transition management in managerial and leadership roles with increasing complexity.Her research and design activities of new content and formats for management development focus on the issues of Positive Leadership for engagement and sustainable value creation (value added performance, ethics and supporting  wellbeing) according to Positive Leadership, learning and personal change, leadership development and coaching in support of staffing that maximizes the person-organization fit.She is the author of numerous articles and publications on the topics of assertiveness, leadership and staffing. She has been a lecturer at the IOBTC conference held at the University of Capetown South Africa and Cleveland University USA, and in numerous events on the themes of work and career development. She has been an Affiliate professor of the Columbia University Coaching Certification Program since 2015.Gabriella holds a degree in Political Sciences, with a specialization in international economics and politics  and several Masters including the ISMO Master Formazione Formatori (Milan), the three-year course in Counseling Empowerment Oriented at SistemaCounseling Milano, which is SICO and EAC accredited, the Inspiring Leadership course through Emotional Intelligence at Case Western University, the Columbia Coaching Certification Program, the Myers Briggs Type Indicator Certification course, CPP in New York, the path to Hogan certification with Awair in Milan and the path to the use of the Big Five Questionnaire at OS Florence.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/gabriella-bagnato?pdf=GabriellaBagnato.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Benocci",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Benocci is Project & Community Manager and Course Instructor at SDA Bocconi School of Management. His collaboration with the School began in October 1993.At SDA Bocconi, Andrea is the Database Manager. He is the sole teacher of the Financial Databases - Bloomberg course in the following Master programs: Master in Business Administration Full Time (MBA), Master in Corporate Finance (MCF) and Executive MBA (EMBA) and Executive MBA Week-End (EMBAWE).He also administers a number of Master Alumni Communities on LinkedIn, namely the following: Master in Corporate Finance (MCF), Executive MBA (EMBA), Executive MBA Evening Program (EMBAS), Executive MBA Week-End Program (EMBAWE), Global Executive Master in Business Administration (GEMBA), Master of Management in Food & Beverage (MFB), Executive Master in Corporate Finance & Banking (EMCFB) & Master in Real Estate (MRE) and Executive Master in Amministrazione, Finanza e Controllo (EMAFC). He is also the Project Manager of EMBAFOREVER, a special initiative targeted to the School’s Executive MBA Alumni.He is the project manager for SDA Bocconi of some Master in Finance programs, which are run in joint with (or in assistance to) foreign Business Schools, namely the following: ESA - École Supérieure des Affaires in Beirut, Lebanon and AUBG - American University of Bulgaria in Sofia, Bulgaria.From 1996 to 2018, he administered AFCnet, which is the Accounting, Finance & Control Community that gathers the attendance to the Executive Open Programs focused on the most relevant topics for AFC professionals.His main areas of interest and research focus on Financial Databases, Behavioral Finance, Corporate Finance, Community Management, Project Management and Professional Networking.Andrea earned a Degree in Economics and Business Administration from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-benocci?pdf=AndreaBenocci.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Stefano Bonini",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowPh.D. in Business Administration and Management, Bocconi University, Milan, Italy, 2000MSc In Business Administration, Università Bocconi, Milano, 1998                                                               Degree in Business Administration, Bocconi University, Milan, Italy, 1995 Member of the Internal Committee - SDA Bocconi Research Division \"C.Demattè\" (until 2008) Associate Professor of Finance, Stevens Institute of Technology, Hoboken, NJ., USAResearch Interests: Theory of Finance, Financial Economics, Corporate Finance, Corporate Governance, Venture Capital and Private Equity",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/stefano-bonini?pdf=StefanoBonini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Armando Borghi",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA Senior LecturerDegree in Law and International Law, Università Cattolica del Sacro Cuore, MilanFormer Director of Master in Real EstateFormer Head of Finance and Real Estate Business Unit - SDA Bocconi Corporate Finance and Real Estate DepartmentAcademic position and/or Professional activities:Contract Professor of Real Estate Finance, Università BocconiResearch Interests:Real EstateReal Estate fundsReal Estate Corporate GovernanceFinancing in Real Estate OperationsCorporate Real Estate",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/armando-borghi?pdf=ArmandoBorghi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Renzo A. Cenciarini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Renzo Cenciarini is Associate Professor of Practice in Corporate Finance and Real Estate, SDA Bocconi and a Contract Professor at the Department of Management and Technology, Università Bocconi.His collaboration with SDA Bocconi began in 1990. He has coordinated several meaningful research projects and education activities for large Italian and international companies which operate in diverse industrial sectors. He is a member of the faculty of: Master in Business Administration (MBA) (both full-time and part-time), Master in Corporate Finance (MCF), Executive MBA, Global Executive MBA, Executive Master in Finance (EMF), among others. His teaching covers entrepreneurship, asset restructuring, valuation, M&A. He teaches the same topics in custom programs for large multinational corporations and in executive programs.His research activities have always focused on value creation through uniqueness, be it entrepreneurial, disruptive behavior or values. Most recently, his interests have focused on entrepreneurial topics, which have led to the launch of a new course, “Managing the Growing Entrepreneurial Venture” at Università Bocconi. In the past, he has concentrated his research on corporate restructuring, mostly of invested capital.He is the author of several books, book chapters, articles and keynote speeches on the subject of corporate restructuring and the growth of industrial companies.In 1998 he founded Cenciarini & Co., a boutique investment bank operating in equity investments and corporate finance consultancy. In the last 20 years, investments have been focused mainly on companies in need of restructuring, business building and, more recently, start-ups. Cenciarini & Co. has invested on behalf of more than 20 companies, and advised on over 100 M&A deals.Hehas held several positions as a Board member and Chairman of banks and companies, both listed and privately held, in Italy and abroad. He has carried out several assignments for the Italian Ministry of Economic Development, as well as for international institutions and entities. He is a member of several international networks.He earned a degree in Economics magna cum laude from Università Bocconi, where he was the recipient of the Nestlé prize and gold medal winner for his outstanding dissertation. He then earned a Master in Business Administration (MBA) degree from Harvard Business School, where he was the recipient of a JP Morgan Fellowship .",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/renzo-cenciarini?pdf=RenzoACenciarini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Federico Chiavazza",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Business Administration, major in Corporate Finance, Bocconi University in Milan, 1999  \nMaster of Science in Real Estate, New York UniversityResearch Interests: Real Estate Finance",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/federico-chiavazza?pdf=FedericoChiavazza.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Paolo Colla",
        "title": "",
        "pic_url": null,
        "intro_desc": "Paolo Colla is Associate Professor of Finance at Bocconi University. He has published in the Journal of Corporate Finance, the Review of Financial Studies, and the Journal of Finance on the topics of asset pricing and corporate finance. He is also a member of the Group of Economic Adivsors (GEA) at the European Securities and Markets Authority (ESMA).Paolo Colla holds a PhD in Finance from the London School of Economics and Political Science, an MSc in Economics and Finance from Universitat Pompeu Fabra, and a BSc in Economics from Bocconi University. He has been Visiting Assistant Professor at Princeton University-Bendheim Center for Finance (2010-11), and Postdoctoral Fellow at Université Catholique de Louvain-CORE (2004-05). He has taught asset pricing and market microstructure courses at Princeton University, University of Lugano, Universidade Tecnica de Lisboa, Universitat Pompeu Fabra, and IE Business School.His research spans a variety of topics such as asymmetric information in financial markets and corporate financing decisions. He is currently involved in research projects on the pricing of contractual terms in sovereign bonds, the role of board connections in corporate financing decisions, and the interplay between market transparency and the disclosure of insider trades.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/paolo-colla?pdf=PaoloColla.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Maurizio Dallocchio",
        "title": "",
        "pic_url": null,
        "intro_desc": "Maurizio Dallocchio is a Full Professor of Corporate Finance at SDA and at Bocconi University.\nHe was the Dean of SDA Bocconi School of Management from 2003 to 2006. He was also the Director of the Master in Corporate Finance from 2000 to 2016 and Director of the Finance and Real Estate Department from 1992 to 2002. He manages numerous research projects and School awards along with major education initiatives and applied research. A licensed Public Accountant and founder of DGPA & Co in 1991, his main interests lie in M&A, crisis management, corporate restructuring, corporate valuation, strategic and financial planning, corporate governance and sustainability.\nHe has published more than 100 articles, monographs, cases, papers and essays including the book “Corporate Finance” (Wiley and Sons, 5th Ed. 2018 – co-authored), which has been adopted in MBA and MSc in Finance courses throughout the world. He was member of prestigious advisory boards of national and international organizations. He has held the office of president and board member of supervisory bodies in numerous companies and organizations.\nHe has played a key role and been head of special operations including privatizations, IPOs, restructuring plans. He has been called upon as an expert advisor to fulfill roles in banks and financial institutions, including President of the Audit Committee of the European Investment Bank (EIB). He is particularly active in the not-for-profit sector. He has completed the New York City Marathon 23 times in a row.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/maurizio-dallocchio?pdf=MaurizioDallocchio.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alberto Dell'Acqua",
        "title": "",
        "pic_url": null,
        "intro_desc": "Alberto Dell'Acqua is an Associate Professor of Practice of Corporate Finance and Real Estate at SDA Bocconi School of Management. He is a Professor of Financial Management and Corporate Banking at Università Bocconi.At SDA Bocconi, he is the Director of the Master in Corporate Finance (MCF) and he was Co-Director of the Executive Master in Corporate Finance & Banking for two editions. He has conducted research and education projects for some of the major Italian economic associations and institutions.His research activities focus on corporate finance, on private equity and venture capital and on corporate governance. Recently, he has developed five major topics: the dynamics of the credit market and its influence on the cost of debt, the relationship between corporate governance and the equity cost of capital, the relationship between the adoption of principles of social responsibility and corporate/fund performances, the dynamics of corporate debt and the effects of disclosure on stock price dynamics.He is the author of numerous books and articles on his topics of interest. His works have been published in European Financial Management, Corporate Governance, the International Journal of Business in Society, the International Review of Financial Analysis and Applied Financial Economics, among others. He has run many teaching and research projects in international universities, including École supérieure des affaires (ESA)  in Beirut (Lebanon), the University of Benghazi (Libya) and the University of Technology in Sydney (Australia). He has been awarded numerous prizes for teaching and for applied research projects, among them: the “Research Award 2016” by the Accounting, Control, Corporate and Real Estate Finance Department at SDA Bocconi; the prize “DIDASCO challenge 2014” for the best professor in knowledge management at SDA Bocconi. He also received a “Special Mention” in the national contest “An idea for the Country 2011”, promoted by the association Italia Camp, under the High Patronage of the Italian President of the Council of Ministers.  He is the Vice Chairman of a financial advisory company and of an investment company specialized in small and medium enterprises with high growth capabilities. He acts as a member of the board of directors in various companies in commercial and services industries and is a member of the Advisory Board of an international multi-family office.Alberto earned a degree in Business Administration with full marks from Università Bocconi and a Ph.D. in Corporate Finance from the Università degli Studi di Trieste. He is a civil servant, with roles in the administration of local entities and previously he also served as a member of Ministerial committees, all of which are conducted on a pro bono basis. He actively serves as a mentor for start-ups with a particular focus on Fintech initiatives. He is a keen squash player.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alberto-dellacqua?pdf=AlbertoDellaposAcqua.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Dossi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Dossi is an Associate Professor at the Department of Accounting at Università Bocconi.At SDA Bocconi he has been Associate Dean for Faculty since January 2017. He directed the Executive Education Custom Programs Division from 2015 to 2016, and the Accounting, Control and Corporate Finance Department from 2004 to 2014. He was the Program Director of the course Finance for Executives and of CFO Agorà, a learning network of the most influential CFOs of Italian Corporations.His research activities focus on management accounting, performance management and strategic control systems. His current research addresses three main questions. The first is the impact of the use of performance measurement systems on the effectiveness of international strategy execution. The second relates to the determinants of the CFO role and its impact on CFO compensation, organizational power and mechanisms adopted by the Finance Department. The third focuses on the role of management control systems in the change process.He is the author of numerous books and articles on his topics of interest. His works have been published in the Journal of Accounting, Auditing and Finance, Management Accounting Research, Long Range Planning, the Asia and Pacific Journal of Accounting and Economics, among others. He has won numerous teaching and research awards, including the 2008 David Solomons Prize, Management Accounting Research.He has directed programs for senior executives in various industries and in several continents. He has also conducted numerous research, education and consulting projects with leading  multinational clients operating in the energy, food, manufacturing and pharmaceuticals industriesy. He is an expert speaker at international conferences. He serves on the advisory board of various companies. He is a member of the Planning & Control Committee, ANDAF (the Italian association of Finance Directors) and of the Scuola di Praticantato of the Ordine dei Dottori Commercialisti di Milano (the association of Public Accountants), of which he is a member (CPA). He is also a member of the European Accounting Association.Andrea earned an MSc in Economics and Management from Università Bocconi and a Ph.D. in Management from the same university. He is married with six children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-dossi?pdf=AndreaDossi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Stefano Gatti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Stefano Gatti is an Antin IP Professor of Infrastructure Finance at the Department of Finance at Università Bocconi.At SDA Bocconi, he has been the Director of the Full Time MBA and the International Teachers’ Program Director. He also teaches at SDA Bocconi Asia Center in Mumbai. He has conducted research, consulting and education projects for several financial and non-financial institutions in Italy and abroad. He has been a consultant for major multilateral development banks in the field of project and infrastructure finance.His research activities focus on corporate finance and investment banking. Currently, he is focusing on four main topics: corporate financial advisory, infrastructure and project finance, corporate restructuring and private equity.He is the author of a number of books and articles in his research fields. His works have been published in the European Journal of Operational Research, Financial Management, the Journal of Money Credit and Banking and the Journal of Banking and Finance. He is a board member of Economia & Management and was Chairman of the European Financial Management Association in 2005 and 2009. He has taught at Fudan University Shanghai (PRC) and has won the Best MBA Teacher award for 15 years in a row.Stefano earned a degree in Business Administration from Università Bocconi and the ITP (International Teachers Programme) at Manchester Business School in 2003.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/stefano-gatti?pdf=StefanoGatti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Leonella Gori",
        "title": "",
        "pic_url": null,
        "intro_desc": "Gori Leonella is a Lecturer of Corporate Finance at SDA Bocconi School of Management.Her collaboration with SDA Bocconi began in 2002. She is a faculty member of full-time and executive masters (Master in Corporate Finance, MBA and Global Executive MBA, Courses on Enterprise and Financial Risk Management, Financial Management and Corporate Finance). She teaches a Preparatory course at Università Bocconi – Graduate School and she teaches Financial management and Corporate Banking at the Graduate School in Management, Università Bocconi. She has been a team member in research projects financed by the European Union and coordinated by SDA Bocconi School of Management. She is a fellow at the Baffi –Carefin Centre for Applied Research on International Markets, Banking, Finance and Regulation, Università Bocconi. She coordinates Executive Education projects for the top management of a multinational company located in the Far East and she is a Jury Member in the MBA Annual International Competition in Finance organized by SDA Bocconi School of Management with the participation of the most renowned business schools.. She won the SDA Bocconi teaching excellence award – Specialized Masters -  in 2011 and in 2012.Her research is focused on enterprise valuation topics and on private equity. Recently, she has focused on the levels of risk affecting private equity activity and companies in turnaround situations. The results of her studies on private equity appeared in a working paper as part of the Baffi – Carefin Centre Research, presented at the International Conference on Computational and Financial Econometrics (CFE 2016, Seville) and in seminars at Düsseldorf  University and in Rome, l’Università La Sapienza.  She has coauthored books on Enterprise Valuation and several articles published by Economia&Management on private equity activity. She has written about preferential financing and recently she has carried out studies and written an article about the role of Fintech in the financial system.She earned a degree cum laude in Business Administration, Università Bocconi, 2002, a PhD in Corporate Finance, Università di Trieste, 2008. International Teacher Programme, 2009. Her education includes piano studies and some conservatory exams.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/leonella-gori?pdf=LeonellaGori.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Massimo Guidolin",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/massimo-guidolin?pdf=MassimoGuidolin.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Donato Masciandaro",
        "title": "",
        "pic_url": null,
        "intro_desc": "Donato Masciandaro is a Full Professor at the Department of Economics at Università Bocconi. Since January 2017, he has been Ettore Bocconi Department of Economics Liaison Officer at SDA Bocconi School of Management.He is the Director of the Baffi Carefin Centre, Università Bocconi. He has been Head of Ettore Bocconi Department of Economics (2008-2010, 2013-2017) and President of Baffi Carefin Centre (2015-17). He has been an advisor and visitor to several international organizations (International Monetary Fund, World Bank, Inter-American Development Bank, United Nations).His research activities focus on monetary and financial economics, particularly in three areas: central banking (monetary policy and banking supervision), economics and political economy of financial regulation, economics of illegal financial markets. His Impact Factor (June 2020) is 35.His works have been published in leading national and international journals. He is a member of scientific networks, such as RIDGE (Research Institute for Development, Growth and Economics, Central Bank of Uruguay) and IRCCF (International Research Centre on Cooperative Finance, Montreal University). He has won two research awards:  the Falcone and Borsellino International Award in 2011 (Università di Bologna) and the Saint Vincent Award in 1992 (Accademia dei Lincei and Italian Republic Presidency). In 2013 he won the Bocconi Research Excellence Award. He has been a Visiting Scholar at the London School of Economics and Political Science.Donato earned a degree in Economics and Social Sciences from Università Bocconi. He is married with two sons.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/donato-masciandaro?pdf=DonatoMasciandaro.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Antonio Salvi",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Political Economics, Bocconi University, Milan \nPh.D. in Business Administration and Management, Bocconi University, Milan, 1999\nCoordinator of the Master in Corporate Finance, SDA Bocconi (2005-2009)Full Professor of Corporate Finance, Jean Monnet University BariDean of the Faculty of Economics, Jean Monnet University BariResearch Interests: Financial Analysis, Mergers & Acquisitions, Private equity, Corporate Valuation, Corporate governance and firm performance, Art investing, Corporate financial policies",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/antonio-salvi?pdf=AntonioSalvi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Paola Tagliavini",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/paola-tagliavini?pdf=PaolaTagliavini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Lucilla Tealdi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Lucilla Tealdi is Senior Lecturer of Corporate Finance and Real Estate at SDA Bocconi School of Management.At SDA Bocconi, she has been the Director of the Master in Corporate Finance, Lead coach in international specialized Masters, Head of Focus MBA “Global Financial Management”, in charge of internships and placements for the Master in Corporate Finance (MCF), MBA and MIEM Professor. She was a Visiting Professor at the China Europe Business School (1995) and she has taught at the ESA Business School in Lebanon and the American University in Bulgaria. Since 2017, she has been part of the GEMBA (Global Executive MBA) faculty. As part of the Master in Corporate Finance, she initiated a major dual degree program in partnership with Fordham Graduate School (New York). She has conducted research and education projects with leading Italian and international firms.Her research activities focus on coaching, sustainable investment (SRI), capital budgeting and working capital management. Lucilla has studied learning models and learning styles for many years, and also deals with new innovative teaching tools.  In 2018, along with Bocconi BEAT center, she developed an online “Teacher as a coach” course.She is the author of various books and articles on financial communication, sustainability and coaching. She has recently (2020) published a manual on \"Financial Analysis\" with Mc Graw Hill.  From  January 2017, she has been part of the Columbia Coaching Certificate Program revision team at Teachers College, Columbia University (New York).Lucilla earned a degree cum laude in Business Administration and Finance from New York University, a Master in International Economics and Management (MIEM) from SDA Bocconi and an ITP (International Teachers Programme) from London Business School. In 2011, she earned the Columbia Coaching certificate (CCCP cohort 7) cum laude at Columbia Business School.  She is also a certified NBI (Neethling Brain Index) trainer.  She is happily married with two children.  Her passions are alpine skiing, spinning (Soul Cycle) and coaching.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/lucilla-tealdi?pdf=LucillaTealdi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Olga Annushkina",
        "title": "",
        "pic_url": null,
        "intro_desc": "Olga Annushkina is an Associate Professor of Practice of Strategy and Entrepreneurship at SDA Bocconi School of Management. Her collaboration with SDA Bocconi began in 2003. Since then, she has run numerous courses on strategic management, internationalization strategy and scenario planning. She has conducted numerous education and executive education projects for companies (energy, electronics, pharmaceuticals, consumer goods), banks and insurance companies.Her research activities focus on four main topics: international business, emerging markets, differentiation strategy in a global context and strategy execution.She is the author of numerous books and articles on her topics of interest. Her works have been published in Economia & Management, Critical Perspectives on International Business, the European Journal of International Management and International Finance Review, among others. She was a SDA Bocconi coordinator for Italy for the Global Competitiveness Report of the World Economic Forum (2004-07), Aspen Junior Fellow (2007-10) and Visiting Professor at the Graduate School of Business Administration at Moscow State University (Russia) and Munich Business School (Germany). She is the winner of seven awards for excellence and innovation in teaching and in research.Before becoming a faculty member at SDA Bocconi, she worked for several leading management consulting companies.She earned an MSc in Finance and a Ph.D. In Management from the Moscow State University (Russia) and an MBA from SDA Bocconi School of Management.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/olga-annushkina?pdf=OlgaAnnushkina.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Magda Antonioli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Magda Antonioli is an Associate Professor at SDA Bocconi School of Management. She is an Associate Professor atUniversità Bocconi (Department of Social and Political Sciences) and director of Bocconi's M.Sc. in Economics and Management in Arts, Culture, Media and Entertainment. She teaches at Bocconi at undergraduate, graduate and master levels in various courses (Macroeconomics I Tourism, Local Identity and Destination Management I Cities - Cultural Tourism and Urban Life I Tourism Culture and Territorial Marketing I Economic Scenarios Markets and Enterprises I Tourism Policy and Governance).Since 2011 Magda Antonioli has been the director of the SDA Bocconi programe for Executives in General Management for Hospitality and since 2019 she has been the director of the annual executive course in Tourism and Hospitality Management organized for Confcommercio Lecco. At SDA Bocconi School of Management, she has been in charge of various courses in tourism (Local tourist systems, Wine and Food Tourism, Parks, etc.) and she has taught in the Master of Management in Food and Beverage.Her research interests focus on: Tourism Economics and Policies, Environment, Hotel investments, Wine and Food.Since 2019, Magda Antonioli has been a board member of ENIT, Agenzia Nazionale del Turismo (the Italian Government Tourist Board) and Vice President of the European Travel Commission. She has been a member of various committees at national and international level: EU DG Enterprises, UNWTO World Tourism Organization, Chambers of Commerce, ENIT and various Italian regions (from 1990 to 2005). From 2005 to 2010, she was a member of ministerial and regional committees for research and studies on issues related to Environmental Economics. From 2009 to 2011, she was a member of two committees of the Ministry of Tourism for the promotion of the image of Italy. In 2012/2014 Magda Antonioli was appointed President of the Tourism Task Force for the Alpine Convention (Italian Ministry for the Environment) and from 2010 to 2015, she was a Special Advisor for Tourism to the EU Commissioner for Industry and Entrepreneurship. From 2015 to 2017, Antonioli was a member of the technical Committee of the Ministry for Cultural Heritage and took part in drafting the National Strategic Tourism Plan. From 2001 to 2017 Antonioli was the director of the Master Programe in Tourism Economics and Management at Università Bocconi.Magda Antonioli earned a Bachelor degree in Economics from Università Bocconi(1973) and an M.Sc in Financial Economics from UCNW (UK) in 1975. Antonioli is married and has three children and five grandchildren.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/magda-antonioli?pdf=MagdaAntonioli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Massimiliano Bruni",
        "title": "",
        "pic_url": null,
        "intro_desc": "Massimiliano Bruni is an Affiliate Professor of Strategy and Entrepreneurship at SDA Bocconi School of Management. He is an Associate Professor of Business Strategy at IULM University in Milan.At SDA Bocconi, he was head of the Food&Beverage Knowledge Center and he founded and directed the Master of Management in Food&Beverage; at present, he teaches brand strategy, policy, and strategic growth in major multinational enterprises. He has actively participated in numerous strategic education and consulting projects in Europe and Asia, in partnership with leading food&beverage companies. He is a member of numerous advisory boards of Italian and foreign companies and is involved in growth-building projects and repositioning strategies in mature sectors.His research activities focus on company strategies and internationalization processes, strategic management of multinational enterprises and corporate and business strategies. Recently, he has been focusing on three main topics: competitive strategies in food&beverage industries, international growth strategies of brand names, IT impact on customer experience and on the relationship between brand names and their markets of reference.He is the author of numerous books and articles on his topics of interest. His works have been published in the European Management Journal and Economia&Management, among others. He is a member of several strategy committees in medium and large privately-owned companies.He has been a Visiting Scholar at City University Business School (London).Massimiliano earned a degree and a Ph.D. in Business Administration both from Università Bocconi. He completed the ITP (International Teachers Programme) at the London Business School in 1996. He is married with three children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/massimiliano-bruni?pdf=MassimilianoBruni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Sandro Castaldo",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/sandro-castaldo?pdf=SandroCastaldo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesco Daveri",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesco Daveri is a Professor of Practice in Macroeconomics and the Director of the Full-Time MBA at the SDA Bocconi School of Management. Before joining SDA Bocconi, he taught in various Italian and European universities including Università Cattolica (Piacenza campus), Parma, Brescia, Munich and Lugano. He has acted as a consultant for Italy’s Ministry of the Economy, the World Bank, the European Commission and the European Parliament. He has been a member and the Chairman of the Bank of Italy Committee for the granting of the \"Bonaldo Stringher fellowships\".His research activities focus on the relationship between economic policies and productivity trends at the company, industry and aggregate level in Italy, Europe and the United States.His works on these subjects have been published in such journals as Economic Policy, Oxford Economic Papers, Review of Income and Wealth, World Development, Industrial and Labor Relations Review, the Scottish Journal of Political Economy, Rivista di Politica Economica, CESifo Economic Studies. He has been a Visiting Fellow in several universities, such as Harvard, Copenhagen and the Bank of France. He is Op-Ed writer for Corriere della Sera and a member of the Editorial Board of the website LaVoce.info (of which he has been the managing editor). He is also an expert speaker in Italian and international businesses and is often a guest speaker on Tv and radio programs. He has been a member of the Sustainability Committee of Eurizon Capital and is a co-curator of the column \"Italy\" and team leader of Bocconi's contribution to the Transformation Maps of the World Economic Forum.Francesco earned a degree in Economics and Social Sciences from Università Bocconi, an M.Sc. in Development Economics from Oxford University and a Ph.D. in Economics from the Università di Pavia.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesco-daveri?pdf=FrancescoDaveri.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Vitaliano Fiorillo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Vitaliano Fiorillo is a Lecturer in Operations and Technology at SDA Bocconi School of Management. He is a Contract Professor of Management at Università Bocconi.He has conducted research and education projects with major enterprises in several industries such as F&B, Oil & Gas, Agribusiness, Energy and Automation, Commercial Aviation, Automotive where he acquired extensive knowledge.His research activities focus on supply chain management and sustainability with a particular focus on Agribusiness. Recently, he has been working on the following topics: supply chain management in manufacturing and services businesses; agribusiness, sustainable agriculture and agribusiness management; supply chain management and sustainability in the food & beverage industry; food security, food safety; sustainable supply chain management; sustainability and sustainable operations; environment and sustainable development.He is the author of several articles and business cases at international level. He has been awarded the International Prize for the EFMD Case Writing Competition with the Case “Boeing 787: Cleared for Take Off?”. He is the author of the book “Il Futuro del Biologico. Modello di Sviluppo per l’Agroalimentare” (Egea, Milan, 2015) on the development of the organic food industry.Vitaliano earned a degree in Political Science from the Università degli Studi di Pavia, a Master in International Relations from Centro Alti Studi per la Difesa, a Master in Environmental Economics and Management from Università Bocconi and a Ph.D. in Logistics and Supply Chain Management, from the Università di Bergamo, in partnership with Università Bocconi and Massachusetts Institute of Technology (MIT) – Zaragoza Logistic Centre (ZLC), 2014.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/vitaliano-fiorillo?pdf=VitalianoFiorillo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesco Gallmann",
        "title": "",
        "pic_url": null,
        "intro_desc": "Francesco Gallmann is a Senior Lecturer in Operations and Technology at SDA Bocconi School of Management. He is a Contract Professor of Operations and Supply Chain Management at Università Bocconi.At SDA Bocconi, he has developed and directed several educational programs both for the custom and the open-enrollment division: \"Supply Chain and After Sales Academies\" for a multinational company in the automotive sector, \"Operations, Purchasing and Supply Chain customized programs\" both for specific companies and Executive MBAs of other international partner institutions and \"LEAN Study Tours conducted in JAPAN\" represent just some examples of his initiatives. Recently, he has also designed and conducted a fully online customized program for a major customer in the food industry. He was a Board member of the SDA Bocconi Alumni Master Association for two mandates (2004-2010) with responsibilities for start-ups and development. Regarding his research, he has conducted numerous applied research, tutorship and consulting projects for multinational and medium-size companies, both in Italy and abroad, mainly in the automotive, food, fashion, design, biomedical, pharmaceutical, oil&gas, energy, electro-mechanical, household appliance and banking industries.\nHis research activities focus on operations and supply chain management, with a special focus on Performance measurement, LEAN management, quick response and agility, logistics, global SCM, collaboration practices, sourcing and procurement and after sales services. His current research addresses two main questions. The first relates to the identification of the major drivers and obstacles to excellence in operations and logistics. The second is aimed at analyzing the effectiveness of assessments to identify performance and Best Practices gaps in operations and the supply chain.He is the author of numerous books and articles on his topics of interest. His works have been published both in academic and managerial journals: Operations Management Research, Economia&Management, Logistica e Management, Strategie&Procurement, among others. Thanks to the LEAN Study Tours in JAPAN, he won the SDA Bocconi Innovation Award for two consecutive years ('08 and '09) and was ranked in the TOP 10 business school programs in the world by the \"L'Expansion\" in '09. He is a  Visiting Lecturer/Professor at the University of Klagenfurt (Klagenfurt, Austria, since 2016), at the IBSS-International Business School Suzhou (Suzhou, China, since 2014) and at the University HEC of Lausanne (Lausanne, Switzerland, 2008-2011). He also actively participates in the EUROMA and APICS Supply Chain Council international networks. He boasts international professional experiences in management consulting in multinational companies mainly in the automotive industry and as an entrepreneur\nin renewable energies (biogas). Francesco, a Swiss citizen, earned a degree in Environmental Engineering from the Politecnico di Milano, an MBA from SDA Bocconi and a Ph.D. in Management from Neuchâtel University (Switzerland). He is married with a child. Sailing, golf (Swiss National Champion in '86 and '87) and traveling in developing countries are his main passions.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesco-gallmann?pdf=FrancescoGallmann.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Ferdinando Pennarola",
        "title": "",
        "pic_url": null,
        "intro_desc": "Ferdinando Pennarola is an Associate Professor at the Department of Management and Technology at Università Bocconi.His collaboration with SDA Bocconi began in 1986. He is the Director of SDA Bocconi GEMBA (Global Executive MBA). He is a Faculty member of the MBA Full time, EMBA, MFB and MISA. He is also a Faculty member of SDA Bocconi Asia Center, Mumbai (India).Every year, he leads several top executive workshops on change management issues for companies belonging to the following industries: banking and finance, healthcare and pharmaceutical, automotive and transportation, telecommunications and IT, tourism, fashion and luxury, oil and gas, media and entertainment, infrastructure building and development.He is the Program Director of major custom initiatives for top executives and senior leaders, operating globally.His research activities focus on change management, organizational design, ICT – mediated innovation processes, management of professional organizations, responsible leadership and management consulting. Currently, he is investigating the management of change processes combined with the adoption of information technologies, within organizations and the economy at large.He is the author of numerous books and articles on his topics of interest. His works have been published in Cutting Edge Technologies in Higher Education, the International Journal of Information Management, Information Systems and e-Business Management, the Journal of Management Education, Review of Managerial Science, among others.He has participated in numerous scientific/professional committees and commissions, such as the World Council of AIS (Association for Information Systems), Conference Chair of ICIS 2013 (International Conference of Information Systems). He was Chairman of the board of directors of ISBM (International Schools of Business Management) in London established by Harvard University to offer the ITP (International Teachers Programme), from 2005 to 2016. He was Delegate Rector for E-Learning at Università Bocconi from 2004 to 2012. He was a Visiting Assistant Professor at the Graduate Business School of Florida University and a Visiting Professor at London Business School.Ferdinando earned a degree in Business Administration and a Ph.D. in Business Administration and Management both from Università Bocconi. He also earned an ITP (International Teachers Programme) from the Centre HEC-ISA in Jouy-en-Josas (France).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/ferdinando-pennarola?pdf=FerdinandoPennarola.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Guia Beatrice Pirotti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Guia Beatrice Pirotti is an Associate Professor of Practice of Strategy and Entrepreneurship at SDA Bocconi School of Management. She is a Contract Professor in Business Strategy at the Management and Technology Department at Università Bocconi.She is responsible for external relationships for the Master in Food & Beverage, SDA Bocconi. In SDA Bocconi, she has run many courses in both Italian and English. She has conducted strategy workshops and strategy consulting projects with enterprises operating in the food & beverage, retail, banking, insurance and pharmaceutical industries.Her research activities focus on servitization, organizational resilience, responsible leadership, strategic planning and business model innovation in mature industries. Recently, she has developed a research project on servitization with a particular focus on the food and beverage industry and a study of premiumization in the foodservice industry.She has written wrote the books \"The food of tomorrow\", Egea, 2018 and \"Resilient Organizations: Responsible Leadership in Times of Uncertainty\", Cambridge University Press (2016). Her works have been published in Economia & Management and Harvard Deusto. She is a reviewer for E&M and for The Case Centre. She regularly writes for the column “Strategy Square\", Foodservice of Food Group. She was a Visiting Scholar at Emory University in Atlanta, GA, USA in 2009. She won the Pier Daniele Melegari award for the Best Thesis at the Milan Chamber of Commerce in 2005.Guia earned a Ph.D. in Business Administration and Management in 2010 and a degree in Economics of Art, Culture and Communication in 2003 both from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/guia-beatrice-pirotti?pdf=GuiaBeatricePirotti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Severino Salvemini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Senior Professor at the Department of Management and Technology at Università Bocconi. Degree in Economics, Università Bocconi, Milan, 1974.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/severino-salvemini?pdf=SeverinoSalvemini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Gianluca Salviotti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Gianluca Salviotti is an Associate Professor of Practice of Information Systems at SDA Bocconi School of Management. Since January 2018, he has been the Information Systems Faculty Deputy at SDA Bocconi School of Management. He is the Course Director of Strategy and Governance for Cyber Risk at Università Bocconi. He is part of the Faculty of the SDA Bocconi School of Management Asia Center.At SDA Bocconi, he is the coordinator of the research Lab “Digital Enterprise Value and Organization” (DEVO Lab), Professor of Management Information Systems and Digital Transformation for the MBA, EMBA, EMBAWE, MFB, MISA, IEMB (Mumbai) programs. He is the Program Director of the Executive Education programs “Mastering Digital Evolution”, \"IT Governance\" and “IT Risk Management”. He has managed several custom research and education programs for companies such as ABB, ENI, IBM, Samsung, SAP, TIM, Vodafone.His research activities focus on technologies for digital transformation, links between business complexity and IT Governance and IT risk management. Currently, he is working with the Design Lab of the Massachusetts Institute of Technology (MIT) on the identification and assessment of high impact digital technologies.He is the author of numerous books and articles on Information Systems and Digital Transformation. His works have been published in Economia & Management, Il Sole 24 Ore and Computerworld, among others. He has also authored several books, including “The Blockchain Journey, a guide to practical business applications” and “Digital Manufacturing”. He won the SDA Best Coordinator Award in 2011 for Executive Education (Custom Programs) and in 2012 for Research. In 2013 he received the award for the best innovation project from the Claudio Demattè Research Division. In 2014, he won the Google Faculty Research Award with a study on digitalization in small and medium enterprises. In 2015 and 2016 he received the Sedin-Bocconi Teaching Award for the university program “Computer Skills for Economics”. In 2018 hewas the co-author of the award winning paper for the category \"Move the FIeld Forward\" thanks to a work on the application of Blockchaing technology on corporations. Gianluca earned a degree and a Ph.D. in Business Administration & Management both from the Università degli Studi di Pavia. He received the International Teachers Program diploma from the China Europe International Business School (CEIBS, Shanghai-Beijing). He is married to Lorena, he has two sons, Francesco Jacopo and Alessandro Ludovico.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/gianluca-salviotti?pdf=GianlucaSalviotti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Marco Aurelio Sisti",
        "title": "",
        "pic_url": null,
        "intro_desc": "Marco Aurelio Sisti is an Associate Professor of Practice of Marketing and Sales at SDA Bocconi School of Management and Adjunct Professor at Università Bocconi.At SDA Bocconi, he is the Director of the EMMS/International Executive Master in Marketing & Sales in partnership with Esade Business School, Barcelona. He teaches and directs many executive programs (open programs, custom programs, master MBA and specialist). He co-founded the Commercial Excellence Lab of SDA Bocconi, a research and innovation laboratory on commercial topics developed in partnership with leading international companies. He has been responsible for custom exectuive education programs for marketing & sales topics and the director of the International Channel & Retail Academy. He has broad and deep experience in both executive education and consulting projects in cross-cutting sectors including automotive, industrial manufacturing and service, fashion & design, FMCG, telecommunications and healthcare.His areas of expertise include marketing and sales management, with a special focus on commercial excellence, marketing strategy and planning, digital sales trasnformation, CRM, value and customer management, global & key account management, sales planning and sales force design management, channel & retail management.He is the author of several books and articles on his topics of interest. Recently he has published: Gestire le Vendite – L’eccellenza nel Sales Management (2020 and 2015); Marketing & Sales Excellence (Egea 2014); Sales Management – A multinational perspective (2010 Palgrave McMillan), Commercial Excellence – Tra arte e scienza (2017) in Economia & Management. He has recently carried out research together with CEL Lab, regarding frontier topics in sales: DCT - Digital Commercial Transformation, SCM - Sales Content Management. He has taught marketing and sales management at the Universidad Autonoma de Barcelona and the Universidad Federico Santa María in Santiago (Chile). He has been a Visiting Professor at the Kuopio University (Finland) and a member of the AKAM Association for Key Account Management. From 2007 to 2015 he held the chair of Marketing at LUM University of Casamassima. He has won many awards for excellence in teaching and program directing (2015, 2011 and 2007) at SDA Bocconi.Marco earned a degree from Università Bocconi and an ITP (International Teachers Programme) from the IMD in Lausanne.He is really passionate about photography, nature trips and hiking/mtb tours and winter/water sports (e.g. sailing, windsurfing and surfing). He has practiced water sports at a competitive level for several years.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/marco-aurelio-sisti?pdf=MarcoAurelioSisti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giuseppe Stabilini",
        "title": "",
        "pic_url": null,
        "intro_desc": "Giuseppe Stabilini is an Associate Professor of Practice of Procurement & Supply Management at SDA Bocconi School of Management, where, since January 2017, he has been the Operations and Technology Management Faculty Deputy.Furthermore, at SDA Bocconi he is the Director of the Executive Program in Procurement & Supply Management and head of the Supply Chain Management module in the Full Time MBA. At Università Bocconi he teaches Global Operations & Supply Chain Management in the Master of Science International Management; Operations Management, and Supply Chain Management, both programs of the Master Memit (Master in Economia e management dei trasporti, della logistica e delle infrastrutture- Master in Economics and management of transport, logistics and infrastructures).His research activities focus on procurement and supply chain management, with a strong focus on chief procurement officer responsibilities and decisions, in industrial or service companies. Recently, he has focused his attention on projects dealing with suppliers’ portals and supply chain collaboration.He is the author of numerous books and articles on his topics of interest. His works have been published in Strategie&Procurement, Finanza Marketing Produzione and Economia & Management, among others.He has conducted numerous research, in-house education and consulting projects with some of the leading players in the automotive, household appliance, pharmaceutical and telecommunication industries.Giuseppe earned a degree in Business Administration from Università Bocconi and an ITP (International Teachers Programme) organized by HEC in Paris in 2012.He has won many teaching and research awards, including the “Teaching Excellence Award” (SDA Bocconi, Open Programs, 2009), “Teaching Award” (Università Bocconi, 2013/2014) and the award “Innovation in Technology-Based Learning” (SDA Bocconi Learning Lab, 2011).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giuseppe-stabilini?pdf=GiuseppeStabilini.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Carmine Tripodi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Carmine Tripodi is an Affiliate Professor of Strategy and Entrepreneurship at SDA Bocconi School of Management. He is also an Associate Professor of Business Administration at the Università della Valle d'Aosta.He has been working at SDA Bocconi since 1995. In 2015 he became the Scientific Director of the General Management Program for SMEs, a program which he helped design. He is also a regular contributor to Economia & Management magazine, and is editor of the \"Stories\" column. Finally, he has run numerous research and education projects, in English and Spanish, with major national and international companies.His areas of research specialization are SMEs and Tourism. Regarding the SMEs, he deals with strategic management, economic-financial analysis, growth and development processes, contextualized in different economic sectors. In tourism, he has studied both the management of hotel companies and the impact of governmental action on tourist destinations. For both areas of specialization, the experience he has gained has been built on research projects, conducting management education programs, and on numerous consulting projects which have strengthened his ability to apply theoretical knowledge to business realities.He is the author of numerous articles and publications. Among the monographs: “Le condizioni di successo delle imprese alberghiere”, 2008, Egea; “Entrepreneurial Growth in Industrial District. Four Italian Cases”, 2008, Elgar; “Costruire il successo delle destinazioni turistiche”, 2014, Egea. His other works have been published in leading journals such as Economia & Management, the International Journal of Technology Management and Sinergie.Carmine holds a degree in Business Administration and a Ph.D. in Business Administration and Management, both from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/carmine-tripodi?pdf=CarmineTripodi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Gabriele Troilo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Gabriele Troilo is an Associate Professor at the Departement of Marketing at Università Bocconi. From January 2017 to December 2020, he was the Associate Dean for the Open Market and New Business Division and since January 2021 he has been the Associate Dean for SDA Bocconi Online Learning Since 1990, he has been a faculty member of SDA Bocconi in the Marketing Area. He has created, directed and taught in several executive programs such as Basic marketing, Strategic marketing, New product development, Creative marketing, Marketing imagination, Marketing research and Management of marketing information systems. He has been teaching various courses in the Master programs of SDA Bocconi for many years. He has conducted numerous research projects, education programs and consulting projects for major multinationals operating in the food & beverage, mechanics and tool machineries, electrical supplies, publishing and clothing industries, on topics such as strategic marketing, customer insight management, idea generation & new product development, design of marketing units and marketing processes.His research focuses on many subjects related to the organization of marketing activities and processes, such as: Marketing-Sales integration, Marketing knowledge management and market information management; Creativity and innovation management. His current research addresses the impact of big data and AI on marketing capabilities and processes; the impact of market knowledge dimensions on a company’s market performance; marketing in creative industries.He is the author of several books and articles published by national and international publishers and journals. His latest books include Marketing in Creative Industries (Palgrave, 2015). Some of the academic journals which have published his papers are: the Journal of the Academy of Marketing Science, the Journal of Product Innovation Management, Industrial Marketing Management, Psychology & Marketing, the Journal of Business Research, and Economia & Management. He has been a Visiting Professor at Universidad Autónoma de Barcelona (Spain) and at ESCP-EAP Paris (France), and a Visiting Scholar at Cardiff Business School (UK) and Georgia Institute of Technology, Atlanta (USA). He has also been Vice President of EMAC (European Marketing Academy, the largest European association of marketing scholars), where he is now a Fellow. He has received several awards for his excellence in teaching and research at Università Bocconi.Gabriele earned a degree in Business Administration and a Ph.D. in Business administration from Università Bocconi, and an ITP (International Teachers Program) at London Business School. He loves travelling, tasting good food and beverages, listening to good music, and spending time with friends. In 2010, after years of international volunteering, he founded a nonprofit organization supporting projects for children from disadvantaged families in South America, to which he devotes most of his spare time.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/gabriele-troilo?pdf=GabrieleTroilo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Silvia Zamboni",
        "title": "",
        "pic_url": null,
        "intro_desc": "Silvia Zamboni is a Lecturer at the Department of Management and Technology at Università Bocconi. She is a Contract Professor at Poli.design S.c.r.l and the Università degli Studi di Milano.At SDA Bocconi, she coordinates the Executive Open Enrollment Programs in Operations & Technology Management, specifically for the Innovation Management courses. She has conducted research and in-house education projects with enterprises operating in various industries, such as pharmaceutical, automotive and related services, machinery, medical devices, home appliances and banking.\nHer research activities focus on supply chain management and network collaboration for innovation, innovation and technology management, service purchases and development, project and multi-project management.She is the author of books and articles on her topics of interest. Her works have been published in journals such as Economia & Management and Procurement Channel, among others. In 2013 she won EFMD’s Case Writing Competition - Best case for the section” “Bringing Technology to the Market, with the business case “787 Dreamliner Cleared for Take-off?” Part A, B, C, written in collaboration with V. Fiorillo and R. Secchi, SDA Bocconi for The Case Center.Silvia earned a degree in Business Administration from Università Bocconi and a Ph.D. in Logistics and Supply Chain Management from the Università di Bergamo in collaboration with Massachusetts Institute of Technology - Zaragoza Logistic Centre (MIT-ZLC). As part of her continuous education, she concluded an intensive course in “Innovative Pedagogy in Challenging Times” in 2015 at CEIBS, China Europe International Business School (Shanghai and Beijing, 2015, ITP, International Teachers Program).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/silvia-zamboni?pdf=SilviaZamboni.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Massimo Aielli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Massimo Aielli is a Senior Lecturer of Management Control Systems at SDA Bocconi School of Management. He is an Adjunct Professor in Accounting and Control at Università Bocconi.At SDA Bocconi, he was in charge of Management Accounting courses in MBA programs (2000-2005), Custom Executive Education Programs Director for the Accounting and Control department (2001-2005) and Director of the Executive Master Administration Finance Control program (EMAFC, 2008-2013). Since 2018 he has been Category Manager for education programs on Management and Control Systems. He has conducted research and education projects with some major players in the automotive, power generation, fashion & design, banking, pharmaceutical, telecommunications, information technology, building, chemical, energy and food industries.His research activities focus on management and control systems, performance measurement systems, cost containment systems, planning systems and business innovation. Currently, he is developing digital cost management and the links between planning systems and business innovation.He is the author of numerous books and articles on his topics of interest. His works have been published in Quaderni di Management, Sviluppo & Organizzazione, Lecco Economia and Italia Oggi, among others.Massimo earned a degree in Business Administration from Università Bocconiand an ITP (International Teachers Programme) at the Institut d'Administration Des Entreprises di Aix-En-Provence (France). He is certified as a Business Innovation Manager at the GIMI (Global Innovation Management Institute) in Boston. He is married with two children and is passionate about watercolors, ballroom dancing and drone aerial photography.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/massimo-aielli?pdf=MassimoAielli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giorgio Brandazza",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Economics, Bocconi University, Milan, 1982\nCo-director of MAFED (Master in Fashion Experience and Design Management) until 2007Research Interests: Fashion and design",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giorgio-brandazza?pdf=GiorgioBrandazza.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Gabriella Lojacono",
        "title": "",
        "pic_url": null,
        "intro_desc": "Gabriella Lojacono is an Associate Professor at the Department of Management and Technology and Director of the Made in Italy Vertical, B4I.She is a senior researcher of the Gucci Lab, Università Bocconi. From January 2017 to December 2020, she was Faculty Deputy of the Strategy and Entrepreneurship Knowledge Group. She has been the Director of the Executive Master Emilux since 2016. She has run several executive education open programs and custom initiatives with some of the leading companies in apparel and leather goods, design, jewelry, hospitality, F&B, automotive, eyewear, cosmetics. Her research projects have focused on the international growth of the Made in Italy industries and companies as well as on luxury strategy and business models.She is the author of numerous books and articles on her topics of interest. In 2021, Resilience of Luxury Companies in Times of Change, De Gruyter, by G.Lojacono and L. Ru Yun Pan will be published by De Gruyter Her works have been published in Economia & Management, Sloan Management Review, Long Range Planning and International Business Review, among others. She has authored numerous case studies, filed in international databases, about multinational enterprises such as Farfetch, Starbucks, Davines, Inditex, Ferrari, Illy, Gucci, Valentino. Gabriella earned a degree in Business Administration from Università Bocconi with a specialization in Finance, then a Ph.D. in Economics and Management from SDA Bocconi and an ITP (International Teachers Programme) organized by ISBM at HEC in Paris. During her Ph.D., she was a Visiting Scholar at Copenhagen Business School.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/gabriella-lojacono?pdf=GabriellaLojacono.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Elisabetta Marafioti",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowDegree in Economics and Business Administration, Bocconi University, Milan, Italy, 1995\nPh.D. in Strategic Management, Bocconi University, Milan, Italy, 2000Assistant Professor in Strategy and Business Administration, Università degli Studi di Milano – BicoccaResearch Interests: Strategic alliances, mergers and acquisitions, Emerging markets, International strategies, Value creations, Systems modelling, Airline and fashion industry",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/elisabetta-marafioti?pdf=ElisabettaMarafioti.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Lucia Paladino",
        "title": "",
        "pic_url": null,
        "intro_desc": "SDA FellowMSc of International Management, Bocconi University, Milan, Italy, 2009\nBachelor in Business Administration, University of Genova, Italy, 2007Research Interests: Strategic management in fashion companies, Internationalization and diversification strategies in fashion companies, Branding strategies in fashion and luxury companies, Digital media and fashion companies",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/lucia-paladino?pdf=LuciaPaladino.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Annalisa Prencipe",
        "title": "",
        "pic_url": null,
        "intro_desc": "Her collaboration with SDA Bocconi began in 1996, when she joined the Bocconi faculty as a teaching and research assistant. She became a Full Professor at the Department of Accounting in 2016, and since 2020 she has been KMPG Chair in Accounting. Currently she is also the Dean of the Undergraduate School at Università Bocconi. At Bocconi, Annalisa Prencipe teaches mainly graduate, post-graduate and executive master courses.  Her teaching activities are focused on the topics of financial reporting, financial statement analysis and consolidation accounting.Her research activities focus on financial reporting quality, voluntary disclosure and corporate governance, with a special interest in private and family firms. She was among the first in Italy to research and teach earnings quality analysis. She is an internationally recognized expert in accounting and reporting in family-controlled firms.She is the author of several books on earnings quality and consolidation accounting, and has published many papers in leading national and international journals such as Management Science, European Accounting Review, the Journal of Business Finance and Accounting, the Journal of Accounting Auditing and Finance, Review of Accounting Studies, European Financial Management, The International Journal of Accounting, Family Business Review, Corporate Governance: an International Review. Her article “Earnings management in family firms: evidence from R&D cost capitalization in Italy” (coaut.  G. Markarian and L. Pozza) received an Honor Mention from the Family Business Review in 2008, while her publication \"Mandatory Audit Firm Rotation and Audit quality\" in the European Accounting Review (coaut. M. Cameran and M. Trombetta) was granted the Bocconi Impact of Research Award in 2020.Annalisa is currently the President-Elect of the European Accounting Association. In the past, she has been a member of the Management Committee and the chairman of the EAA Publication Committee. She has been  Associate Editor of the Journal of Accounting, Auditing and Finance and is an editorial board member of several leading international journals.Annalisa Prencipe earned a degree in Business Administration and a Ph.D. in Business Administration & Management from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/annalisa-prencipe?pdf=AnnalisaPrencipe.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Davide Reina",
        "title": "",
        "pic_url": null,
        "intro_desc": "Davide Reina is a Senior Lecturer in Marketing at SDA Bocconi School of Management, Milan, and SDA Bocconi Asia Center, Mumbai.His main areas of interest are: innovation, customer centricity, new business models, strategic marketing. The industries he mostly focuses on are: circular economy, B2B, automotive and retail.At SDA Bocconi he is responsible for the Value Delivery Program at the EMBAWE (Executive MBA Week-end) and is in charge of the marketing program for the Full-time MBA at the SDA Bocconi Asia Center. Furthermore, he teaches the marketing module of MISA (Master in Entrepreneurship and Business Strategy) and Master FIFA (International Master of Sport Management), and he is responsible for the Retail Module of the MAFED (Master in Fashion, Experience and Design).Over the years, he has managed and taught several workshops, executive courses and consulting projects in Europe, the US and China, for multinational companies operating in the energy and automotive sectors such as: Prysmian, ABB, Pirelli. Davide won the prize as best teacher of all MBA programs in 2010, and the prize as best professor of all executive courses in 2012.He has written five books, several articles, and is currently writing about the topic of innovation and development for Corriere Innovazione (Corriere della Sera) and Il Sole 24 Ore. From 1995 until 2006 he worked as a manager and director of multinationals, in Europe and China.He is a member of the boards of directors in several Italian companies, and a strategy advisor of some major international corporations \nDavide earned a degree magna cum laude in Business Administration from Università Bocconi, and a Full Time International MBA from Vlerick Business School in Belgium.He speaks and writes fluently in both English and French. He is a passionate traveler and runner. He lives in Milan, is married and has a daughter.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/davide-reina?pdf=DavideReina.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Stefania Saviolo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Stefania Saviolo is a Lecturer at the Department of Management and Technology at Università Bocconi.From 2013 to 2015, she was Head of the Fashion & Luxury Knowledge Center at SDA Bocconi and, between 2002 and 2013, she was the Founder and Director of MAFED (Master in Fashion, Experience & Design Management). She has carried out numerous strategy and branding workshops for companies, International Business Schools and Institutions as well as consulting and coaching projects in Italy and abroad for major players operating in the beauty, fashion and design industry.Her research activities focus on business model innovation, fashion, luxury and design management, brand management, and the Chinese market. Currently, she is studying the customer-centric transformation of business models and supply chains in fast moving consumer goods.She is the author of numerous books and articles which have been translated into several languages. Her works have been published in Economia & Management, Enciclopedia Treccani, and Harvard Business Review China, among others. She has been a Visiting Scholar at Stern School of Business, New York University and at the National University of Singapore. She is an independent Board Member of two listed companies where she also serves as President of the Remuneration Committees. In 2014, she launched the first online course (MOOC Massive Open Online Course) on Fashion & Luxury Management for the American Platform Coursera which has seen more than 120.000 students attending in six years. Stefania earned a degree in Business Administration from Università Bocconi, a Ph.D. in International Law and Economics from Università degli Studi di Bergamo and an ITP (International Teachers Programme) at Stern School of Business. She has been a certified public accountant in Milan since 1995.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/stefania-saviolo?pdf=StefaniaSaviolo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Markus Venzin",
        "title": "",
        "pic_url": null,
        "intro_desc": "Markus Venzin is a Full Professor at the Department of Management and Technology at Università Bocconi. Since November 2018 he has been the pro-rector for Innovation. At SDA Bocconi he has been Director of ICE – Innovation and Corporate Enterpreneurship Center, since January 2020.At SDA Bocconi, he has served as the Director of the Strategy and Entrepreneurship Department and as the Director of the Claudio Dematté Research Division. He is actively involved in executive development in a wide range of industries. He also facilitates strategy workshops for top-management teams and offers consulting services to senior executives. He is a frequent speaker at corporate and industry events on such topics as company resilience, internationalization strategies, strategic decision-making dynamics, global knowledge-management systems, and the development of formal planning and control processes in large multinational firms.His research activities focus mainly on four topics: internationalization strategies, innovation and corporate entrepreneurship, strategy processes in large multinational firms and organizational resilience.He is the author of numerous books and articles on his topics of interest. His works have been published in International Business Review, Harvard Deusto Business Review, Advances and International Management and Economia & Management, among others. He has held visiting positions and teaching assignments at the University of Michigan, Fudan University (Shanghai), Copenhagen Business School, Essec (Paris), ESADE (Barcelona) and St. Gallen University. He has worked as a strategist in the manufacturing industry, founded his own consulting firm and has served as a member of supervisory and advisory boards of several multinational firms.Markus earned a degree in Economics from the University of Konstanz, a Ph.D. in Strategy and Organization and a Master in Strategic Management and Organizational Behaviour both from St. Gallen University.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/markus-venzin?pdf=MarkusVenzin.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Greta Nasi",
        "title": "",
        "pic_url": null,
        "intro_desc": "Greta Nasi is an Associate Professor at the Department of Policy Analysis and Public Management at Università Bocconi and Director of the Master of Science in Cyber Risk Stategy and Governance at Università Bocconi  and Politecnico di Milano At SDA Bocconi, she is currently the Director of Research for Government (Government, Health and Not for Profit Division) and the Director of the Executive Master in Management of International Organizations. She was the Director of the Public Management and Policy Department from 2012-2016. She has conducted numerous research, education and consulting projects with some of the leading institutions at national and international level.Her research activities focus on the following topics: innovation and change management in the public sector, digital transformation in public services and in the healthcare sector, service and city management and competitiveness.Since 2016, she has been an Honorary Fellow at the Business School of the University of Edinburgh. She is the author of numerous books and articles on her topics of interest. Her works have been published in Public Administration, Public Management Review and the International Journal of Public Administration, the Journal of Medical Internet Research, among others. She is a member of the editorial board of many journals including Public Management Review, the Journal of Comparative Policy Analysis: Research and Practice (2005-2019) and Review of Public Administration.  She has served on the board of many public administrations such as the International Research Society of Public Management and she is an institutional representative at the Association for Public Policy Analysis and Management.  She has been invited to lecture in many international universities such as Seul National University, Lee Kwan Yew School of Public Policy, ESADE, Erasmus University, among others. Greta was a Fulbright Scholar at the Maxwell School of Public Affairs and Citizenship, where she earned her MPA. She also has a Ph.D. in Public Management from the Università di Parma and a B.Sc. in Public Administration and International Organizations from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/greta-nasi?pdf=GretaNasi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alexander Maximilian Hiedemann",
        "title": "",
        "pic_url": null,
        "intro_desc": "Alexander Maximilian Hiedemann is a Lecturer in Government, Health and Not for Profit at SDA Bocconi School of Management and Contract Professor of the course \"20516 - Management of International Organizations and NGOs\" at the Department of Policy Analysis and Public Management at Università Bocconi. He has collaborated with SDA Bocconi since 2015. He has conducted research and education projects with primary public administrations at national level (Local Authorities, Public Agencies, Preventive Institutions, Central Administrations) and international organizations (governmental and non-governmental organizations) including: the Master of Public Administration (MPA) of which hewas Director in 2018/2019, the Executive Master in Management of International Organizations (EMMIO) and the European Learning Visit, part of the Executive Master in Management of Public Administrations (EMMAP).His research activities focus on Operations Management in public administration and international organizations. Recently he has been involved in research groups related to: the tandem application of \"Lean\" and \"Nudge\", digital growth, evolution of sustainable and integrated urban development models. He has also contributed to research projects focused on \"Strategic HR Management\", as well as projects aimed at comparing the selection and appraisal systems of public managers in Europe and the redefinition of top management's collegial work.He is the author of essays and articles dealing with his topics of interest. Among the most recent publications: Hiedemann A. M., Mion Dalla Carbonare P., Nasi G. (2018) Milano, Monaco, Barcellona: smart city a confronto, Dossier Smart Cities, E&M 1/2018 and Hiedemann A. M., Nasi G., Saporito R. (2016) “A Public Service-Dominant Logic for the executive education of public managers”, Teaching Public Administration.Alexander Maximilian earned a degree in Economics and Management of Public Administration and International Institutions from the Università degli Studi di Ferrara and an MSc CLAPI - Economics and Management of Public Administration and International Organizations from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alexander-maximilian-hiedemann?pdf=AlexanderMaximilianHiedemann.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Leonardo Caporarello",
        "title": "",
        "pic_url": null,
        "intro_desc": "Leonardo Caporarello is a Professor of Practice of Organizational Behavior in the Leadership, Organization & Human Resources Knowledge Group at SDA Bocconi School of Management, and an Adjunct Professor of Organization at the Department of Management and Technology of Università Bocconi. Leonardo is the Deputy Dean of Lifelong Learning at SDA Bocconi School of Management. He is the Delegate Rector for E-Learning and Director of BUILT (Center for Innovation in Learning and Teaching) at Università Bocconi. Former Director (2009-2020) of the SDA Bocconi Learning Lab (Educational Innovation Laboratory of SDA Bocconi School of Management).He is the coordinator of the Negotiation programs and faculty member of the Global Executive MBA and of the SDA Bocconi Asia Center (Mumbai, India). He is part of the faculty team of the following topics: leading and managing effective teams, negotiating successfully, dealing with difficult situations and people, leading initiatives in organizational change, organizational (re)design. He has long-standing and broad experience in designing and teaching graduate and executive education programs – onsite, online, blended.His main research activities focus on the area of organizational behavior. Currently, he is working on the following topics: multi-countries and multi-cultural negotiation processes; managing initiatives in organizational change, at both macro and micro levels; leading teams, in a co-located and virtual setting; analyzing and redesigning organizational structures and processes; designing effective online and blended learning experiences.\nHe is the author of a number of publications in journals and books, at national and international levels. The section \"Publications\" contains a list of selected contributions.He has been a scientific committee member and organizer of several national and international conferences including Vice President for Education, ItAIS 2019-2020; Track chair of the ECIS 2020; Track chair of the ItAIS, from 2016 to 2020; Program Committee member of the ICAT2E (2017); Vice President for Technology-enhanced Learning (ItAIS, 2014); Digital Communication Chair of the International Conference on Information Systems, 2013; Project Leader of the Global Integrative Module Project from 2013-2015. He is a reviewer for some major international conferences and journals, e.g. ECIS, ItAIS, ICIS, the Journal of eLearning and Knowledge Society. He is the co/author of some online business simulations, designed with the SDA Bocconi Learning Lab. Leonardo has been a Visiting Professor at the Keio University in Tokyo (Japan), Fudan University in Shanghai (China) and a Visiting Scholar at Michigan State University (USA).\nHe earned a Specialization in Leadership and Negotiation, Negotiating International Business Deals from Harvard Law School (Boston, USA); a Ph.D. in Organization and Information Systems from Università LUISS (Rome, Italy);  a degree in Law and Business Administration, from Università Bocconi(Milan, Italy).Leonardo has received the following awards: Top 50 Global Thought Leaders & Influencers on Change Management, 2020; Top 50 Global Thought Leaders & Influencers on EdTech, 2020; Top 100 Leaders in Education, 2019, Global Forum for Education and Learning 2019; Rotman School of Management (Canada) 2017 “Teaching Award”; SDA Bocconi 2017 “Innovation in Teaching Award”; SDA Bocconi 2016 “Excellence in Innovation for Executive Education Custom Programs - Banks, Insurance Companies and Financial Institutions\".",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/leonardo-caporarello?pdf=LeonardoCaporarello.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Valentina Mele",
        "title": "",
        "pic_url": null,
        "intro_desc": "Valentina Mele is an Associate Professor at Università Bocconi and Associate Professor at SDA Bocconi School of Management. At SDA Bocconi she has been head of and professor in several courses including Public Governance, Business-government Relations, Corporate Citizenship, International Organizations and the Mangement of International Development. She has taught participants of Executive programs in business, in public management and health and international organizations.Her research activities focus on organization and technological innovation in public organizations; governance and business-government relations; corporate citizenship and cross-sector partnerships; international governance and international organizations.  Her work has been published in high impact journals including the Journal of Public Administration Research and Theory, Public Administration, Governance, the International Public Management Journal, the Academy of Management Journal, the Journal of Business Ethics and Public Management Review among others. Valentina has received several competitive individual grants including the Fulbright studentship and scholarship, the CNR study grant, the CNR short-term mobility grant, and several awards including the Award for excellence in research at Bocconi (7 times), the International Geneva Award (2011 and 2015) and the Best Published Paper, OMT Academy of Management (2016).She serves as Field Editor for the Journal of Public Policy (Cambridge University Press) and she is an editorial board member of Public Administration Review and Governance.She has been a member of the Sustainability Advisory Board, European Alluminium Association and she serves on the Sustainability Board Committee of a company listed on the Milan stock market. Valentina earned an MSc in Economics and Management of Government & International Organizations from Università Bocconi, a Master in Public Policy & Administration from Columbia University and a PhD in Management from the London School of Economics . She is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/valentina-mele?pdf=ValentinaMele.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Paola Cillo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Paola Cillo is an Associate Professor at the Department of Management and Technology at Università Bocconi and at SDA Bocconi she is Director of Research for Corporate and Financial Institutions – Claudio Demattè Corporate and Financial Institutions. She served as the Director of the Master of Science in Economics and Management of lnnovation and Technology (EMIT), at Università Bocconi (2011-2016) and as Vice Director of the Department of Management and Technology at Università Bocconi (2016-2020). She serves as the Department of Management & Technology Liaison Officer and as the academic coordinator for the Concentration in Luxury Business Management of the Full Time MBA Program. She has conducted many research projects and has worked both in executive education programs and consulting activities with some of the leading companies in the FMCG, luxury and retail, digital, and pharmaceutical industries.Her areas of expertise include innovation in symbolic and creative industries, big data and innovation strategies and the reaction of investors to innovation. Currently, she is focusing on the following themes: innovation and new product development, innovation in fashion and luxury industries, Big Data Analytics and innovation and investors’ response to company innovation.She is the author of more than 40 articles and 2 books on marketing strategies, innovation, and new product development. She is currently working on various international research projects with teams in leading institutions in Europe and in the US. Her research has been funded by public institutions and private companies in Italy and abroad and has been published in leading academic management outlets at an international level, such as Journal of Marketing, Research Policy, Journal of Product Innovation Management, European Management Journal, and Long Range Planning among others. She was a Visiting Professor at Tuck School of Business, Dartmouth (USA) in 2008, Visiting Assistant Professor at the Marketing Department of the Carlson School of Management, University of Minnesota in 2005 and Visiting Scholar at Wharton School, University of Pennsylvania in 2000. She currently serves as a independent board member in Miroglio Fashion and in Generali Investment Partners.Paola earned a degree in Business Administration cum laude (1996) and a Ph.D. in Management (2001) both from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/paola-cillo?pdf=PaolaCillo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alberto Grando",
        "title": "",
        "pic_url": null,
        "intro_desc": "Alberto  Grando is a Professor of Operations & Supply Chain Management.He is a Full Professor at the Department of Management and Technology at Università Bocconi.At SDA Bocconi, he was Dean from 2006 to 2012. At Università Bocconi, he was Vice Rector for Development from 2012 to 2016 and Dean for Strategy Implementation from 2017 to 2018. Currently he serves as President of the Evaluation Committee at Università BocconiHis research activities focus on supply chain and logistics management, operations organization and management and performance measurement. Currently, he is taking an interest in sustainable operations management, lean thinking and Industry 4.0.He is the author of numerous books and articles on his topics of interest. His works have been published in the International Journal of Production Research, Production Planning and Control, the International Journal of Automotive Technology and Management, the European Management Journal, Total Quality Management & Business Excellence, Human Systems Management and Economia & Management, among others.He has conducted numerous research projects and workshops in large companies operating in the manufacturing industry as well as in many small and medium-sized enterprises.He was a Visiting Professor at Cranfield School of Management (UK) and at other international universities and schools; he is a Board Member of various Scientific and Academic Advisory Boards of national and international Institutions and research centers.Alberto earned a degree in Business Administration from Università Bocconi and an ITP (International Teachers Programme) from London Business School.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alberto-grando?pdf=AlbertoGrando.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Nicola Misani",
        "title": "",
        "pic_url": null,
        "intro_desc": "Nicola Misani is a Researcher at the Department of Management and Technology at Università Bocconi. He is also a fellow at the ICRIOS research center of Università Bocconi.  At SDA Bocconi, Nicola Misani is the program director of “Creating Value through Sustainability”. He has participated in many research and education programs with ABB, Confindustria Lombardia, Condé Nast, Credit Suisse, Esselunga, SACMI, and many other organizations.His research areas are business strategy, sustainability, and multinational companies. His current research questions focus on, first, the drivers and the strategic implications of sustainability adoption by companies; second, how corporate purposes and organisational forms (e.g. B Corps) influence company strategies; third, how business models can be changed to mitigate external impact and improve a firm’s performance.He is the author of several publications that have appeared in international refereed journals, including the Journal of Business Ethics, Business Ethics Quarterly, Business Strategy and the Environment, Ecological Economics, the Journal of World Business, and International Business Review. Nicola Misani has won numerous teaching and research awards, including the 2015 Academy of Management IM Division CGIO Best Paper Award in International Corporate Governance. Nicola Misani is a member of the Academy of Management (AoM), the Academy of International Business (AIB) and the International Association for Business & Society (IABS).Nicola Misani earned a degree in Business Administration at Università Bocconi and then a degree in Philosophy at the Università degli Studi di Milano. He received his PhD from Radboud University Nijmegen (The Netherlands).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/nicola-misani?pdf=NicolaMisani.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Giuseppe Soda",
        "title": "",
        "pic_url": null,
        "intro_desc": "Giuseppe Soda is a Full Professor at the Department of Organization Theory & Social Network Analysis at Università Bocconi in Milan.He has been leading the SDA Bocconi School of Management as Dean since 2016.\nHe is also the chairman of the SDA Bocconi Asia Center in Mumbai.He has conducted his career at Università Bocconi with many institutional responsibilities, including the direction of the Organization and Human Resources Management Department, the Claudio Dematté Research Division at SDA Bocconi and the Department of Management and Technology at Università Bocconi.He has managed various executive education programs and research projects including: Ferrero MIM, Amplifon LP, Angelini Group Talent Program, Luxottica SNA, Chiesi SNA.His research activity has examined the role of organizational structures, their alignment with the strategy and the network dynamics of intra and inter-organizational collaboration in various industries (tv, construction, energy, banks).He is considered one of the topmost experts on Network Dynamics and he is among the scholars who have advanced organizational design methodologies by extending network analysis methods.His scientific research is renowned internationally and has been published in leading academic journals such as Administrative Science Quarterly, the Strategic Management Journal, Organization Science, the Academy of Management Journal, Strategic Organization, Academy of Management Annals, the Journal of Management, Organization Studies, Research in the Sociology of Organizations, the Journal of World Business, Strategy Science.He has also published several articles in Italian Management and Organization journals and various books. He manages the book collections Leading Management (EGEA - SDA Bocconi) and has directed the book series “Management” (Corriere della Sera - Egea).He obtained a Ph.D. in Business and Management from Università Bocconi and pursued his post-doctoral studies at Carnegie Mellon University. He is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/giuseppe-soda?pdf=GiuseppeSoda.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Ariela Caglio",
        "title": "",
        "pic_url": null,
        "intro_desc": "Ariela Caglio is an Associate Professor of Management Accounting and Performance Measurement at the Accounting Department of Università Bocconi. She is also the Director of the Double Degree Bocconi-ESSEC (École supérieure des sciences économiques et commerciales) (Master of Science in Management). Since January 2017, she has been the Department of Accounting Liaison Officer.She has been a Visiting Professor at prestigious international institutions, such as the London School of Economics and Political Science (LSE) and the University of Manchester and has gained over fifteen years' experience teaching in graduate programs, MBA and executive courses.She has distinguished herself for numerous academic awards including the 'David Solomons Prize' (2013) and the 'Best Instructor Award for Innovation in Teaching' award from Università Bocconi (2016).Her research and professional interests mainly focus on areas such as: performance measurement and management, sustainability and integrated reporting, business planning and budgeting, cost accounting. She is also particularly interested in investigating management accounting practices and control systems in supply chains  in the fashion and football industries.Ariela has published, both nationally and internationally, numerous volumes and articles in prestigious academic and professional journals such as: Accounting, Organizations and Society, Management Accounting Research, European Accounting Review and the Journal of Accounting and Public Policy.She sits on the Management Committee of the European Accounting Association (EAA) and is advisor for UNCTAD (United Nations Conference on Trade and Development) on sustainability reporting.Ariela Caglio graduated with honors in Business Administration and holds a PhD in Business Administration and Management from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/ariela-caglio?pdf=ArielaCaglio.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Angelo Ditillo",
        "title": "",
        "pic_url": null,
        "intro_desc": "Angelo Ditillo is an Associate Professor of Accounting and Control at SDA Bocconi School of Management.Angelo teaches in the full time MBA program and has conducted numerous education projects with Novartis, ABB and UniCredit.His research activities focus on business planning and control of private equity agreements, management control of creative and innovative organizations, inter-organizational control of private and public partnerships, modes of control in knowledge-intensive firms and, more recently, the digital transformation and management accounting revolution. He is the author of numerous books and articles on his topics of interest. His work has been published in Accounting, Organizations and Society, the European Accounting Review, the Journal of Management Accounting Research, Management Accounting Research,the Accounting, Auditing and Accountability Journal, among others. Angelo has won numerous teaching and research awards, including the Best Teaching Award in 2013, Best Teaching Innovation Award in 2018, the David Solomons Prize for the best paper published in 2012 in Management Accounting Research and the 2018 European Accounting Review Best Paper Prize in 2019. Angelo serves on the editorial board of various journals, including the Journal of Management Accounting Research, Behavioral Research in Accounting and theJournal of International Accounting Research. He is a member of the European Accounting Association (EAA), where he also servers as a member of the External Relations Committee, of the American Accounting Association (AAA), and of the Research Advisory Board (CIMA).Angelo earned an MSc in Business Administration from Università Bocconi and a PhD in Business Administration and Management from Università Bocconi. He has one child.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/angelo-ditillo?pdf=AngeloDitillo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Francesco Giavazzi",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/francesco-giavazzi?pdf=FrancescoGiavazzi.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alonso Pena Pina",
        "title": "",
        "pic_url": null,
        "intro_desc": "Lecturer of Banking and InsuranceDegree in Physics, Instituto Tecnologico de Monterrey, Mexico, 1991\nPh.D. in Applied Mathematics, University of Cambridge, 1997Contract Professor, Department of Finance, Bocconi University, Milan, ItalyResearch Interests: Quantitative Finance, Financial Derivatives, Quantitative Risk Management, Couterparty Credit Risk, XVA",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alonso-pena?pdf=AlonsoPenaPina.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Hannes Wagner",
        "title": "",
        "pic_url": null,
        "intro_desc": "Hannes Wagner is an Associate Professor of Finance at Università Bocconi, a Fellow at the IGIER Institute for Economic Research and an appointed member of the ECGI, the European Corporate Governance Institute.He has been a Visiting Professor at London Business School and INSEAD. At SDA Bocconi, Hannes currently teaches in the MBA program. Hannes conducts prize-winning research focusing on corporate finance, investor activism, corporate social responsibility, institutional investors and corporate misconduct. His recent research on asset management was sponsored by the Government Pension Fund of Norway. He is the recipient of several awards, including  the 2020 Michael J. Brennan Runner Up Award for best paper published in the Review of Financial Studies on secret offshore vehicles uncovered in the Panama Papers, the inaugural 2015 AAM CAMRI Prize in Asset Management for his research on hedge fund activism, the 2012 European Finance Association Award for best conference paper for his research on family firm performance during the financial crisis, and the 2014 award for Best Paper in Corporate Finance at the Southwestern Finance Association for his research on outside director compensation.Hannes has won multiple teaching awards while teaching executives and non-executives at Bocconi, Rotterdam School of Management, the University of Oxford, the Duisenberg School of Finance and the University of Munich.Born in Germany, Hannes earned his doctoral degree at the Ludwig Maximilans University of Munich. A keen rower, he is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/hannes-wagner?pdf=HannesWagner.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Valter Lazzari",
        "title": "",
        "pic_url": null,
        "intro_desc": "Valter Lazzari is an Affiliate Professor of Banking and Insurance at SDA Bocconi School of Management and Professor of Banking and Finance at LIUC - Università Cattaneo, Castellanza (Varese, Italy).At SDA Bocconi, he has held the position of Director of the MBA Full-Time Program and has been a member of the Research Committee. He has headed research projects concerning corporate banking services, mutual fund performance analysis, management and governance of financial institutions, structure of the securities industry. At LIUC - Università Cattaneo, he served as Rector and, prior to that, as Dean of the Business School. His research now focuses on corporate governance, management of banks and investment companies, financial regulation and supervision, equity markets, asset management and risk management. He is currently working on mutual fund performance analysis, regulation and supervision of banks, corporate governance and institutional forms of banks, strategic planning in banks. His academic work has been published in refereed academic journals (most recently in the Journal of International Money and Finance, the Journal of Financial Stability, the Financial Management Journal) as well as in books and editorial series. He has also authored, or edited, books on sovereign financing, the hedge fund industry, the structure of the European securities Industry, the relationship between banks and non-financial corporations.  He has been an associate editor of the Journal of Management and Governance and of the European Business Forum, a member of the Scientific Committee of the Institute of Economic Research of the Lombardy Region (IReR), a Visiting Professor of Finance at USI, Lugano (CH) and a lecturer at the University of Washington, Seattle WA, USA. He won a Research Prize both at Università Bocconi and at LIUC - Università Cattaneo and has been recognized as MBA teacher of the year several times.As for corporate practice, he has served as an independent director for almost two decades in several types of financial institutions (a major listed bank, asset management companies, a real estate management company and a ratings agency), and is also Chair or a member of various board committees (Risk, Audit, Related Party Transactions, Remuneration nd Nomination). He has developed extensive experience as an independent member of Asset Allocation Committees for investments in hedge funds, private equity funds and for private wealth management companies.Valter Lazzari graduated cum laude in Economics from Università Bocconi and earned both an M.Sc. and a Ph.D. in Economics from the University of Washington, Seattle, WA, USA.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/valter-lazzari?pdf=ValterLazzari.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Boris Durisin",
        "title": "",
        "pic_url": null,
        "intro_desc": "Boris Durisin is an Affiliate Professor of Marketing and Sales at SDA Bocconi School of Management. He is also an Associate Professor at ESCP Europe-Paris Campus.At SDA Bocconi, he has been a member of the Management Team “EMMS – Executive Master in Marketing & Sales” (in conjunction with ESADE Business School and in collaboration with faculty from Cornell University). He lectures, collaborates with and offers consultation to enterprises operating in the electronic, pharmaceutical and telecommunications industries on marketing strategy, market innovation, market launch of new-to-the-world products and truly innovative technologies.His research activities focus on market innovation (how firms cope with technological innovation and create new markets), on absorption capacity (how firms recognize the value, acquire, transform or assimilate, and exploit knowledge) and on ambidextrous innovation (how firms organize for radical and for incremental innovation).He is the author of numerous book chapters and articles on his topics of interest. His works have been published in the Academy of Management Review, the Journal of Product Innovation Management, and other leading academic journals. He has been a Visiting Professor at Università Bocconi and a Visiting Scholar at the Stern School of Business at New York University and the Sloan School of Management at MIT in Cambridge, MA. \nBoris earned a degree from the CEMS MiM program, graduating from both the Universität St. Gallen and HEC Paris; Boris obtained a Ph.D. in management science from the Universität St. Gallen; he participated in the ITP (International Teachers Programme) held at HEC Paris.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/boris-durisin?pdf=BorisDurisin.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "David Jarach",
        "title": "",
        "pic_url": null,
        "intro_desc": "David Jarach is a Senior Lecturer of Marketing and Sales at SDA Bocconi School of Management. He is also a Professor of Marketing, Pricing Analytics and Marketing of transport services at Università Bocconi.His collaboration with SDA Bocconi began in 1995. Since then, he has held and coordinated hundreds of marketing-focused initiatives with a specific focus on Pricing and Customer Value Management. He is responsible for Pricing courses for both the Full Time MBA and the Executive Master in Marketing and Sales (EMMS). He has coordinated numerous marketing workshops and has offered management consultancy in Europe, North and South America and Asia with companies operating in the energy, optical, engineering, professional services, pharma, biomedical, aerospace, airline&airport, travel retail and automotive+H23 industries, as well as pricing consultancies for B2B environments.His research activities focus on aviation and aerospace marketing, strategic marketing, customer value management and pricing. Currently, he is focusing on the \"marketing 2020\" processes, predictive analysis for pricing decisions as well as marketing in times of crisis.He is the author of seven books (in Italian, English and Chinese), published with EGEA and Routledge. He has also published numerous essays and articles, all relating to air transport management. His latest publication is “Il Marketing ai tempi del coronavirus,”, edited by EGEA in May 2020. His works have been published inleading journals, such as the Journal of Air Transport Management, the Journal of Airport Management, the Journal of Air Transportation and the Journal of Aviation Security. He sits on the editorial board of the Journal of Air Transportation, the Journal of Airport Management, the Journal of Aviation Security and the Journal of Innovative Marketing. He has served as editorialist for air transport issues for both Italia Oggi and MF-Milano Finanza and has frequently been interviewed by the main national and international media. He has been acting as a management consultant on aviation and B2B pricing topics for the last twenty-five years and is recognized as one of the world's top experts on these issues. He has been a Visiting Professor at the Aerospace MBA at Toulouse Business School, at ESIC in Madrid and, at present, he is a Visiting Professor at the Aviation MBA at Donau University (Krems).David earned an MSc in Business Administration from Università Bocconi.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/david-jarach?pdf=DavidJarach.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Fabrizio Castellucci",
        "title": "",
        "pic_url": null,
        "intro_desc": "Fabrizio Castellucci is an Associate Professor at the Department of Management and Technology at Università Bocconi. At SDA Bocconi he has been the Director of the Doctorate in Business Administration (DBA) since 2018 and is a Professor of Leadership. He has conducted education, research and consulting projects with Ferrero, GSK, Pirelli, Prysmian, Samsung and Technogym.His research activities focus on Status, Interorganizational Networks, Learning and Organizational Change. His current research concentrates on affiliations with prestigious individuals and how they affect ratings in the haute cuisine and movie industries, and performance in the music and sport industries.He is the author of numerous articles on his topics of interest which have been published in the Academy of Management Journal, Organization Science, Organization Studies, the Journal of Management, Industrial and Corporate Change, Labour Economics, Strategic Organization, among others. Fabrizio has won numerous teaching awards, including the Best MBA Teacher Award in 2012 and 2014, and the Rotman School of Management Teaching Award in 2015. His teaching activities concern Leadership, Influence, Interpersonal networks, and Power Dynamics and draw upon his experience of various international collaborations, including those with INSEAD and the Judge School of Business, Cambridge University.He is a member of the Academy of Management, the Strategic Management Society and the European Group of Organization Studies. He is also a member of the Editorial Board of the Strategic Management Journal. Fabrizio holds a degree in Business Administration and a PhD in Business Administration from the l’Università degli Studi di Bologna, as well as a Master in Sociology from Stanford University, an M.A. in Business Research and a Ph.D. in Business from Stanford University's Graduate School of Business. He is married with two daughters.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/fabrizio-castellucci?pdf=FabrizioCastellucci.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alessandra Cillo",
        "title": "",
        "pic_url": null,
        "intro_desc": "",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alessandra-cillo?pdf=AlessandraCillo.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Luana Carcano",
        "title": "",
        "pic_url": null,
        "intro_desc": "Luana Carcano is Fellow of Strategy and Entrepreneurship at SDA Bocconi School of Management.At SDA Bocconi, she has been the Coordinator of the MBA full-Time Track in Luxury Business Management and she was Program Manager MAFED (2003-2006) and Young Fashion Entrepreneurs Awards coordinator. She conducted research and training projects for some of the major players in the luxury industry.Her research activities focus on design and execution of strategies, business and corporate level, on management in luxury and premium businesses, on differentiation strategies and on growth and competitiveness strategies.She is the author of numerous books and articles on the subject. Her works have been published in The Journal of Corporate Citizenship, Finanza, Marketing and Produzione e Mestieri d’Arte, among others. She is board member of Luxury Research Journal.Luana eraned a Degree in Business Administration from Bocconi University, a Ph.D. in Economics, Marketing and Corporate Communication from IULM University in Milan and a Master in International Management from Bocconi- Esade.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/luana-carcano?pdf=LuanaCarcano.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Andrea Fosfuri",
        "title": "",
        "pic_url": null,
        "intro_desc": "Andrea Fosfuri is a Full Professor of Innovation at the Department of Management and Technology at Università Bocconi and at SDA Bocconi.Since November 2019 he has been the Dean of the PhD School.\nPreviously he was a faculty member (1998-2012) of the Department of Business Administration at Universitad Carlos III (Madrid), which he chaired from 2009-2011. He has also taught at Boston University and Carnegie Mellon University, and was a research affiliate of the Centre for Economic Policy Research (CEPR).\nHe is an Associate Editor of Management Science and an editorial board member of the Strategic Management Journal. His recently published studies examine, corporate social responsibility in multinational enterprises and digitization in the telecommunications industry. During his career, Andrea has published more than 50 articles in journals like Management Science, the Strategic Management Journal, Organization Science, the Journal of International Economics, the Journal of Industrial Economics, Research Policy, among others.He holds a PhD in Economics from Universitat Pompeu Fabra (Barcelona) and a degree in Management from the Università di Urbino.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/andrea-fosfuri?pdf=AndreaFosfuri.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Dovev Lavie",
        "title": "",
        "pic_url": null,
        "intro_desc": "Dovev Lavie is a Full Professor at the Department of Management & Technology Department at Bocconi University. Before joining Bocconi University in 2017, he served as an Assistant Professor at the University of Texas at Austin and a Full Professor and Vice Dean for MBA Programs at the Technion. He also held visiting positions at the London Business School, University College London, and BI Norway.He has extensive experience working with companies in executive corporate training and consulting. Parallel to his academic career, he worked as a consultant, advising companies in the biotechnology, chemicals, cosmetics, healthcare, education, software, computers, and aerospace and defense industries. He delivered strategy-training modules in companies such as Intel and Microsoft, and engaged in field research and consultation in companies such as National Instruments, Cadence Design, Vignette, Unisys, and Johnson & Johnson. He has also designed and directed unique academic programs, such as the Startup MBA program that enables students to start their companies while earning their MBA. He is an invited speaker in various forums, such as the Strategic Management Society and the Academy of Management conferences.His research focuses on two fundamental questions: how do alliance portfolios evolve? and how does the configuration of these portfolios influence value creation and capture? His research in the information technology sector reveals how technological advancements guide firms' strategic decisions, which in turn determine the composition of partners and the respective nature of alliance relations. He further examines how software firms balance tendencies to explore versus exploit in their alliance portfolios, arguing that absorptive capacity and inertia impose conflicting pressures, but firms balance these tendencies over time and across domains. In subsequent research, he demonstrates how firms balance exploration and exploitation across modes of operation, such as alliances, acquisitions, and internal development, which enhances their performance. He also shows how the interplay of internal resources and network resources of partners contributes to knowledge creation and application in emerging industries, such as nanotechnology. His primary research stream focuses on value creation and capture in alliance portfolios. He contends that in networked industries the nature of relationships matters more than the nature of firms’ resources and that firms can reconfigure their resources following technological changes and by learning from performance feedback. He demonstrates how network resources contribute to firm performance, unless partners enjoy strong bargaining positions. These caveats can be mitigated, however, when the firm facilitates competition among its partners. In related studies, He further reveals how the composition of partners in the alliance portfolio matters, for instance, by considering partners’ countries of origin and strategic and organizational differences. Besides alliance portfolios, he has studied multi-partner alliances, such as the Wi-Fi Alliance, in which firms can benefit by timing their entry to the alliance, deciding about their level of organizational involvement and participating in competing alliances. This research enhances understanding of how alliance portfolios promote value creation and capture and how they balance exploration and exploitation.He is a Sloan Industry Studies Fellow, a recipient of the Strategic Management Society Emerging Scholar Award, a winner of the Academy of Management Newman Award for Best Paper based on a Dissertation, a recipient of the Academy of Management BPS Distinguished Paper Award, a recipient of the INFORMS Best Dissertation Award, and grant holder from United States - Israel Binational Science Foundation, Israel Science Foundation, the Mack Center for Technological Innovation and CIBER. He has served as an Associate Editor of the Academy of Management Journal and Strategic Management Journal and on the editorial boards of the Academy of Management Review, Administrative Science Quarterly, Organization Science, and Strategic Organization. He was elected to the Executive Committee and the Research Committee of the Academy of Management BPS Division, and to multiple roles at the Strategic Management Society, including Program Chair of the Cooperative Strategies Interest Group, Track Director of the Conference Program Committee, and initiator and Co-Chair of the Special Conference in Tel-Aviv. In addition, he has served on the Organizing Committee and Advisory Committee of the Israel Strategy Conference (ISC), which he co-founded. His research has been published in top journals such as the Academy of Management Review, Academy of Management Journal, Strategic Management Journal, Organization Science, Journal of Management, Strategic Organization, and Academy of Management Annals, among other outlets, and noted in the business press, such as by the Wall Street Journal.Dovev received his PhD in Management from the Wharton School at the University of Pennsylvania in 2004. He also holds an MA in Managerial Science and Applied Economics from Wharton (2002), as well as an MSc in Business Administration (1998), a BA in Economics and Management (1996), and a BSc in Industrial Engineering and Management (1996) from the Technion. He enjoys travel, classical music and poetry writing.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/dovev-lavie?pdf=DovevLavie.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Alessandro Minichilli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Alessandro Minichilli is a Full Professor at the Management & Technology Department of Bocconi University. At SDA Bocconi he is currently Director of the Corporate Governance Lab, and co-Director of the eSG Lab - excellence in Sustainability and Governance for SMEs. Since 2021 he is also Faculty Deputy of the Strategy, Enterpreneurship and Governance Knowledge Group. Formerly, he has been  Director of Research - Claudio Dematté Corporate and Financial Institutions Division.His collaboration with SDA began in 2004. Since then, he has taught several courses on Corporate Governance and Family Business both in Master programs (MBA, GEMBA), and in executive courses. In this regard, he is the scientific coordinator of the SDA Bocconi - Elite (Borsa Italiana) program, as well as the director of Board induction initiatives for listed and unlisted companies.His areas of expertise concern the design of corporate governance systems, especially during the transition and managerialization processes of family-owned companies. Currently, his research and dissemination activities are focused on the characteristics and operating mechanisms of the corporate governance structures of large listed companies, as well as on the succession processes in family businesses, with emphasis on the selection and training of new generations. In this respect, he serves as educator and advisor of family firms and business families, as well as an independent expert in the board review process of several listed companies. He is the author of over 70 mainly international scientific publications on these topics. His work has appeared in the most prestigious journals such as Management Science, the Strategic Management Journal and Corporate Governance: An International Review, among others. He is also the author of numerous research reports, in particular the annual report of the Corporate Governance Lab, which monitors the largest 6,000 Italian companies on issues such as ownership, corporate, and managerial governance. For many years, he has collaborated on the development of the AIDAF-Unicredit-Bocconi Observatory on Italian family businesses. He is a member of the scientific board of some major international journals such as Family Business Review, the Strategic Management Journal, the Strategic Entrepreneurship Journal and the Journal of Management Studies. He is part of several international scientific societies including the Academy of Management (AoM) and the Strategic Management Society (SMS).Alessandro holds a Ph.D. in Business Administration and Management from Università Bocconi. He is married and has three children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/alessandro-minichilli?pdf=AlessandroMinichilli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Carlo Altomonte",
        "title": "",
        "pic_url": null,
        "intro_desc": "Carlo Altomonte is Associate Professor of Economics at Università Commerciale Luigi Bocconi and SDA Bocconi School of Management.He was Program Director of World Bachelor in Business and regularly teaches Macroeconomics and International Business Environment in the executive and master programs of SDA Bocconi School of Management, where, during the years, he was awarded the ‘Best MBA Teacher’ prize.Visiting scholar at Paris School of Economics (Panthèon-Sorbonne, Paris, France), London School of Economics (Londra, Regno Unito), European Central Bank, KU Leuven (Lovanio, Belgium).He is a consultant on international trade and investment issues to the European Commission, the European Parliament, the Division of Investment and Enterprise of UNCTAD (UN - Geneva) and the European Central Bank. Member of the Group of Experts on Economic Policy with the Italian Office of the Prime Minister. Senior Research Fellow at the Institute of International Studies (ISPI), Milan; Non-Resident Fellow at the think-tank Bruegel, Brussels.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/carlo-altomonte?pdf=CarloAltomonte.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Enzo Baglieri",
        "title": "",
        "pic_url": null,
        "intro_desc": "Enzo Baglieri is a Professor of Practice of Operations and Technology Management at SDA Bocconi School of Management. He is a Professor of Technology, Innovation and Operation Management at Università Bocconi. Since January 2021 he has been Associate Dean for Master Division at SDA Bocconi.At SDA Bocconi, he has served as Director of the Executive MBA program until December 2020. He has conducted numerous workshops and consulting projects in Europe, North America and Latin America with major t partners operating in the banking, automotive and telecommunications industries.His research activities investigate the strategic management of innovation and technology, service innovation and service industrialization. Currently, he is focusing on the study of the industrialization of services, and the design and engineering of the customer experience. He is the author of numerous books and articles on his topics of interest. His works have been published in the International Journal of Production Research, the International Journal of Automotive Technology and Management, Economia & Management and the Journal of Computational and Applied Mathematics, among others. He has been Coordinator of the Global Executive MBA module, delivered by SDA Bocconi at UCLA Anderson School of Management and he was a Visiting Scholar and Visiting Professor at the University of California San Diego.Enzo earned a degree in Business Administration from Università Bocconi and a Ph.D in Economics and Management of Technology at the Università di Pavia. He accomplished and earned the ITP (International Teachers Programme) at the Stern School of Business, New York University.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/enzo-baglieri?pdf=EnzoBaglieri.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Stefano Caselli",
        "title": "",
        "pic_url": null,
        "intro_desc": "Stefano Caselli is a Full Professor of Banking and Finance at the Department of Finance at Università Bocconi where he is alsoDean of International Affairs. He is Algebris Chair in Long-Term Investment and Absolute Return. For the international activity of Bocconi, he covers several roles within the most relevant academic networks: he is a member of the Steering Committee of CIVICA, the University of Social Sciences (www.civica.eu); he is a member of the management board of CEMS, the Global Alliance in Management Education (www.cems.org); he is Chair for the EMEA Region of PIM, Partnership in International Managemnent  (www.pimnetwork.org); he is Executive Secretary of the External Advisory Board of the School of Transnational Governance at EUI, the European University Institute in Firenze.At SDA Bocconi and Bocconi, he has covered several roles. He was the Academic Director of the SDA Bocconi Asia Center from 2012 to 2015. He was the Director of the Executive Education Custom Program for Banks and Financial Institutions (2006-2012), Academic Director of MSc in Finance (2010-2012), Academic Director of CEMS-MIM (2005-2012) and Director of the Executive Master in Corporate Finance & Banking (2005-2010). Hehas conducted numerous research, education and consulting projects both with leading financial institutions at European level and with corporations for evaluation and corporate governance issues. His research activities focus on the relationship between banking and industrial systems, addressing issues both of banking credit risk management and of corporate finance and capital structure.  His current research activities address three main questions: the impact of private equity and venture capital within investment banking activities on companies’ growth and development; the relationship between corporate governance, regulatory issues and performance of financial institutions; the role of taxation incentives and mechanisms on capital structure.He is the author of numerous books and articles on his topics of interest. His works have been published in the Journal of Financial Intermediation, the Journal of Banking and Finance, European Financial Management, the Journal of Financial Services Research, the Journal of Applied Corporate Finance and Economia & Management, among others. He is a member of the board of SDA Bocconi and he has long-standing experience as an independent director on several boards of corporations and financial institutions as well as an advisor for investment committees. He acts as a columnist and opinion maker for “L’Economia del Corriere della Sera”, as well as radio and television programs. He is a research fellow of BAFFI-CAREFIN (the research center for financial innovation at Università Bocconi) where he is the director of the \"Equita Lab\" on financial markets. He has won   the “Bocconi Teaching Award” and the “Bocconi Research Award” several times. He is an expert guest speaker at international conferences. Stefano earned an MSc in Business Administration from the Università degli Studi di Genova and a Ph.D. in Financial Markets and Institutions from the Università degli Studi di Siena. He is married with two children.",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/stefano-caselli?pdf=StefanoCaselli.pdf",
        "university_school": "3388_EUR"
    },
    {
        "name": "Emilia Paolino",
        "title": "",
        "pic_url": null,
        "intro_desc": "Emilia Paolino is a SDA Fellow in the Leadership, Organization and Human Resource Knowledge Group at SDA Bocconi School of Management and her collaboration with SDA Bocconi began in 2011. She is the Program Director of the Team Leadership Executive Open Market program. She is the Learning Coordinator of the SDA Bocconi GEMBA (Global Executive MBA) in partnership with Rotman School of Management (University of Toronto). She has directed and conducted several research and education projects for companies in the following industries: Banking & Finance, Telecommunications, Food and Pharma.Her research and teaching activities focus on four main topics:  1) enhancing the differences within teams (both under pressure and in normal circumstances), 2) developing authentic self branding consistent with individual development, 3) change management and emotions management (both from individual and team perspectives) , 4) diversity management (focus on gender and age). She is the author of several book chapters and articles. Her works have been published in Harvard Business Review (Italian Edition) Economia & Management, The Case Centre and many others. At Università Bocconi, she is a professor in the Management and Technology Department and is responsible for the \"Culture, Organizational Climate, Communication and Diversity\" course for the Master in Organization and Human Resources Management (Master OP).Emilia graduated from IULM University with a degree in Public Relations and Advertising and she obtained a McS in Training and Development of Human Resources from Bicocca University. She obtained the certification for the Myers Briggs Type Indicator (T&D Training on behalf of OPP).",
        "pdf_url": "https://www.sdabocconi.it/en/faculty/emilia-paolino?pdf=EmiliaPaolino.pdf",
        "university_school": "3388_EUR"
    }
]