[
  {
    "name": "Sophie Manigart",
    "title": "Professor of Corporate Finance at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35884_jpg.jpg",
    "intro_desc": "Sophie Manigart turns theory into practice in the blink of an eye. She specialises in entrepreneurial finance, business angels, venture capital, MBOs, private equity and corporate finance.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Wouter De Maeseneire",
    "title": "Professor of Corporate Finance at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/40574_jpg.jpg",
    "intro_desc": "A passionate and experienced teacher, Wouter thoroughly enjoys explaining financial management principles by linking finance to business models and corporate strategies. His classes are often centred around self-developed cases that discuss the ABInbev deal, Walmart’s financial statements, Dell’s working capital management, Facebook’s IPO debacle, and Apple’s cash position.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Mathieu Luypaert",
    "title": "Professor of Corporate Finance at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/132517_jpg.jpg",
    "intro_desc": "Mathieu Luypaert is specialising in value creation through mergers and acquisitions. He studies how the stock price of merging companies reacts upon the announcement of such a deal, and how potential synergies are realised. He teaches courses on corporate finance and mergers and acquisitions.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Bruno Colmant",
    "title": "Chief Economist at Degroof/Petercam",
    "pic_url": "http://public.vlerick.com/ProfilePictures/61717.jpg",
    "intro_desc": "Bruno used to be partner at Roland Berger, was a former chief of cabinet of minister Reynders where he invented the Notional interest rate. Next to that, he was CFO and member of the Executive Committee and Board of Directors at ING Belgium. Since 2000 he is guest professor at Vlerick and teaches about International Accounting Standards.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Peter Maenhout",
    "title": "Executive Vice-President at GIMV",
    "pic_url": "http://public.vlerick.com/ProfilePictures/25351.jpg",
    "intro_desc": "Peter is a Vlerick alumnus. He did an MBA at University of Chicago Booth School of Business. For 7 years yet, he is Executive Vice-President at GIMV.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Filip Roodhooft",
    "title": "Professor of Accounting at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/51506jpgjpg.jpg",
    "intro_desc": "Filip’s teaching is focused primarily on the finance function as a business partner for an organisation. He also shows non-financial managers the relevance of accounting information for decision-making and strategy execution.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Kristof Stouthuysen",
    "title": "Professor of Management Control at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/119751_jpg.jpg",
    "intro_desc": "Kristof's research, executive program teaching, and consulting focus on the latest techniques for using performance measurement and control systems to implement strategy. The goal is to motivate managers and decision-makers to restructure around delivering superior service and/or product outcomes at significantly lower total cost. Another current project of Kristof considers the role of Big Data to help corporations make better financial decisions.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Hans Buysse",
    "title": "Adjunct Professor at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/73930_jpg.jpg",
    "intro_desc": "Hans is an investment banker with extensive corporate finance experience. Hans specialises in mergers & acquisitions, structured finance (PPP and Cross Border Lease), LBO & MBO.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Philippe Haspeslagh",
    "title": "Professor and Honorary Dean at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/43769_jpg.jpg",
    "intro_desc": "An expert at formulating and implementing winning business strategies, his work on portfolio management and his book on Making Acquisitions Work have become classics in the field. Philippe has been the director of M&A programmes in leading companies and business schools for 30 years. He’s the co-author of the prize-winning book Managing Acquisitions: Creating Value through Corporate Renewal as well as numerous prize-winning M&A cases.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "David Veredas",
    "title": "Professor of Financial Markets at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/181874jpgjpg.jpg",
    "intro_desc": "David Veredas teaches for Masters, MBA, and executives. He is the programme co-director of the Vlerick’s Executive Programme on Asset Management. For more than 20 years, Prof. Veredas has developed research expertise in risk that he publishes on peer review journals. He is also a usual writer of policy documents and opinion pieces in general public newspapers.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Jan Longeval",
    "title": "Lecturer at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/171208_jpg.jpg",
    "intro_desc": "Jan Longeval is an Asset and Portfolio Management Expert. He is owner and founder of Kounselor BVBA and a former Member of the Group Executive Committee & Managing Director at Degroof Petercam. As a lecturer at Vlerick Business School, he is programme co-director of the Executive Programme on Asset Management, where he also teaches a couple of sessions. Furthermore, he shares his experience with our Masters of Financial Management participants in the 'Advanced Asset and Portfolio Management’ programme.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Frederiek Van Holle",
    "title": "Lecturer at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/232364_jpg.jpg",
    "intro_desc": "Frederiek Van Holle is currently Head of Quant Solutions at Degroof Petercam; previously, he was Head of Quantitative Fixed Income Research at Dexia Asset Management. Frederiek holds a Master’s in Banking & Finance (Ghent University) and has recently earned a Doctorate in Business Administration. He has been giving guest lectures at Tilburg University, Ghent University and Antwerp Management School. As a lecturer at Vlerick Business School, Frederiek teaches ‘Advanced Asset and Portfolio Management’ in our Masters in Financial Management programme, and he contributes several sessions to the Executive Programme on Asset Management.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Jan De Bondt",
    "title": "Executive in Residence at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/37309_jpg.jpg",
    "intro_desc": "Jan De Bondt is Executive in Residence at Vlerick Business School. Jan worked for 26 years as a Fixed Income Sales in Brussels, Frankfurt and London. After having built profitable businesses at Goldman Sachs, Merrill Lynch, Lehman Brothers and Societe Generale, he left the execution part of the business in January 2017. He co-founded Consortium Advisory Partners, to provide experienced specialist practitioner advisory capabilities to the financial services sector. Jan is a natural networker who is able to seamlessly connect parties and function as a sounding board for a variety of business objectives and challenges. In 2018 Jan became a Co-founder and Co-Director of the Executive Asset Management Program at Vlerick. Jan is an alumnus of Vlerick Business School ( JMP 1989).\"",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Steve Muylle",
    "title": "Professor of Marketing & E-business at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/51471_jpg.jpg",
    "intro_desc": "Steve is a recognised expert in assessing and enhancing e-business processes. Steve delivers actionable insights into how firms maximise the value of and for customers, offline and online. He has received multiple awards for his research and teaching.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Miguel Meuleman",
    "title": "Professor of Entrepreneurship at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/58266_jpg.jpg",
    "intro_desc": "A passionate teacher in the field of entrepreneurship, Miguel has been involved in projects to make entrepreneurship education more effective. He has launched initiatives to bridge entrepreneurship, education and design, participated in numerous consulting projects, and is the author of several case studies. Miguel is specialised in the areas of new venture creation and growth, buyouts, business model generation and entrepreneurial finance.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Katia Tieleman",
    "title": "Professor of Negotiation & Conflict Management at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/99629_jpg.jpg",
    "intro_desc": "Katia Tieleman is Professor in Negotiation and Conflict Management at Vlerick Business School and a leading authority in the field of negotiations. She is affiliated with the Harvard Program on Negotiation at Harvard Law School. For her high impact interventions, Katia draws from her sophisticated academic background as well as from her rich experience as a practitioner. Katia is the author of the Negotiation Intelligence® (NQ®) approach, providing the concept and tools to boost individual and organisational negotiation and cooperation capabilities. As such she helps participants to develop their personal beliefs and skills, and supports them to broker agreements, to maximise their influence, to develop common ground within and across organisations and to use diversity and complexity to their advantage.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Adjunct Hans Vanoorbeek",
    "title": "",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/75169_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Hans Crijns",
    "title": "Professor of Management Practice at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35846_jpg.jpg",
    "intro_desc": "Hans provides insight into entrepreneurial processes and what they can mean for you. You will be inspired by his dynamic approach − which is pragmatic as well as academic − on how to set up and grow entrepreneurial ventures.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Koen Dewettinck",
    "title": "Professor of HR & Leadership at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35871_jpg.jpg",
    "intro_desc": "One of the leading professors in Vlerick’s Centre for Excellence in Strategic Talent Management, Koen focuses on people performance issues − his main teaching and research interests are employee motivation, performance management and strategic HRM. Koen has worked on employee motivation and performance management issues with numerous public and private companies, including Atlas Copco, BNP Paribas Fortis, Coca-Cola Enterprises, ING, Randstad, the Flemish Government and the Belgian Federal Government.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Frank Goedertier",
    "title": "Professor of Marketing at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/50332jpgjpg.jpg",
    "intro_desc": "Frank makes your brand stand out. Concentrating on developing theories to successfully engage in branding in the digital age, Frank also develops simple marketing tactics to communicate effectively in an era of information overload.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Kurt Verweire",
    "title": "Professor of Strategy and Change at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35930_jpg.jpg",
    "intro_desc": "Kurt is one of the most influential professors in the area of strategy development and implementation in Europe. An enthusiastic strategy professor − who knows how to translate theoretical concepts into practical insights − Kurt has developed hands-on strategy frameworks & toolkits and award-winning case studies.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Pascal Persyn",
    "title": "CEO Perpetos / Guest Speaker at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/40754_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Veroniek Collewaert",
    "title": "Professor of Entrepreneurship at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/76153_jpg.jpg",
    "intro_desc": "Looking into the ‘darker’ sides of investor-entrepreneur relationships, Veroniek’s goal is to make both parties less naive in their dealings with each other and to teach them how to make the most out of their partnership. Veroniek has developed a substantial network of entrepreneurs and angel investors in both Belgium and the USA’s Silicon Valley, where she conducted her research on conflicts between investors and entrepreneurs.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Fredrik Hacklin",
    "title": "Professor of Entrepreneurship at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/222419_jpg.jpg",
    "intro_desc": "Fredrik is specialized in strategic entrepreneurship and innovation, with particular focus on challenges associated with digital disruption, industry reconfiguration and their implications for firm strategy.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Bram Doolaege",
    "title": "Founding partner atStreetwize",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/78072_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Philippe Baecke",
    "title": "Professor of Marketing & Data Analytics at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/151145_jpg.jpg",
    "intro_desc": "Philippe focuses on customer relationship management, business analytics and big data. Equipped with strong data analytics skills, he has coached numerous organisations on big data projects and he has customised business research projects for companies such as KBC, Dunnhumby/Tesco (London), Bisnode, BIG, Mobile Vikings and Sanoma.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Ann Vereecke",
    "title": "Professor of Supply Chain Management at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/35922jpgjpg.jpg",
    "intro_desc": "Ann is a recognised expert in operations management, manufacturing strategy and supply chain management. She has an extensive experience in research and advisory projects.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Karlien Vanderheyden",
    "title": "Assistant Professor at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35909_jpg.jpg",
    "intro_desc": "Karlien focuses on how individuals can enhance the processes and performance of organisations through their own behaviour and interaction with others. Karlien uses her research and experience to teach decision-making skills, cognitive styles and the behaviour and pitfalls of individuals and teams.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Stijn Viaene",
    "title": "Professor of Digital Transformation at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/76321_jpg.jpg",
    "intro_desc": "Stijn is passionate about what it means to successfully create a digital enterprise, capturing the value that comes with the use of novel technological advances such as big data, analytics, social media, mobile computing, and the cloud. The two business research initiatives he developed − Centre for Excellence BPM Network and Centre for Excellence Enterprise Architecture Management − contribute to a significantly better practical and academic understanding of what it means to make optimal use of IT in a contemporary organisational context.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Arne Buchwald",
    "title": "Associate Professor of Digital Transformation and Information Systems bij Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/270410jpgjpg.jpg",
    "intro_desc": "His research and teaching interests center on the interface of the business administration and the information systems disciplines. Recent research projects particularly focus on the Chief Digital Officer (CDO), bootlegging (bottom-up employee-driven innovations), and blockchain technology.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Detailedprogramme",
    "title": "",
    "pic_url": "",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Marc Buelens",
    "title": "Emeritus Professor of Management at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35841_jpg.jpg",
    "intro_desc": "Marc is known for his passionate teaching style and his original and fresh approach to both old and new management problems. A former executive, manager of a non-profit organisation, board member, consultant and editor, Marc’s diverse business experience has contributed to his academic work. Over the years, he has written 12 books and 20 international journal articles, and he is the co-founder of several European initiatives on Management Research.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Katleen De Stobbeleir",
    "title": "Professor of Leadership & Coaching at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/64179_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Marion Debruyne",
    "title": "Dean and Professor of Marketing & Innovation at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35860_jpg.jpg",
    "intro_desc": "Marion is passionate about the strategic side of innovation and the innovative side of strategy. She helps companies think about how to respond to changing markets and escape commoditization by adapting their product line, marketing strategy and ultimately, their business model.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Robert Boute",
    "title": "Professor of Supply Chain Management at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/102358_jpg.jpg",
    "intro_desc": "Robert looks at operational excellence from the perspective of designing, managing and improving organisational processes for manufacturing as well as for service organisations.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Dirk Buyens",
    "title": "Professor of HR & Leadership at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/35842jpgjpg.jpg",
    "intro_desc": "Dirk is an authority on strategic HR and can bring out the best in you and your organisation when it comes to people management, career management and organisational development. Dirk has carried out numerous teaching and advisory tasks for organisations such as the Ministry of the Flemish Community, Siemens, Elsevier, Oracle and KBC, to name but a few. He has published more than 100 articles in influential journals and has written several books and chapters on organisational development, career management and a wide variety of management skills.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Frank Caron",
    "title": "Managing Director at Management Today International",
    "pic_url": "https://www.vlerick.com/~/media/Corporate/Images/Eenmalige-images/1 Programmes/1-3 Management programmes/1-3-3 General Management/1-3-3-1 Young Management Programme/1-3-3-1-5 Faculty/FrankCaron.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Carine Peeters",
    "title": "Professor of Strategy at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/160952jpgjpg.jpg",
    "intro_desc": "Carine chairs the Area Entrepreneurship, Governance and Strategy of the school. Besides, Carine is involved in actionable research where she works closely with companies to uncover and share best practices in strategy. She is a firm believer in boosting company performance through people. She turned that into a passion for developing the strategic thinking and practice of executives and managers at all levels.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Veroniek De Schamphelaere",
    "title": "Expert in People Management & Leadership at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/58557_jpg.jpg",
    "intro_desc": "Veroniek is passionate about training professionals to become effective communicators and people managers. Her interests include human resource management, employee performance and employee engagement, strategic HRM, team management, professional management skills and self-management. Veroniek is a certified 'Investors in People' advisor and counsels companies in their 'Investors in People' development process to help them obtain this strategic HRM label. She is also an advisor on Great Place to Work projects − which means she has insight into best practices that work!",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Mario Vanhoucke",
    "title": "Professor at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/58614_jpg.jpg",
    "intro_desc": "Mario helps organisations improve their project performance by combining research results with practical experience. Mario is passionate about everything that is related to project scheduling, risk analysis and project control. He is continuously searching for better ways to measure, improve and optimise the performance and resource efficiency of projects in progress.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Antonio Nieto-Rodriguez",
    "title": "Director of the programme management office at GlaxoSmithKline",
    "pic_url": "https://www.vlerick.com/~/media/Corporate/Images/Eenmalige-images/1 Programmes/1-3 Management programmes/1-3-3 General Management/1-3-3-8 Project Management/Antonio Nieto-Rodriguez jpg.jpg",
    "intro_desc": "Antonio is director of the programme management office at GlaxoSmithKline. He is a lecturer in project management at Vlerick as well as professor at Duke CE and Instituto de Empresa.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Koen Tackx",
    "title": "Professor of Marketing & Strategy at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/107025_jpg.jpg",
    "intro_desc": "Passionate about how companies can create value for customers and capture value for their shareholders, Koen’s main focus is on corporate strategy and strategic marketing. His interests and expertise lie in how co-creation can enhance the strategy creation process, and how to balance between value creation and value capturing and how different strategies can influence this balance.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Xavier Baeten",
    "title": "Professor of Management Practice at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35832_jpg.jpg",
    "intro_desc": "Xavier has a unique focus on, and extensive experience in, reward management. Xavier is an expert in how rewarding can help organisations achieve their strategy and give them a competitive advantage. His favourite topics include: total rewards, translating business strategies into reward policies, developing reward strategies that work, pay-for-performance, reward communication, age-conscious rewarding and employee motivation.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Walter Van Dyck",
    "title": "Associate Professor of Technology & Innovation Management at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/31183_jpg.jpg",
    "intro_desc": "Walter studies idea emergence, showing how inventions come about and transform into innovative business models in life science- and technology-based ecosystems. Over the last 8 years, using ‘Entrepreneurial Boot Camp’ active learning formats, Walter has coached the emergence of more than 100 innovative ideas in global and multinational companies in the life sciences, smart systems and clean technology, and their combinations.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Guy Wollaert",
    "title": "CEO of Idea-Value-Impact Advisory Services",
    "pic_url": "https://www.vlerick.com/~/media/Corporate/Images/Eenmalige-images/1 Programmes/1-3 Management programmes/1-3-3 General Management/1-3-3-1 Young Management Programme/1-3-3-1-5 Faculty/FrankCaron/guy-wollaert-bejpg.jpg?h=190&w=190",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Koen Staut",
    "title": "",
    "pic_url": "https://www.vlerick.com/~/media/shared/faculty/koenstautjpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Peter Deckers Program Manager Innovation at BICS",
    "title": "Program Manager Innovation at BICS",
    "pic_url": "https://www.vlerick.com/~/media/executive-education/open-programmes/Peter-Deckersjpg.jpg?h=110&w=110",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Fred Lemke",
    "title": "Professor of Marketing and Sustainability at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/186039_jpg.jpg",
    "intro_desc": "As an expert in marketing and sustainability, Fred speaks frequently on international conferences on topics such as customer experience, customer insight, sustainability, market research, (Green) design, and innovation management.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Deva Rangarajan",
    "title": "Professor of Sales and Director of the Center for Professional Selling at Ball State University. \nFormer Professor of Sales and Head of the Sales Expertise Centre at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/70957jpgjpg.jpg",
    "intro_desc": "Deva’s research and teaching focus primarily on the areas of sales force management, sales team composition, sales team effectiveness, sales team learning, and customer experience management. He holds degrees from C. T. Bauer College of Business (University of Houston) and the University of Madras. He has worked with a wide variety of companies, including: 3M, Atlas Copco, AXA, Dexia, Electrabel, ING, IVECO, Johnson & Johnson, Manpower, Medtronic, Philips, Receptel, Secretary-Plus, SHV Gas, Siemens, SUN Microsystems, SWIFT, TeleAtlas and Tessenderlo Chemie.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Behzad Samii",
    "title": "Professor of Supply Chain Management at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/126207jpgjpg.jpg",
    "intro_desc": "Behzad studies how to design better supply chains for the future. He is an expert in quantitative analysis for business decision making.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Bram Desmet",
    "title": "Professor of Supply Chain Management at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/64585_jpg.jpg",
    "intro_desc": "Bram has a wide experience with global industrial and retail companies in transforming their supply chains and operations.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Barney Jordaan",
    "title": "Professor of Conflict Management & Negotiation at Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/159574jpgjpg.jpg",
    "intro_desc": "Barney is a South-African negotiation, mediation, dispute and conflict resolution specialist. He has worked with many global organisations – and teaches negotiation skills and conflict resolution. Barney is a certified mediator with the ADR Grp (UK), IMI (The Netherlands) and CEDR (UK), and he has served as external consultant to the World Bank.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Leonardo Meeus",
    "title": "Professor of Strategy and Corporate Affairs at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/151626_jpg.jpg",
    "intro_desc": "Leonardo is passionate about the relations between companies, stakeholders and government. He helps companies to gain competitive advantage by taking a broader perspective on strategy. He puts strategy into corporate affairs, and corporate affairs into strategy. He directs the Vlerick Energy Centre, one of the strategic focus areas in the School.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Brecht Cardoen",
    "title": "Associate Professor bij Vlerick Business School",
    "pic_url": "~/media/shared/profilepics/120992jpgjpg.jpg",
    "intro_desc": "Brecht heads MINOZ, a research network focusing on hospital operations management and contributes to a wide variety of research projects. His research interests are directed to optimisation and decision sciences in services, with a particular interest in healthcare services.",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Katrien Kesteloot",
    "title": "Professor at KU Leuven (LIHP) and Financial Director of UZ Leuven",
    "pic_url": "https://www.vlerick.com/~/media/Corporate/Images/Eenmalige-images/1 Programmes/1-3 Management programmes/1-3-12 Specific industries/1-3-12-2 Management for the hospital professional/1-3-12-2-5 Faculty/Katrien Kesteloot.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Peter Fontaine",
    "title": "CEO of Europe Hospitals (Cliniques de l'Europe / Europa Ziekenhuizen) in Brussels",
    "pic_url": "https://www.vlerick.com/~/media/Corporate/Images/Eenmalige-images/1 Programmes/1-3 Management programmes/1-3-12 Specific industries/1-3-12-2 Management for the hospital professional/1-3-12-2-5 Faculty/peterfontainejpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Marc Noppen",
    "title": "Professor at VUB and CEO of UZ Brussel",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/41071_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Kris Vanhaecht",
    "title": "Professor Quality Management at KU Leuven",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/219405_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  },
  {
    "name": "Paul Gemmel",
    "title": "Professor of Service Management at UGent and Research Fellow at Vlerick Business School",
    "pic_url": "https://public.vlerick.com/ProfilePictures/_t/35877_jpg.jpg",
    "intro_desc": "",
    "university_school": "2222_EUR",
    "pdf_url": ""
  }
]