[
    {
        "name": "Marc Sachon",
        "pic_url": "https://executiveeducation.iese.edu/wp-content/uploads/sachon-learningexperience_2.jpg",
        "title": "Professor",
        "intro_desc": "",
        "university_school": "2222_EUR",
        "pdf_url": ""
    },
    {
        "name": "Mireia Giné",
        "pic_url": "https://executiveeducation.iese.edu/wp-content/uploads/gine-lexperience_2016092116.jpg",
        "title": "Assistant Professor",
        "intro_desc": "",
        "university_school": "2222_EUR",
        "pdf_url": ""
    },
    {
        "name": "Pankaj Ghemawat",
        "pic_url": "https://executiveeducation.iese.edu/wp-content/uploads/pankaj-2_20160530162101.jpg",
        "title": "Anselmo Rubiralta Professor",
        "intro_desc": "",
        "university_school": "2222_EUR",
        "pdf_url": ""
    },
    {
        "name": "Christoph Zott",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Zott-Christoph-1-150x150.jpg",
        "title": "Academic Director",
        "university_school": "2222_EUR",
        "intro_desc": "La principal área de interés de Julia Prats es el proceso de la iniciativa emprendedora, que incluye la identificación, evaluación e implementación de oportunidades en cualquier contexto. Una parte muy importante de su trabajo consiste en el desarrollo de estrategias y sistemas que ayuden a empresas sólidas a lograr un crecimiento rentable. Su trabajo también se centra en comprender los factores principales que intervienen en la creación y la gestión de empresas de servicios profesionales. A lo largo de los años, ha desarrollado estas dos áreas de interés a través de la docencia, proyectos de investigación y consultoría.\nLa profesora Prats fue nominada al Premio Kauffman Emerging y ha publicado en revistas internacionales y participado en congresos, tanto en el ámbito profesional como académico. También es autora de material docente y ha colaborado en varios libros sobre iniciativa emprendedora y estrategia.\nCuenta con un DBA en administración de empresas por la Harvard University, un MBA por el IESE y es Ingeniera Industrial por la Universitat Politècnica de Catalunya. También ha impartido clases en la Wharton Business School, IPADE (México), INALDE (Colombia), y AESE (Portugal).",
        "pdf_url": ""
    },
    {
        "name": "Carles Vergara",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Vergara_Carles-150x150.jpg",
        "title": "Director Académico",
        "university_school": "2222_EUR",
        "intro_desc": "Carles Vergara-Alert es Profesor y director del departamento de Dirección Financiera del IESE. Obtuvo su Ph.D. in Business Administration, Finance and Real Estate, en la University of California, Haas School of Business. Cuenta con un M.S. in Finance (Business Administration) y un Master of Financial Engineering (MFE), ambos por la University of California, Berkeley. Además, es licenciado y máster en Ingeniería de Caminos, Canales y Puertos por la Universitat Politècnica de Catalunya, y PDD del IESE.\nHa trabajado en Allianz Hedge Fund Partner, Allianz Group, el Centro de Innovación del Transporte y el Banco Europeo de Inversiones. Tiene experiencia como consultor en los sectores de las finanzas, bienes inmuebles, ingeniería, farmacéutico, minorista y en el sector público.\nSus áreas de interés incluyen las finanzas inmobiliarias y la valoración de activos financieros.",
        "pdf_url": "http://blog.iese.edu/vergara/"
    },
    {
        "name": "Julia Prats",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/MaJuliaPrats-150x150.jpg",
        "title": "Directora Académica",
        "university_school": "2222_EUR",
        "intro_desc": "La principal área de interés de Julia Prats es el proceso de la iniciativa emprendedora, que incluye la identificación, evaluación e implementación de oportunidades en cualquier contexto. Una parte muy importante de su trabajo consiste en el desarrollo de estrategias y sistemas que ayuden a empresas sólidas a lograr un crecimiento rentable. Su trabajo también se centra en comprender los factores principales que intervienen en la creación y la gestión de empresas de servicios profesionales. A lo largo de los años, ha desarrollado estas dos áreas de interés a través de la docencia, proyectos de investigación y consultoría.\nLa profesora Prats fue nominada al Premio Kauffman Emerging y ha publicado en revistas internacionales y participado en congresos, tanto en el ámbito profesional como académico. También es autora de material docente y ha colaborado en varios libros sobre iniciativa emprendedora y estrategia.\nCuenta con un DBA en administración de empresas por la Harvard University, un MBA por el IESE y es Ingeniera Industrial por la Universitat Politècnica de Catalunya. También ha impartido clases en la Wharton Business School, IPADE (México), INALDE (Colombia), y AESE (Portugal).",
        "pdf_url": ""
    },
    {
        "name": "Julián Villanueva",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JulianVillanueva_Def-1-150x150.jpg",
        "title": "Director Académico",
        "university_school": "2222_EUR",
        "intro_desc": "Julián Villanueva es Profesor Ordinario del departamento de Dirección Comercial. Cuenta con un Ph.D. in Management (Marketing) de la University of California, Los Ángeles, un MBA del IESE y una Licenciatura en Económicas y Empresariales de la Universidad Complutense de Madrid. Su trabajo de investigación se centra en el área del capital cliente, especialmente en el desarrollo de modelos capaces de cuantificar y gestionar el total descontado de los cash-flows de los clientes de una empresa. Además, también le interesa el marketing digital, la venta al público, la gestión de la fuerza de ventas y la relación entre el gasto en marketing y su efecto a largo plazo.\nSus investigaciones se han publicado en el Journal of Marketing Research y en el Journal of Marketing and Quantitative Marketing and Economics, entre otras. Es también autor de varios libros y más de cincuenta casos y notas técnicas. Dos de sus casos están incluidos en la Harvard Business School Premier Case Collection. Asimismo, ha impartido clases de formación para directivos en el CEIBS (China), la Nile University (Egipto), INALDE (Colombia), IPADE (Méjico), IDE (Ecuador), PAD (Perú) e IEEM (Uruguay).\nEl profesor Villanueva se incorporó al IESE en 1997 como profesor del Departamento de Dirección Comercial. Antes de cursar el MBA, trabajó para Promodès (actualmente, Carrefour) como jefe de producto en el departamento de marca blanca. Ha sido consultor de muchas empresas, como Telefónica, Grupo Santander, Bankinter, Caprabo, Eroski, Antonio Puig, Mastercard, Nestlé y Nabisco. Sus proyectos como consultor han sido muy variados, e incluían estudios de mercado, cuadros de mando de marketing, segmentación de clientes, recomendaciones de posicionamiento, expansión internacional y estrategia de marketing general. Asimismo, ha sido miembro del consejo de administración de varias empresas.",
        "pdf_url": ""
    },
    {
        "name": "Luis Ferrándiz",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Ferrandiz-Luis_Foto-Oficial_2020-1-e1600268332534-150x150.jpg",
        "title": "Colaborador científico de Dirección Comercial, IESE",
        "university_school": "2222_EUR",
        "intro_desc": "Luis es licenciado en Ciencias Económicas y Empresariales por la UAM y MBA del IESE (1998). Su experiencia profesional comenzó en Bain & Co., pero pronto pasó a Johnson Wax, mercado de FMCG, donde trabajó en los Departamentos de Ventas y Marketing. Ha estado relacionado con el entorno digital desde principios de 2000 cuando comenzó en Yahoo! como Director Comercial y años más tarde como Director de Desarrollo de Negocios de Telefónica, encargado de lanzar las iniciativas online y offline de TPI (Páginas Amarillas) y donde se convirtió en Director General de una de sus filiales.\nEn 2006, tras la venta de Páginas Amarillas por parte de Telefónica, lanza su propia iniciativa digital, una empresa llamada ADN especializada en estrategia digital, que en enero de 2015, con más de 35 personas, es adquirida por KPMG. En Enero de 2017 es contratado por McKinsey para desarrollar, como socio, su oferta de servicios digitales en España y Portugal. Actualmente compagina su labor docente con la de Senior Advisor de McKinsey y de otras compañías. Finalmente, también está muy vinculado al entorno emprendedor, donde es evaluador y mentor de IMPACT y Endeavour, dos de los mayores aceleradores digitales europeas.",
        "pdf_url": ""
    },
    {
        "name": "Cosimo Chiesa",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/CosimoChiesa_Def.jpg",
        "title": "Profesor ordinario de Dirección Comercial",
        "university_school": "2222_EUR",
        "intro_desc": "Cosimo Chiesa es profesor de Marketing en el IESE desde 1978. Es doctor en Ciencias Económicas y Marketing por la Universidad Luigi Bocconi y en Comercio por la Universidad de Pavía.\nEl profesor Chiesa cuenta con una amplia experiencia profesional en dirección y asesoría. Su carrera empezó en la oficina de Arthur Andersen de Milán, que en ese momento se encargaba de toda la región del sur de Europa. Posteriormente se unió a Star Food, Italia, donde fue asistente adjunto del presidente y era responsable de las filiales. En 1970 se mudó a España, donde ocupó el cargo de director general asociado y miembro del consejo de Starlux S.A. En 1978 se unió a Martini & Rossi con el cargo de director general asociado y miembro del consejo para España y Portugal. Al mismo tiempo compaginó estos cargos con la vicepresidencia de Marqués de Monistrol y la presidencia de Martini & Rossi Marruecos.\nEn 1985 fundó Barna Consulting Group, una empresa de asesoría estratégica especializada en distribución comercial, dirección de ventas, fidelización del cliente y coaching ejecutivo, que todavía preside hoy en día.\nHa realizado trabajos de asesoría y de formación de varias empresas, como Volkswagen-Audi España, Telefónica, General Óptica, Gas Natural, Banc  de Sabadell, United Biscuits, «la Caixa», Adeslas, Repsol, Crèdit Andorrà, Schindler, Novartis, Cadbury, Inmobiliarilla Colonial, Epson y Verizon Dominicana, entre otras. Es miembro de Top Ten Management Spain.\nHa publicado ocho libros:\n– Liderándome para Liderar. El viaje empieza dentro de ti (2015), Alienta Editorial.\n– Saca la crisis de tu cabeza. Claves para un buen diagóstico de tu situacón y de tu empresa (2013), con Ludovica Chiesa, Empresa Activa.\n– Protagonista o espectador (2011), con Carlotta Chiesa Ghio, LID Editorial.\n– Los Pecados Capitales de la Venta. 40 Errores a evitar en su Estrategia Comercial (2010), Ediciones Urano\u0096Empresa Activa.\n– CRM. Las Cinco Pirámides del Marketing Relacional. Cómo conseguir que los clientes lleguen para quedarse (2009), Ediciones Deusto (edición actualizada).\n– Dirigir Vendedores es Mucho más. Las Claves del Liderazgo Comercial (2008), Ediciones Urano\u0096Empresa Activa.\n– Vender es Mucho más. Secretos de la Fidelización en la Venta (2007), Ediciones Urano\u0096Empresa Activa.\n– Fidelizando para Fidelizar: Cómo Dirigir, Organizar y Motivar a nuestro Equipo Comercial (2002), Ed. Eunsa.",
        "pdf_url": ""
    },
    {
        "name": "Josep Tàpies",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/2JosepTapies-150x150.jpg",
        "title": "Director académico",
        "university_school": "2222_EUR",
        "intro_desc": "Josep Tàpies es profesor emérito del Departamento de Dirección Estratégica. Es doctor en Ingeniería Industrial por la Universitat Politècnica de Catalunya (UPC) y cuenta con un MBA de ESADE.\nSus áreas de especialización incluyen la dirección estratégica, el gobierno corporativo, las empresas familiares, su desarrollo y sus estructuras de gobierno. En la actualidad imparte clases en el programa MBA y en otros programas de formación de directivos del IESE. También diseña programas centrados en temas relacionados específicamente con la empresa familiar, donde enseña Dirección General, Gobierno y Estrategia en la Empresa Familiar.\nEl profesor Tàpies ha ejercido como profesor de Dirección General en distintas escuelas de negocios de Europa y de América Latina: AESE en Portugal, IDE en Ecuador, PAD-Universidad de Piura en Perú, ISE en Brasil, IAE en Argentina, ESE en Chile e INALDE en Colombia. También ha sido miembro de los consejos académicos de IPADE en México y en la ESE de Santiago, Chile.\nDurante muchos años ha trabajado como asesor en varias empresas, muchas de ellas familiares, así como en instituciones de banca españolas e internacionales. Es miembro del Consejo de Administración de varias empresas españolas, Fellow de la International Family Enterprise Research Academy (IFERA), miembro de la junta directiva de la Asociación Española de Consultores y Académicos de la Empresa Familiar (CAEF).\nEl profesor Tàpies es autor de numerosos capítulos de libros y libros como «100 Familias que cambiaron el mundo: Las empresas familiares y la industrialización», «Sí quiero: el compromiso de la familia empresaria», «Management Buy Out», «Plan de vuelo», «Empresa familiar, ni tan pequeña ni tan joven», «Family values and value creation» (junto con el profesor John L. Ward), «Familia empresaria», «Génesis del consejo» y «Empresa Familiar: 30 años de preguntas con respuesta».\nAsimismo, ha redactado una gran variedad de artículos académicos y periodísticos sobre las empresas familiares.",
        "pdf_url": ""
    },
    {
        "name": "Miguel Ángel Ariño",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/BMiguelAngelArino-150x150.jpg",
        "title": "Profesor ordinario de Análisis de Decisiones",
        "university_school": "2222_EUR",
        "intro_desc": "Miguel A. Ariño es Profesor Ordinario del departamento de Análisis de Decisiones. Sus investigaciones actuales se centran en la toma de decisiones y el gobierno de organizaciones. Es doctor en Ciencias Matemáticas por la Universitat de Barcelona (UB) y ha impartido clases en esta universidad, en la Universitat Politècnica de Catalunya (UPC) y en la Universidad Carlos III de Madrid. Asimismo, es profesor visitante en otras instituciones internacionales como la CEIBS (China Europe International Business School) y la HKUST Business School (Hong Kong University of Science and Technology).\nHa publicado artículos en revistas no solo del ámbito académico. Es autor del libro Toma de decisiones y gobierno de organizaciones (Deusto, 2005) y coautor, junto con Pablo Maella, de Iceberg a la Vista. Principios para tomar decisiones sin hundirse (Empresa Activa, 2010). También es autor del blog miguelarino.com.",
        "pdf_url": ""
    },
    {
        "name": "Jordi Canals",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/2011-Canals-J._104_web-150x150.jpg",
        "title": "Profesor ordinario de Dirección Estratégica y Economía",
        "university_school": "2222_EUR",
        "intro_desc": "Jordi Canals es profesor de Dirección Estratégica y Economía y titular de la Cátedra Fundación IESE de Gobierno Corporativo. Asimismo, fue director general del IESE de 2001 a septiembre de 2016. El profesor Canals es un experto en las áreas de estrategia corporativa, gobierno corporativo y globalización. Es autor de varios libros y artículos como Shaping Entrepreneurial Mindsets (Palgrave MacMillan, 2015), Leadership development in a Global world (Palgrave MacMillan 2012), Building Respected Companies (Cambridge University Press, 2010), Managing Corporate Growth (Oxford University Press, 2000), Universal Banking: Theoretical Perspectives and International Comparisons (Oxford University Press, 1997), La internacionalización de la empresa (McGraw-Hill, 1994) y Competitive Strategies in European Banking (Oxford University Press, 1993).\nJordi Canals ha sido Guest Scholar del Fondo Monetario Internacional, Visiting Scholar del Banco Mundial, Post-doctoral research fellow de la Harvard Business School y Guest Scholar de la Brookings Institution.\nHa sido miembro de los consejos del GMAC, el European Corporate Governance Institute, el European Institute for Advanced Studies in Management y la European Foundation for Management Development. También es miembro fundador del European Shadow Financial Regulatory Committee, el grupo independiente de supervisión de los asuntos bancarios y financieros europeos. Además, fue miembro de la Comisión de Gobierno Corporativo establecida por el Gobierno español en julio de 2002.\nDescargar currículum vitae completo",
        "pdf_url": ""
    },
    {
        "name": "Joan Fontrodona",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JoanFontrodona-150x150.jpg",
        "title": "Profesor ordinario de Ética Empresarial y Análisis de Situaciones de Negocio",
        "university_school": "2222_EUR",
        "intro_desc": "Joan Fontrodona es Profesor Ordinario y Director del Departamento de Ética Empresarial. Es el Titular de la Cátedra CaixaBank de Sostenibilidad e Impacto Social, y Director del Center for Business in Society. Doctor en Filosofía (Universidad de Navarra) y Master en Dirección de Empresas (IESE Business School). Es miembro del Board de ABIS (The Academy of Busines and Society) y del Comité Ejecutivo de la Red Española del Pacto Mundial de Naciones Unidas. Es miembro de la Comisión de Responsabilidad Social del Colegio de Censores Jurados de Cuentas de Catalunya, y miembro de la Comisión Deontológica de FENIN. Ha sido Presidente de EBEN-España (el capítulo español de la European Business Ethics Network) y de la Junta Directiva de Forética, en representación de los socios individuales.\nRepresenta al IESE en el Pacto Mundial de Naciones Unidas y en los Principles for Responsible Management Education promovidos por Naciones Unidas.\nHa escrito y colaborado en varios libros de ética de la empresa. Ha sido editor invitado de varios números especiales de revistas especializadas tales como Business Ethics Quarterly, Journal of Business Ethics y Business Ethics: European Review. Miembro de consejos asesores y editoriales de diversos medios y publicaciones relacionadas con la ética empresarial y la responsabilidad social.",
        "pdf_url": ""
    },
    {
        "name": "Carlos Sancho",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Web_2012CarlosSancho_139.jpg",
        "title": "Profesor ordinario de Dirección Financiera",
        "university_school": "2222_EUR",
        "intro_desc": "Carlos Sancho es Profesor Asociado de Dirección Financiera y director de la Unidad Docente Jurídica de IESE Business School. En 2001, fue director del programa de Derecho del IESE. Actualmente, está trabajando en un estudio dirigido por uno de los principales grupos editoriales y multimedia de España sobre el modelo contractual de la propiedad intelectual y los derechos de Internet.\nEn 2003, fue nombrado director del área de formación de la Comisión de Asuntos Fiscales de la Cámara de Comercio de Barcelona. El profesor Sancho fundó el European Bureau of Affairs, con sede en Bruselas, y ha trabajado como asesor de empresas españolas en relación a la adaptación de su actividad en el contexto de la Unión Europea.\nEmpezó su andadura profesional como abogado en el bufete madrileño Román Mas y Calvet. El profesor Sancho ha investigado y ha publicado artículos sobre temas que abarcan desde las leyes y los negocios hasta las inversiones en el extranjero y la propiedad industrial y las patentes. Sus planes de futuro incluyen realizar una investigación para una ponencia acerca de la nueva ley concursal y publicar varios artículos sobre los regímenes legales y las empresas familiares.",
        "pdf_url": ""
    },
    {
        "name": "Sampsa Samila",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Samila-Sampsa_web-150x150.jpg",
        "title": "Academic Director",
        "university_school": "2222_EUR",
        "intro_desc": "Sampsa Samila received his PhD from Columbia University (New York, NY, USA) in Mathematics and his MSc from Helsinki University of Technology (Espoo, Finland; now part of Aalto University) in Mathematics and Economics. He has taught previously at Columbia Business School, Brock University (St Catharines, ON, Canada), and the National University of Singapore.\nAt IESE, Sampsa teaches artificial intelligence, innovation strategy, and competitive strategy in a range of programs from MBA and EMBA to senior executives. He is particularly focused on how new technologies like AI enable new business models, the challenges of organizing to develop the capabilities and deliver the value, and how to change the mindset of executives to understand the changes brought by these new developments. As the Academic Director, he designs and leads the Artificial Intelligence for Executives open enrollment program for senior executives. He has written a number of cases on Scribendi, Siemens, Uber, Amazon, and others. He is currently writing cases on AI business transformation in different industries. Sampsa also speaks extensively on AI and advices companies.\nSampsa’s research focuses primarily on artificial intelligence, innovation, entrepreneurship, and strategy. His most recent working paper tracks the dramatic increase in the demand for AI skills in the labor market and he is currently engaged in studying the causes and consequences of AI adoption in firms. His other projects include gender and ethnic integration in innovation as well as trust and social networks. His prior work has studied for instance how success persists in venture capital, how venture capital generates innovation and economic growth, and how networks shape the path of commercial development. His work has been published in highly-respected journals such as American Sociological Review, Management Science, Research Policy, and Review of Economics and Statistics. His work has been discussed in Institutional Investor, Slate, Huffington Post, The Atlantic, Harvard Business Review, IESE Insight, and elsewhere.",
        "pdf_url": ""
    },
    {
        "name": "Josep Valor",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JosepValor_Def.jpg",
        "title": "Professor of Information Systems",
        "university_school": "2222_EUR",
        "intro_desc": "Josep Valor-Sabatier is professor of Information Systems and information technology and holder of the Indra Chair of Digital Strategy.\nHe received his Ph.D. in Operations Research from MIT, and his Sc.D. in Medical Engineering from the Harvard-MIT Division of Health Sciences and Technology. Josep Valor teaches extensively at the senior executive level on Management Information Systems, Media Management, Management of Technology, and Strategy.\nIn in-company training he has been involved in projects with leading organizations like the Telefonica, Ericsson, Vodafone, The World Bank, Santander, BBVA, Oracle, Sony, Technicolor, Abbott, ING, BASF, KPMG, Henkel and 3i.\nHis research has been published in the International Journal of Electronic Commerce, Knowledge and Process Management and he has published books on the information-telecommunications hyper-industry and Information Systems management. His current research interests focus on the impact of ITCs on competitiveness and industry structure, with emphasis on telecommunications and media.\nProf. Valor served as the conference co-chair of the 2002 International Conference on Information Systems (ICIS) in Barcelona.\nProf. Josep Valor is based on IESE New York Campus.",
        "pdf_url": ""
    },
    {
        "name": "Kandarp Mehta Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/KandarpMehta.jpg",
        "title": "Senior Lecturer of Entrepreneurship and Negotiation Teaching Unit",
        "university_school": "2222_EUR",
        "intro_desc": "Kandarp Mehta is a PhD from IESE Business School, Barcelona. He has been with the Entrepreneurship Department at IESE since October 2009. His research has focused on creativity in organizations and negotiations. He frequently works as consultant with startups on issues related to Innovation and Creativity. His doctoral thesis was about the process of creativity in the context of motion picture industry. He has conducted several Negotiation and Creativity Workshops for corporate executives and management students in Europe, USA and India.\nBefore coming to Spain, he was at ICFAI Business School in India where he taught Corporate Finance. He is also actively involved with Creative Industries.",
        "pdf_url": ""
    },
    {
        "name": "Guido Stein",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Guido-Stein_web-150x150.jpg",
        "title": "Professor of Managing People in Organizations and Negotiation Teaching Unit",
        "university_school": "2222_EUR",
        "intro_desc": "Guido Stein is Professor in the Department of Managing People in Organizations and Director of the Negotiation Unit. He is partner of Inicia Corporate (M&A and Corporate Finance).\nProf. Stein is a consultant to owners and management committees of companies. Member of The International Academy of Management and the International Advisory Board MCC (Budapest) and is a collaborator with People and Strategy Journal, Corporate Ownership & Control, Harvard Deusto Business Review, European Business Review and Expansión.\nProf. Stein is author of the books Managing People and Organizations: Peter Drucker’s Legacy and Now What? Leadership and Taking Charge and is co-author of Keys to Leadership Success. He is now working on the book Ambidextrous Negotiator with Kandarp Mehta. In German, he has published Kardinaltugenden effektiver Führung (Cardinal Virtues of Effective Guidance), edited by Peter Drucker and Peter Pascheck.\nHis Spanish books include: “CEO: carrera y sucesión. Escalando la cima”, “El arte de gobernar según Peter Drucker” (3rd edition), “La aventura del liderazgo” (3rd edition), “Dirigir en tiempos de incertidumbre”, “Éxito y Fracaso en la Nueva Economía”, “Cambiar o no cambiar: esa es la gestión” (3rd edition), “Dirigir Personas: La Madurez del Talento” (4th edition), “¿Y ahora qué? Liderazgo y aterrizaje en un nuevo puesto” and “Claves de la Negociación Colectiva, de la teoría a la realidad”.\nHe is the author of more than 60 business cases and numerous technical notes. His current research focuses on undesirable turnover in top management, power and taking-charge processes, and negotiation as a management tool.\nHe has created the first MOOC (Massive Online Open Course) in the platform Coursera in Spanish on leading people, with more than 80,000 followers.",
        "pdf_url": ""
    },
    {
        "name": "Nuria Chinchilla Directora académica",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/NuriaChinchilla_def.jpg",
        "title": "Profesora ordinaria de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Nuria Chinchilla es profesora de Dirección de Personas en las Organizaciones en IESE Business School (Barcelona, España), Universidad de Navarra, y titular de la Cátedra Carmina Roca y Rafael Pich-Aguilera de Mujer y Liderazgo. Fundadora del International Center for Work & Family (IESE Business School) y de la Iniciativa I-WIL (IESE Women in Leadership). Licenciada en Derecho y MBA, es doctora “cum laude” en Economía  y Dirección de Empresas (Universidad de Navarra).\nSus áreas de especialización incluyen las mujeres y el liderazgo, la promoción del talento femenino, las competencias de dirección en organizaciones familiarmente responsables, la integración total de la trayectoria vital, la gestión del tiempo, los conflictos interpersonales y las organizaciones sin ánimo de lucro. En 1984 empezó a trabajar como docente a tiempo completo en el IESE.\nLa profesora Chinchilla también trabaja como asesora para empresas y organismos gubernamentales y es miembro de varias juntas asesoras, como la VIP Advisory Board of European Professional Women’s Network (EPWN). Además es Miembro del Consejo de las EFA’S (Escuelas Familiares Agrarias de Cataluña) desde su fundación, del IWF; también es Miembro del Patronato y del Consejo Económico de la UIC y fue miembro del Consejo Asesor de Watson Wyatt.\nPonente habitual en universidades europeas, americanas y africanas, así como en conferencias internacionales, y profesora visitante en escuelas de negocios como el IPADE en México, el ISE en Brasil, el INALDE en Colombia, el IDE en Ecuador, el PAD en Perú, el ESE en Chile, el IAE en Argentina, el IEEM en Uruguay, la Lagos Business School en Nigeria y la Strathmore University en Kenia.\nLa profesora Chinchilla fue nombrada “Mejor Mujer Directiva del Año” por la Federación Española de Mujeres Directivas, Ejecutivas, Profesionales y Empresarias (FEDEPE). Desde diciembre de 2018 es miembro de la Real Academia de las Ciencias Económicas y Financieras de España (RACEF). Es miembro del Consejo Asesor Universitario de la UIC. En 2017, recibió la Cruz de oro de la Fundación Fomento Europeo (AEFE). Fue candidata de España al CEDAW, ONU 2012. Entre 2015 y 2019, fue miembro del consejo de IWF-Spain.\nCoautora de varios libros, como Integrar la vida: Liderar con éxito la trayectoria profesional y personal en un mundo global (Ariel, 2018), Dueños de nuestro destino: Cómo conciliar la vida profesional, familiar y personal (Ariel, 2007), Ser una empresa familiarmente responsable: ¿Lujo o necesidad? (Pearson Prentice Hall, 2006), La ambición femenina: cómo reconciliar trabajo y familia, (Palgrave, 2005), Criterios de decisión en los procesos de selección en España. ¿Se discrimina a la mujer? (Fundación ADECCO, 2003), Dos profesiones y una familia (Generalitat de Catalunya, Departament de Benestar i Familia, 2003), Emprendiendo en femenino (1999), La Mujer y su Éxito, (1995), y Paradigmas del Liderazgo (2002). También es autora del libro Rotación de Directivos, ganador del premio EADA en 1996.\nLa profesora Chinchilla habla siete idiomas.\nPara obtener más información sobre la biografía o los artículos y libros publicados por Nuria Chinchilla, visita su blog: https://blog.iese.edu/nuriachinchilla. Puedes consultar su cv completo aquí.",
        "pdf_url": "https://women.iese.edu/"
    },
    {
        "name": "Jaume Ribera",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JaumeRibera-1-1.jpg",
        "title": "Profesor ordinario de Dirección de Producción, Tecnología y Operaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Jaume Ribera es profesor de Dirección de Operaciones en el IESE. También obtuvo una beca Fulbright para proseguir con sus estudios de doctorado en los Estados Unidos. El Prof. Ribera tiene un MSc. en Investigación de operaciones y un Ph. D. en Teoría de sistemas matemáticos de la University of Florida, ademas de un doctorado en Ingeniería industrial de la Universitat Politècnica de Catalunya, donde ha sido Profesor Agregado (actualmente en excedencia).\nEl Prof. Ribera fue Director General Adjunto del IESE Business School desde 1993 hasta 2001. Fue el presidente de la European Operations Management Association (2004-2007) y anteriormente fue secretario de la U.S. Operations Management Association (1992-97). Ha sido miembro del comité editorial del International Journal of Operations and Production Management y de la Harvard Business Review China. Actualmente sus investigaciones se centran en la mejora de la dirección de operaciones, la dirección de sistemas sanitarios y la dirección de proyectos. Ha publicado materiales educativos (casos, notas técnicas y libros electrónicos de trabajo), investigación académica (Transportation Science, International Journal of Operations and Production Management, etc.) además de libros de casos y libros de texto sobre estos temas.\nEl Prof. Ribera ha sido asesor activo del sector de la dirección de cadena de suministro y la dirección de proyectos y tiene una amplia experiencia laboral con empresas privadas y públicas de diferentes sectores (textil, farmacéutico, automoción, componentes eléctricos, etc.). También ha participado como consultor y director de proyectos en proyectos de dirección del sector sanitario en Unión Europea, Europa central y del Este y Sur América, tanto en empresas privadas como públicas, financiado por la Unión Europea y el Banco Mundial. Fue Presidente de la Junta de Unnim Caixa (banco de ahorro) y Unnim Bank en España y ahora preside la organización de caridad que estaba separada de estas instituciones.",
        "pdf_url": ""
    },
    {
        "name": "Mireia Las Heras",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/MireiaLasHeras-1.jpg",
        "title": "Profesora ordinario de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Mireia es profesora de IESE Business School en el Departamento de Dirección de Personas en las Organizaciones. Se incorporó a IESE en 2009 después de graduarse de su doctorado en Boston University School of Management. Anteriormente estudió su MBA en IESE. Previamente, había estudiado Ingeniería Industrial en la Universidad Politécnica de Cataluña. Desde el 2019 es directora del Centro Internacional Trabajo y Familia (ICWF).\nFruto de su investigacion, ha publicado extensamente en revistas de impacto académico como Human Relations, Journal of Vocational Behavior, Journal of Organizational Behavior, Human Resource Management Journal and Journal of Business Research entre otras. Ha coeditado cinco libros de investigación (uno de ellos aparecerá próximamente).  Sus estudios se centran en temas relacionados con la integración trabajo-familia alrededor del mundo, liderazgo, teletrabajo, motivación y estados emocionales en el trabajo. Mireia es presidenta de la Conferencia Internacional Trabajo Familia, que celebró en el 2019 la 8ª edición.\nSi quieres saber aún más sobre ella y su trabajo: https://mireialasheras.com/",
        "pdf_url": "https://mireialasheras.com"
    },
    {
        "name": "Joaquim Vilà",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JoaquimVila.jpg",
        "title": "Profesor ordinario de Dirección Estratégica",
        "university_school": "2222_EUR",
        "intro_desc": "Joaquim Vilà es Profesor de Dirección Estratégica, Innovación y Design Thinking, y director académico de los programas enfocados del IESE para directivos sobre Gestión de la innovación y Design Thinking.\nHa trabajado como investigador en el Reginald H. Jones Center for Management Policy, Strategy and Organization de la Wharton School, y como investigador asociado del programa de Dirección y Tecnología del mismo centro.\nProfesor en programas de formación ejecutiva y consultor sobre Design Thinking y habilidades de innovación, implementación de la gestión de la innovación, e impulsores de culturas de la innovación sostenibles. así como aprendizaje empírico sobre Design Thinking para la resolución de problemas, y desarrollo de las habilidades de innovación en líderes y competencias de pensamiento estratégico en mandos intermedios. Consultor en más de 50 empresas nacionales e internacionales, entre las que se cuentan Roche Diagnostics, Amgen, Telefónica, Komatsu, Nutrexpa, Uniland, APLI, Henkel, Nestlé, Premo y Sener entre otras. Es director de innovación en el consejo de administración de algunas empresas españolas.\nEl profesor Vilà ha publicado varios trabajos sobre innovación y Design Thinking, formulación de estrategias, renovación de organizaciones y sistemas de innovación de cargos directivos. Su actual investigación se centra en: cómo mejorar las competencias de innovación a través del pensamiento estratégico, la innovación creativa y el papel de los cargos directivos a la hora de reinventar y transformar un negocio, y cómo alimentar una cultura de la innovación sostenible.",
        "pdf_url": ""
    },
    {
        "name": "Juan Roure",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JuanRoure_Def-1.jpg",
        "title": "Profesor ordinario de Iniciativa Emprendedora y Unidad Docente de Negociación",
        "university_school": "2222_EUR",
        "intro_desc": "Juan Roure es Profesor del Área de Iniciativa Emprendedora y ha sido en los últimos diez años miembro del Internacional Advisory Board (IAB) del IESE. Ha sido Profesor Visitante de la Universidad de Stanford, del INSEAD, de Harvard Business School y de CEIBS (China).\nSus áreas de interés incluyen:\nEstrategias de Crecimiento y Nuevos Negocios. Ha desarrollado gran número de Talleres de reflexión estratégica con equipos de dirección de empresas líderes para construir sus estrategias y planes para liberar el potencial emprendedor. Entre las organizaciones que ha trabajado destacan CAIXABANK, REPSOL, GAS NATURAL FENOSA, TELEFÓNICA, DEUSTCHE BANK, BANCO SANTANDER, TECHINT, C.H. WERFEN, SAR, DISA, ISOLUX-CORSAN, PANREAC, MEMORA o AIRBUS MILITARY. Ha puesto en marcha y dirige los Foros de Corporate Venturing en el IESE.\nPrivate Equity. Ha asesorado y participado en varias operaciones de captación de capital y/o venta. También ha puesto en marcha y dirige el Foro de Inversores Privados y Representantes de Family Offices del IESE. Es miembro del Consejo de Administración de Vallis Capital Partner, y ha formado parte del Consejo Asesor Europeo de The Carlyle Group.\nPuesta en marcha y revitalización de Consejos de Administración y Consejos de Familia. Es coautor de la Guía del Buen Gobierno en la Empresa Familiar, editada por el Instituto de Empresa Familiar. Ha dirigido talleres, para incrementar la eficacia de Consejos de Administración y de Familia, con la Asociación de Empresa Familiar Catalana, Madrileña y Andorrana, y con el Fomin en varios países de Centro América. Es miembro de varios Consejos de Administración y Consejos Asesores.\nLa Family Office y su desarrollo. Esta desarrollando una serie de casos y proyectos sobre la transformación de la Empresa Familiar en Familia Empresaria. Ello comporta la estructuración de los Órganos de Gobierno y Acuerdos de Familia o protocolo, la estrategia de la Familia en los negocios y desarrollo de la Family Office. Es co-autor del estudio internacional sobre Factores clave en la creación y desarrollo de Family Offices en el que han participado más de 100 Familias empresarias. Es asesor o miembro del Consejo de varias Family Offices.",
        "pdf_url": ""
    },
    {
        "name": "Kandarp Mehta",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/KandarpMehta-1.jpg",
        "title": "Profesor asociado de Iniciativa Emprendedora y Unidad Docente de Negociación",
        "university_school": "2222_EUR",
        "intro_desc": "Kandarp Mehta es doctor en Dirección de empresas por el IESE y desde octubre 2009, forma parte del departamento de Iniciativa Emprendedora de la escuela. El enfoque de su investigación siempre ha sido la creatividad, la innovación y las negociaciones. También es un Fellow de DRRC (Dispute Resolution Research Center) de la Kellogg School of Management de Chicago.\nKandarp colabora con frecuencia con startups y empresas familiares en temas relacionados con innovación y creatividad. Ha publicado varios artículos, capítulos en libros y un libro sobre creatividad. Su tesis doctoral trató del proceso de creatividad en el contexto de la industria cinematográfica. Como docente, da clases de negociación, creatividad e iniciativa emprendedora en inglés, español y portugués. Ha dirigido varios talleres y programas sobre creatividad tanto para los ejecutivos como para los alumnos del MBA en Europa, Estados Unidos, América Latina e India.\nEl profesor Mehta también ha estado activamente involucrado en industrias creativas.",
        "pdf_url": ""
    },
    {
        "name": "Edi Soler",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/EdiSoler.jpg",
        "title": "(director académico) Profesor de Contabilidad y Control",
        "university_school": "2222_EUR",
        "intro_desc": "Edi Soler cuenta con un doctorado en Dirección de Empresas (Contabilidad) de la Universitat Politècnica de Catalunya, un EMBA del IESE y una licenciatura en Ingeniería Industrial de la Universitat Politècnica de Catalunya.\nSus intereses académicos y de investigación se centran en la rentabilidad de productos y clientes, políticas de fijación de precios, sistemas de costes, sistemas de control de gestión y ernings management. Ha participado en proyectos de consultoría relacionados con los sistemas de costes y los sistemas de control de la gestión, además de trabajar como analista financiero en varias empresas españolas. Cuenta con más de 10 años de experiencia en la dirección de instituciones educativas, tanto en España como en el Reino Unido y más de 4 en el sector energético, como Director Financiero de la comercializadora eléctrica Holaluz.\nEl Prof. Soler imparte cursos de Contabilidad Financiera, Contabilidad de Gestión y Sistemas de Control de Gestión así como Análisis de Situaciones de Negocio en programas MBA y Perfeccionamiento Directivo en el IESE. Además, ha sido Profesor Visitante en la Universidad de Navarra y en la Nile University. También ha impartido clases de contabilidad y otras asignaturas en carreras universitarias y programas para ejecutivos en España y en el extranjero.\nEdi es autor de varios casos y notas técnicas sobre contabilidad financiera y de gestión así como de dirección general y toma de decisiones.",
        "pdf_url": ""
    },
    {
        "name": "Albert Fernández",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Albert_web-150x150.jpg",
        "title": "Director de Contabilidad y Control",
        "university_school": "2222_EUR",
        "intro_desc": "Albert Fernández es profesor de los departamentos de Contabilidad y Control y de Iniciativa Emprendedora. Además, también imparte cursos de las Unidades Docentes de Análisis de Situaciones de Negocio y de Dirección de Pequeñas y Medianas Empresas. Es titular de la Cátedra Crèdit Andorrà de Emprendimiento y Banca.\nDesde 2009 es director de Finaves, los fondos de capital riesgo dedicados a invertir en proyectos empresariales de antiguos alumnos del IESE. Y desde 2016 es uno de los Directores Académicos de los Programas de Desarrollo Directivo del IESE. Desde septiembre de 2018 es Director del Departamento de Contabilidad y Control. Anteriormente ha ocupado diversos cargos en la Dirección del Programa MBA.\nEl profesor Fernández es Director Académico del Programa para empresarios y Directivos de Microempresas y en el pasado lo ha sido, durante más de 10 años, de los Programa Enfocados “Ejecutar con éxito la implantación de la estrategia” y “Contabilidad y Finanzas para Directivos no financieros. También ha sido Director Académico durante cinco años de un “Programa de Emprendimiento social” así como de números programas custom para empresas.\nHa impartido sesiones en prestigiosas escuelas en Estados Unidos (Harvard, Boston University), Latinoamérica (INALDE, Colombia; IAE, Argentina; PAD, Perú; ISE, Brasil; entre otras), Portugal (AESE) y España (Instituto Europeo de Derecho y Economía, Barcelona; San Telmo, Sevilla). Desde 2017 es miembro del Consejo Asesor de la escuela de negocios INALDE (Colombia).\nSus áreas de interés son la iniciativa emprendedora en sus estadios iniciales, las claves del crecimiento de las pequeñas y medianas empresas (pymes), gobierno corporativo en las pymes y en la empresa familiar, y el uso y aplicación de los procesos de dirección y gestión como la planificación, el presupuesto, la evaluación y la compensación.\nAlbert Fernández posee una amplia experiencia como consultor y como consejero de diversas empresas. Ha sido Presidente de la Corporació de Salut del Maresme i la Selva entre 2012 y 2019.\nEs autor de diversos casos, notas técnicas y artículos en revistas y diferentes medios de comunicación.\nDescargar CV completo",
        "pdf_url": ""
    },
    {
        "name": "Toni Dávila",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/ToniDavila_Oficial_SinCorbata-150x150.jpg",
        "title": "Profesor ordinario de Iniciativa Emprendedora y Contabilidad y Control",
        "university_school": "2222_EUR",
        "intro_desc": "Antonio Dávila es Profesor Ordinario de los departamentos de Iniciativa Emprendedora y Contabilidad y Control. Además, es el titular de la Cátedra Seat de Innovación. Desde 1999 hasta 2006, trabajó como docente en la Graduate School of Business de la Stanford University, donde sigue impartiendo clases periódicamente. También ha sido professor visitante de la Harvard Business School en 2013, 2014, 2016 y 2018.\nDávila posee un doctorado por la Harvard Business School y un MBA por el IESE. Sus intereses docentes e investigadores se centran en el crecimiento de startups, la gestión de la innovación, gestión deportiva y control de gestión.\nEn 2005, se le concedió el Premio a la Excelencia Investigadora del IESE. Y en 2004, recibió la beca Ramón y Cajal del Gobierno de España. También ha recibido otros premios como el Premio para Trabajos Cortos de Investigación en Contabilidad Carlos Cubillo Valverde (2003), el Segundo Premio a la Mejor Disertación de la Sección de Contabilidad de Gestión de la American Accounting Association (1999) y el Premio McKinsey al Mejor Artículo de la Strategic Management Society (1998).\nEl profesor Dávila es coautor de Landscape Monitor (2017), The Innovation Paradox (2014), Making Innovation Work: How to Manage It, Measure It, and Profit from It (2006) y de Performance Measurement and Management Control Systems to Implement Strategy (2000). También es co-autor del libro de texto de costes y control de gestión Malea Fashion District (2018). Del mismo modo, ha contribuido con la publicación de capítulos en otros libros y publicado numerosos artículos de investigación en revistas académicas como The Accounting Review, Academy of Management Journal, Accounting Organizations and Society, Journal of Accounting and Economics, Research Policy, California Management Review y Harvard Business Review.\nDávila es un autor prolífico de casos y ha desarrollado casos formativos con empresas como Checkpoint, Logitech, Siebel Systems, CitiBank y Salesforce.com. Asimismo, ha participado en ponencias sobre contabilidad y sistemas de control en la reunión de la Sección de Contabilidad de Gestión de la American Accounting Association, la Conferencia de Contabilidad de Gestión, la reunión de la Strategic Management Society y la reunión de contabilidad europea, entre otras.\nEs miembro de los consejos editoriales de The Journal of Management Accounting Research, European Accounting Journal, Accounting Review, Management Accounting Research y Sports Business Management.\nDescargar currículum vitae",
        "pdf_url": "http://blog.iese.edu/davila/"
    },
    {
        "name": "Javier Zamora Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JavierZamora_Def.jpg",
        "title": "Professor and Head of the Practice of Management of Information Systems",
        "university_school": "2222_EUR",
        "intro_desc": "Javier Zamora is a Professor of the Practice of Management and Head of Information Systems Department at IESE Business School. He received his Ph.D in Electrical Engineering from Columbia University, and his M.Sc. in Telecommunications Engineering from the Universitat Politècnica de Catalunya. He also holds a PDG from IESE.\nHe is the co-academic director of the Digital Ecosystem Industry Meeting, as well as the executive programs Digital Mindset and Transformación Digital at IESE. His current areas of interest are focused on data-driven organizations and Artificial Intelligence and its impact on digital transformation.\nProf. Zamora’s teaching spans across all IESE programs, from MBA to Custom, and is focused on the digital transformation of organizations through the knowledge and application of new digital technologies with special emphasis on the redesign of processes and the challenge for senior executives to develop a digital mindset. In custom training and consulting he has been involved in projects with leading organizations such as Abertis Autopistas, Airbus D&D, Alior Bank, Altice Portugal, ASEME, Asseco, ASLAN, ATEFI, Banco do Brasil, BBVA, BMW, Boehringer Ingelheim, CaixaBank, Campari Group, Cecabank, Cepsa, CGD, Chemo Group, Correos, Danone, Diana Capital, ELIA, Elzaburu, Emirates NBD, Estabanell, Flokk, Gas Natural Fenosa, Generali, Harman, HOLA, Hoteles Catalonia, HP, IBM, IFC Group, Indra, Kolektor, Laboratorios LETI, LEDS-C4, Liberty Seguros, Mapfre, Microsoft, Millenium Bank, Mutual Médica, Natixis, Novartis, OCBC Bank, Oracle, Orange, Penteo, Philips, Play, Primax, Red Link, Roche, Samsung, Santander, SAP, Saudi Telecom Solutions, Serunion, Schüco, Techdata, Telefónica, The European House – Ambrosetti, Tieto, Vallcompanys, Vithas and Xerox. He also regularly teaches at AESE (Portugal), IAE (Argentina), PAD (Peru) and ESE (Chile).\nProf. Zamora is co-founder of Inqbarna, a company specialized in the design, development and marketing of mobile experiences for smartphones and tablets. For eight years he was the General Manager of eNeo Labs, a company devoted to products and services for the digital home. His previous professional experience includes four years as Director of Product Development at Xbind in New York, a pioneering company in video transmission over data networks, and five years researching and implementing one of the first video-on-demand systems in the US at the Center for Telecommunications Research and the Image and Advanced Television Laboratory of Columbia University.\nHe served in the International Standard Organization (ISO) as editor of the MPEG-4 video standard. Javier Zamora is author of five publications in international journals and fifteen technical contributions to standard bodies. He is the author of two international patents on digital home architecture and services. From 2005 to 2009, he designed and taught the class “Topics in New Technologies and Business” in the international Master of Science in Information and Communication Technologies Dept as a visiting professor at Universitat Politècnica de Catalunya.",
        "pdf_url": ""
    },
    {
        "name": "Pedro Nueno  Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/PedroNueno-150x150.jpg",
        "title": "Emeritus Professor of Entrepreneurship",
        "university_school": "2222_EUR",
        "intro_desc": "Pedro Nueno is a Technical Architect, Industrial Engineer and Doctor of Business Administration from Harvard University. He is also Professor of Entrepreneurship at IESE and CEIBS.\nHe is the founder and Honorary President of the China Europe International Business School (CEIBS), leading school of business in Asia, with campuses in Shanghai, Beijing, Shenzhen, Accra and Zurich.\nHe was member of the Visiting Committee of the Harvard Business School for six years (2005-2011). He is in the board of several companies and institutions and during his career he has been in the board of more than 30 companies and institutions in Europe, the USA, Latin America, China and Africa.\nProf. Nueno is also founder of FINAVES, a venture capital corporation associated to the entrepreneurship activity of IESE Alumni that supported the launching of more than 40 companies, creating directly more than 3000 new jobs. His areas of interest include entrepreneurship, starting new ventures, global management, management of technology and innovation.\nHe authored 22 books translated to several languages about corporate turnaround, innovation and entrepreneurship. He has written more than 100 cases on Entrepreneurship, and published many articles.\nHe has received many Honors such as the Cross of Saint Jordi from the Spanish Government (2003), the Friendship Award (2009) and the Outstanding Contribution Award from the Chinese Government (2014), and “Commander by Number or the Order of Queen Elisabeth the Catholic” by the Kind of Spain (2015).",
        "pdf_url": ""
    },
    {
        "name": "Carlos Sánchez-Runde",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/CarlosSanchezRunde-150x150.jpg",
        "title": "Profesor Ordinario de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Carlos J. Sánchez-Runde es Profesor Ordinario del Departamento de Dirección de Personas en las Organizaciones. Sus áreas de especialización son la gestión intercultural, la dirección estratégica de recursos humanos, las políticas de retribución y pagas y las relaciones de cooperación entre trabajadores-dirección. Ha trabajado como docente e investigador en Estados Unidos, Chile, Argentina, Uruguay, México y Perú\nEl profesor Sánchez-Runde obtuvo su Ph.D. in Management (Human Resource Management) en la University of Oregon, es MBA por el IESE y licenciado en Derecho por la Universitat de Barcelona.\nEs autor y coautor de los siguientes libros: Management across Cultures (Cambridge University Press, segunda edición en marzo de 2013), Retos de la dirección de personas (FT-Prentice Hall, 2012), Competencias de la dirección de personas: Un análisis desde la alta dirección (People Management Skills: A Senior Management Analysis, 2004), Dirección estratégica de recursos humanos (Strategic Human Resource Management, 1997), y Firm strategy and human resource management: A case-study approach (tesis doctoral, 1996). Recientemente ha coeditado los siguientes volúmenes: Innovative Forms of Organizing: International Perspectives (2003), and Multinationals, Institutions and the Construction of Transnational Practices (2006). También ha publicado numerosos artículos en revistas especializadas y para el público en general, como Journal of World Business, Journal of Management Development, Organizational Dynamics, Journal of Business Ethics, Advances in International Management, Harvard-Deusto Review, Revista de Empresa y Humanismo, and Revista Internacional de Organizaciones. Además, ha publicado varios capítulos de libros, documentos de investigación y notas técnicas, y ha realizado diversas ponencias en conferencias internacionales.\nTambién trabaja como consultor en empresas como Accenture, Dow Chemical, Haier, Outokumpu y Roche.",
        "pdf_url": ""
    },
    {
        "name": "José Ramón Pin",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JoseRamonPin-1.jpg",
        "title": "Profesor Emérito deDirección de Personas en las Organizaciones y Ética Empresarial",
        "university_school": "2222_EUR",
        "intro_desc": "José Ramón Pin es Profesor Emérito del Departamento de Dirección de Personas en las Organizaciones. Recientemente fue nombrado miembro del Comité Académico de la Barna Business School.\nEl profesor Pin es autor de los libros \u0093Consistencia: la clave de la Dirección de Personas en la Organización\u0094 (Pearson Educación, 2006), \u0093Tsunamis políticos: consejos y reflexiones para empresarios y directivos en su relación con la política\u0094 (Eunsa, 2010) y coautor con el profesor Guido Stein de \u0093CEO, carrera y sucesión\u0094 (Prentice Hall, 2010). También ha publicado numerosos artículos científicos y de divulgación y mantiene su colaboración con diversos medios de comunicación.\nJosé Ramón Pin fue concejal del Ayuntamiento de Madrid, diputado autonómico de Madrid y diputado en el Congreso de España. Forma, además, parte de diversos consejos de administración.\nSus áreas de interés incluyen el desarrollo de las capacidades de dirección, las habilidades y la trayectoria profesional, la relación entre ética y procesos de dirección, las relaciones entre empresas y entidades gubernamentales y la motivación de los trabajadores con nuevos estilos de trabajo: trabajo temporal y teletrabajo.",
        "pdf_url": ""
    },
    {
        "name": "Javier Quintanilla",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JavierQuintanilla.jpg",
        "title": "Profesor Ordinariode Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Javier Quintanilla es profesor del Departamento de Dirección de Personas en las Organizaciones y Director de Personal Científico del IESE. Sus actividades de investigación se centran principalmente en el campo de los recursos humanos, con especial énfasis en las empresas multinacionales. También está implicado en una investigación en curso sobre el impacto del comercio electrónico en la dirección de personas.\nHa presentado artículos en varias conferencias internacionales, y ha publicado artículos en prestigiosas revistas académicas como The International Journal of Human Resource Management, Journal of World Business, Industrial Relations Journal y The European Journal of Industrial Relations, por citar algunos. El Dr. Quintanilla también es autor de carios casos y notas técnicas. Ha publicado el libro The Management of Human Resources in Multinational Companies: Uncovering Subsidiaries (La Gestión de Recursos HUmanos en empresas multinacionales: descubriendo las filiales), 2001, Prentice Hall – Financial Times.\nEl Prof. Quintanilla es miembro de diferentes asociaciones profesionales y academias. También colabora con los comités editoriales de Aedipe (Asociación Española de Dirección y Desarrollo de Personas) y HRMER (Revista educativa de dirección de recursos humanos), ya habitualmente asesora a empresas nacionales e internacionales.",
        "pdf_url": ""
    },
    {
        "name": "Joaquim Vilà Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JoaquimVila.jpg",
        "title": "Professor of Strategic Management",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    },
    {
        "name": "Xavier Camps",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/0-150x150.jpeg",
        "title": "Growth and Digital Transformation Consultant",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    },
    {
        "name": "Juan Roure Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JuanRoure_Def-1.jpg",
        "title": "Professorof Entrepreneurship and Negotiation Teaching Unit",
        "university_school": "2222_EUR",
        "intro_desc": "Juan Roure is Professor of Entrepreneurship and Negotiation. During ten years has been a member of IESE’s International Advisory Board (IAB). He has been Visiting Professor at Stanford University, INSEAD, Harvard Business School and CEIBS (China).\nHis areas of interest include:\nStrategies for Growth and New Businesses. He has developed a large number of strategic reflection workshops with the management teams of leading companies, helping them create strategies and plans to unlock their entrepreneurial potential. Notable organizations he has worked with include CaixaBank, REPSOL, Gas Natural Fenosa, Telefónica, DEUSTCHE BANK, BANCO SANTANDER, TECHINT, C.H. WERFEN, SAR, DISA, PANREAC, MEMORA and AIRBUS MILITARY. He has launched and directs the Corporate Venturing Forums at IESE.\nPrivate Equity. He has acted as a consultant and participated in several fundraising and sales transactions. He has also launched and directs the Forum of Private Investors and Representatives of Family Offices of IESE. He is a member of the Board of Directors of Vallis Capital Partner and has served on the European Advisory Committee of The Carlyle Group.\nLaunching and Revitalizing Boards of Directors and Family Boards. He is the coauthor of the Guide to Good Governance in Family-Run Companies, edited by the Instituto de Empresa Familiar. He has led workshops to increase the efficiency of boards of directors and family boards with the Association of Family Businesses from Catalonia, Madrid and Andorra, and with the World Bank in several countries of Central America. He is a member of several boards of directors and advisory committees.\nThe Family Office and Its Development. He is developing a series of cases and projects on the transformation of the family business into the family in business. This involves structuring the governing bodies and family agreements or protocols, the asset allocation strategy and the development of the Family Office. He is co-author of the international study on key factors in the creation and development of Family Offices in which more than 100 families have participated. He is an advisor or member of the Board of several Family Offices.",
        "pdf_url": ""
    },
    {
        "name": "John Almandoz",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JohnAlmandoz.jpg",
        "title": "Profesor agregado de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "John Almandoz is an Associate Professor in the Department of Managing People in Organizations. His background includes experience in actuarial consulting, corporate banking, and the management of non-profit organizations. He earned a joint PhD in Organizational Behavior and a master’s degree in Sociology from Harvard Business School/Harvard University and an MBA from Southern Methodist University’s Cox School of Business.\nHe has published in prestigious journals such as the Academy of Management Journal and the Administrative Science Quarterly and participates in research in entrepreneurship, institutions, and top management teams and boards of directors. His dissertation focused on the strategic and entrepreneurial implications of community and financial missions in the founding teams of local banks.\nHe is a reviewer for the Academy of Management Conference and ad-hoc reviewer for the Academy of Management Journal, Administrative Science Quarterly, Organization Studies and other journals. He has presented papers at various international conferences and seminars, including at Harvard, MIT, Oxford, and the Academy of Management. He is a member of the Academy of Management, American Sociology Association, and the European Group of Organizational Studies.\nAlmandoz teaches courses in the MBA, Executive MBA, and Global Executive MBA programs on leadership and organizational behavior, and self-management.\nHe is based at IESE’s New York campus.",
        "pdf_url": "http://blog.iese.edu/almandoz/"
    },
    {
        "name": "Sebastien Brion",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Brion-Sebastien_006_web-e1595093413932-150x150.jpg",
        "title": "Profesor ordinario de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Sebastien Brion is a Professor and Head of the Department of Managing People in Organizations at IESE. He holds a Ph.D. in Organizational Behavior from the Haas School of Business, University of California, Berkeley and a BA in Psychology from Tufts University. Prior to pursuing an academic career, he was a human resources consultant in the Bay Area.\nProfessor Brion’s research examines how individuals attain and maintain positions of leadership in organizations. His research tackles this broad question by examining how hierarchy drives systematic biases in perceptions of leaders’ interpersonal and strategic environments. Together, his research points to the mechanisms underlying how hierarchy contributes to effective or ineffective interpersonal and strategic decisions in organizations. Drawing on research in social psychology and organization theory, he employs a multimethod approach to his research, incorporating experimental lab studies, field studies, and archival studies.\nHis academic work is published in leading academic journals including Organization Science, Management Science, Organizational Behavior and Human Decision Processes, and Journal of Personality and Social Psychology among others. Professor Brion’s research has been highlighted in numerous publications, including The Wall Street Journal, The Economist, Forbes, Le Monde, among others. He is the Associate Editor of the Social Influence section of Social and Personality Psychology Compass and serves as the Representative-At-Large for the Conflict Management division of the Academy of Management.\nAt IESE, Professor Brion teaches core classes on Leadership and Human Resources Management, and electives on Power and Influence, at the MBA and Executive level. Professor Brion has taught in executive programs for firms such as L’Oreal, Pepsi, Danone, Michelin, Abbvie, NLNG (Lagos, Nigeria), and Kazakhstan Temir Zholy (National Railways of Kazakhstan). In addition, he has held a Visiting Professor position at the Tuck School of Business at Dartmouth College and has taught in executive programs for the Haas School of Business, the Boston Consulting Group, and MDE (Abidjan, Côte d’Ivoire).\nAs part of his professional activities Professor Brion has conducted research and consulting projects in the human resources and social media industries.",
        "pdf_url": ""
    },
    {
        "name": "Javier Zamora",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JavierZamora_Def-150x150.jpg",
        "title": "Director y profesor ordinario de Sistemas de Información",
        "university_school": "2222_EUR",
        "intro_desc": "Javier Zamora is a Professor of the Practice of Management and Head of Information Systems Department at IESE Business School. He received his Ph.D in Electrical Engineering from Columbia University, and his M.Sc. in Telecommunications Engineering from the Universitat Politècnica de Catalunya. He also holds a PDG from IESE.\nHe is the co-academic director of the Digital Ecosystem Industry Meeting, as well as the executive programs Digital Mindset and Transformación Digital at IESE. His current areas of interest are focused on data-driven organizations and Artificial Intelligence and its impact on digital transformation.\nProf. Zamora’s teaching spans across all IESE programs, from MBA to Custom, and is focused on the digital transformation of organizations through the knowledge and application of new digital technologies with special emphasis on the redesign of processes and the challenge for senior executives to develop a digital mindset. In custom training and consulting he has been involved in projects with leading organizations such as Abertis Autopistas, Airbus D&D, Alior Bank, Altice Portugal, ASEME, Asseco, ASLAN, ATEFI, Banco do Brasil, BBVA, BMW, Boehringer Ingelheim, CaixaBank, Campari Group, Cecabank, Cepsa, CGD, Chemo Group, Correos, Danone, Diana Capital, ELIA, Elzaburu, Emirates NBD, Estabanell, Flokk, Gas Natural Fenosa, Generali, Harman, HOLA, Hoteles Catalonia, HP, IBM, IFC Group, Indra, Kolektor, Laboratorios LETI, LEDS-C4, Liberty Seguros, Mapfre, Microsoft, Millenium Bank, Mutual Médica, Natixis, Novartis, OCBC Bank, Oracle, Orange, Penteo, Philips, Play, Primax, Red Link, Roche, Samsung, Santander, SAP, Saudi Telecom Solutions, Serunion, Schüco, Techdata, Telefónica, The European House – Ambrosetti, Tieto, Vallcompanys, Vithas and Xerox. He also regularly teaches at AESE (Portugal), IAE (Argentina), PAD (Peru) and ESE (Chile).\nProf. Zamora is co-founder of Inqbarna, a company specialized in the design, development and marketing of mobile experiences for smartphones and tablets. For eight years he was the General Manager of eNeo Labs, a company devoted to products and services for the digital home. His previous professional experience includes four years as Director of Product Development at Xbind in New York, a pioneering company in video transmission over data networks, and five years researching and implementing one of the first video-on-demand systems in the US at the Center for Telecommunications Research and the Image and Advanced Television Laboratory of Columbia University.\nHe served in the International Standard Organization (ISO) as editor of the MPEG-4 video standard. Javier Zamora is author of five publications in international journals and fifteen technical contributions to standard bodies. He is the author of two international patents on digital home architecture and services. From 2005 to 2009, he designed and taught the class “Topics in New Technologies and Business” in the international Master of Science in Information and Communication Technologies Dept as a visiting professor at Universitat Politècnica de Catalunya.",
        "pdf_url": ""
    },
    {
        "name": "Núria Villaescusa Directora académica",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Villaescusa-Nuria_2019_0777_web-e1596532069212-150x150.jpg",
        "title": "Profesora asociada de Contabilidad y Control",
        "university_school": "2222_EUR",
        "intro_desc": "Núria Villaescusa es Senior Lecturer del Departamento de Contabilidad y Control. Empezó su andadura profesional en la firma de auditoría KPMG. Más tarde, trabajó como directora financiera y consultora.\nSu trabajo como consultora se centra en la implementación de sistemas de control de gestión, incluyendo los ámbitos específicos de contabilidad financiera, contabilidad de costes y gestión de riesgos del negocio tanto en empresas grandes como en medianas y pequeñas empresas. Ha actuado también como perito independiente en casos de fraude contable.\nObtuvo su doctorado en contabilidad por la Universitat Politècnica de Catalunya en el año 2016. Actualmente, es profesora ayudante en la UIC (Universitat Internacional de Catalunya), donde ejerce como profesora e investigadora. Sus intereses investigadores se centran en la manipulación de beneficios, sus consecuencias y cómo detectarlas, así como en las auditorías forenses.",
        "pdf_url": ""
    },
    {
        "name": "Ahmad Rahnema",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/AhmadRahnema-150x150.jpg",
        "title": "Profesor Ordinario de Dirección Financiera",
        "university_school": "2222_EUR",
        "intro_desc": "Ahmad Rahnema es profesor del departamento de Dirección Financiera y titular de la Cátedra Fuel Freedom de Energía y Desarrollo Social.\nEl Profesor Rahnema ha dado conferencias en AB Freeman School of Business de Tulane (Nueva Orleans, EE UU), Istituto di Studi per la Direzione e Gestione di Impresa (Nápoles, Italia), Universitätsseminar der Wirtschaft, Schloss Gracht (Erftstadt, Alemania), CEDEP (Fontainebleau , Francia), IPADE (Universidad Panamericana, México), IAE (Universidad Austral, Argentina), AESE (Lisboa, Portugal), Universidade Nova de Lisboa (Portugal), IEEM (Universidad de Montevideo, Uruguay), IDE (Quito, Ecuador), la Universidad Adolfo Ibáñez (Viña del Mar, Chile) y el Instituto Internacional San Telmo (Sevilla, España).\nEs coeditor de la revista International Journal of Finance Education, miembro del consejo editorial de la revista Harvard Deusto Business Review y Presidente del Foro Financiero Español de Londres.\nAhmad Rahnema ha sido autor y coautor de varios libros. Sus títulos recientes incluyen Finanzas Internacionales, publicado en 2006, y Basilea II, Una Nueva Forma de Relación Banca-Empresa (con el profesor del IESE Jordi Soley), publicado en 2004. Sus artículos han sido publicados en revistas especializadas, así como en revistas de temática general y de negocios. Cabe destacar, entre otros, «Nokia´s Growing Cash Mountain», publicado en International Journal of Finance Education en enero de 2005, y «Basilea II: Una nueva forma de relación banca-empresa» que se publicó en Finanzas & Contabilidad en abril de 2005.\nEl Profesor Rahnema ha desempeñado una variedad de trabajos de consultoría para varias de las principales empresas españolas e internacionales. Su investigación se ha centrado principalmente en las finanzas internacionales, la gestión del riesgo y los medios de pago.",
        "pdf_url": ""
    },
    {
        "name": "Javier Santomá",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/JavierSantoma.jpg",
        "title": "Profesor Ordinario de Dirección Financiera",
        "university_school": "2222_EUR",
        "intro_desc": "El Dr. Javier Santomá es Profesor Ordinario en el Departamento de Dirección Financiera y codirector de The Africa Initiative en el IESE. Sus áreas de especialización incluyen la gestión de carteras, las finanzas empresariales y los seguros, y finanzas de nuevas empresas.",
        "pdf_url": ""
    },
    {
        "name": "Nuria Chinchilla",
        "title": " Profesora Ordinaria de Dirección de Personas en las Organizaciones; Titular de la Cátedra Carmina Roca y Rafael Pich Aguilera de Mujer y liderazgo; Doctora en Dirección de Empresas, IESE, Universidad de Navarra; MBA, IESE, Universidad de Navarra. ",
        "pic_url": "https://d3srxiunz7lgh6.cloudfront.net/v8rvjf4fgytieepkbd5i4en2g8nx",
        "pdf_url": "",
        "intro_desc": "La doctora Chinchilla es profesora, investigadora y consultora en dirección de personas, está especializada en consejos de administración, competencias de liderazgo, mujer y conciliación trabajo-familia. Más información",
        "university_school": "2222_EUR"
    },
    {
        "name": "Esther Jiménez",
        "title": " Colaboradora científica de Dirección de Personas en las Organizaciones, Doctora en Economía y Dirección de Empresas, Universidad de Navarra, MBA, Universitat Oberta de Catalunya ",
        "pic_url": "https://d3srxiunz7lgh6.cloudfront.net/03b98jocpg543nq7fkmgz5xdpkfs",
        "pdf_url": "",
        "intro_desc": "Licenciada en Derecho y en Ciencias del Trabajo y MBA por la Universitat Oberta de Catalunya. En 1995 realizó el PDD y ha dedicado la mayor parte de su trayectoria profesional al sector de la educación, como directora general y miembro de consejos de administración. En la actualidad es Decana de la Facultad de Educación de la Universitat Internacional de Catalunya (UIC). Más información",
        "university_school": "2222_EUR"
    },
    {
        "name": "Carlos Rodríguez-Lluesma",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/CarlosRodriguezLluesma-150x150.jpg",
        "title": "Profesor Agregado de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Carlos Rodríguez-Lluesma es Profesor Ordinario del Departamento de Dirección de Personas en las Organizaciones.\nAsimismo, cuenta con un Ph.D in Organizations de la Stanford University. Obtuvo su primer Doctorado en Filosofía en la Universidad de Navarra y un MBA del IESE. El profesor Rodríguez-Lluesma ha ocupado varios puestos de adjunto en docencia e investigación en la Stanford University, y ha sido Colaborador Científico en el IESE y en la Universidad de Navarra. También ha adquirido una valiosa experiencia práctica como asesor autónomo en los sectores de servicios financieros, biotecnología, productos de consumo y asesoría de dirección. Además, trabaja como asesor de una empresa de asesoría política en Silicon Valley.",
        "pdf_url": ""
    },
    {
        "name": "Alberto Ribera Academic Director",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/AlbertoRibera-1.jpg",
        "title": "Professor of the Practice of Management of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "Alberto Ribera joined IESE in 2003 after a 15-year international career with the World Health Organisation, the European Commission and other multilateral organisations, in charge of projects in Africa, Southeast Asia and especially in the Middle East. From 1999 to 2003, he was General Director of the Euro Arab Management School.\nAt IESE he is the academic director of the IESE Coaching Unit and teaches the MBA course “Personality and Leadership”, which received the 2009 IESE Award for Excellence. He also teaches the Global Executive MBA course “Managing Oneself”; and executive courses on self-leadership, relationships management and executive coaching. He is the author or co-author of 9 books and more than 30 case-studies.\nHe has been invited as visiting professor or guest speaker at universities and business schools of more than 20 different countries and at international conferences like the World Economic Forum. He has taught courses for Enel, Compagnia di San Paolo, Banco di Napoli, Telecom Italia, Saint Gobain, The Arab Contractors, Egypt Telecom, BBVA, Banco de España, Enrst&Young, Hewlett Packard, PricewaterhouseCoopers and other firms.\nHe is a board member of the Istituto per la Cooperazione Universitaria (Rome), Harambee Foundation (Nairobi) and other not-for-profit institutions.",
        "pdf_url": ""
    },
    {
        "name": "Álvaro San Martín",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/San-Martin-Alvaro_987web-150x150.jpg",
        "title": "Assistant Professor of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "Álvaro San Martín is an Associate Professor of the Managing People in Organizations Department at IESE Business School. His background includes working experience in finance, consulting, and managing non-profit organizations. Alvaro also worked at IESE as a researcher before joining the doctoral program at INSEAD. He holds a Ph.D. degree in Management, with a specialization in Organizational Behavior. Alvaro had previously majored in Economics as class valedictorian at Universidad Autonoma de Madrid.\nHis research interests lie in cultural psychology and team dynamics. Alvaro has published his work in premier scientific journals, such as Nature Human Behaviour, Journal of Personality and Social Psychology, the Proceedings of the National Academy of Sciences, and Organizational Behavior and Human Decision Processes. He has regularly presented his research in the annual meetings of the Academy of Management, the Society for Personality and Social Psychology, the European Association for Social Psychology, and the International Association for Cross-Cultural Psychology, as well as in invited presentations at London Business School, ESMT, and joint research workshops of IESE/IE/Universidad Carlos III in Madrid.\nProf. San Martin teaches courses on leadership, organizational behavior, and self-management in the Executive MBA, Open Programs, and Custom Programs offered at IESE. He also participates as a speaker in company events.",
        "pdf_url": ""
    },
    {
        "name": "Yih-Teen Lee",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Yih-Teen-Lee.jpg",
        "title": "Professor of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "Yih-Teen Lee is Full Professor in the Department of Managing People in Organizations. He specializes in leadership, fit, and cultural bridging in his roles as educator, researcher, and consultant. His research work appears in leading scientific journals (e.g., Journal of Management, Personnel Psychology, and Academy of Management Discoveries) and books such as The Handbook of Chinese Organizational Behavior, Leadership Development in a Global World, and The Routledge Companion to International Human Resource Management. He is also co-editor of the books Les compétences culturelles and CulturalContexts of Human Resource Development. He is a member of the Editorial Board of Journal of Management, Journal of World Business, and Advances in Global Leadership. He is also the Director of the book series “Diversité culturelle et dynamiques des organisations” (Cultural Diversity and Organizational Dynamics), published by the Editor L’Harmattan, Paris. He has served as a member of the Teaching Committee of the International Management Division of the Academy of Management. At IESE, Yih-Teen teaches subjects such as leadership, leading global collaboration, self-leadership, leading multicultural teams, and strategic human resource management in the MBA and executive programs.\nYih-Teen has been living and working in Europe for almost 20 years, and identifies himself as a multicultural individual. He is fluent in Chinese, English, French, and Spanish, and has delivered training programs and seminars to senior executives in all four languages. This exposure, alongside his unyielding passion for various cultures, drives him to embrace diversity and devote his energy to the search of deep-level cultural knowledge and cultural competences, with the goal of contributing to the ability of managers and organizations to navigate global cultures effectively. He sees such development as a transformational journey of each individual and emphasizes the importance of anchoring cultural competences in one’s cultural identities and sense of self.\nYih-Teen earned his Ph.D. from HEC, University of Lausanne (Switzerland) and his Bachelor’s and Master’s degrees from National Taiwan University. Prior to IESE, he taught at HEC University of Lausanne (Switzerland), Angers Graduate School of Business ESSCA (France), and the American Graduate School of International Management Thunderbird Europe (France), among others.\nDownload full CV",
        "pdf_url": "https://blog.iese.edu/lee/"
    },
    {
        "name": "Alberto Ribera",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Alberto-Ribera_1-e1596028988277-150x150.jpg",
        "title": "Professor of the Practice of Management of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "Alberto Ribera joined IESE in 2003 after a 15-year international career with the World Health Organisation, the European Commission and other multilateral organisations, in charge of projects in Africa, Southeast Asia and especially in the Middle East. From 1999 to 2003, he was General Director of the Euro Arab Management School.\nAt IESE he is the academic director of the IESE Coaching Unit and teaches the MBA course “Personality and Leadership”, which received the 2009 IESE Award for Excellence. He also teaches the Global Executive MBA course “Managing Oneself”; and executive courses on self-leadership, relationships management and executive coaching. He is the author or co-author of 9 books and more than 30 case-studies.\nHe has been invited as visiting professor or guest speaker at universities and business schools of more than 20 different countries and at international conferences like the World Economic Forum. He has taught courses for Enel, Compagnia di San Paolo, Banco di Napoli, Telecom Italia, Saint Gobain, The Arab Contractors, Egypt Telecom, BBVA, Banco de España, Enrst&Young, Hewlett Packard, PricewaterhouseCoopers and other firms.\nHe is a board member of the Istituto per la Cooperazione Universitaria (Rome), Harambee Foundation (Nairobi) and other not-for-profit institutions.",
        "pdf_url": ""
    },
    {
        "name": "Kim Cameron",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/KimCameron-150x150.jpg",
        "title": "William Russell Kelly Professor of Management and Organizations, University of Michigan’s Stephen M. Ross School of Business",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    },
    {
        "name": "Anneloes Raes",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Raes_1-e1596029120334-150x150.jpg",
        "title": "Associate Professor of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "Anneloes Raes is Associate Professor in the Department of Managing People in Organizations and holder of the Puig Chair of Global Leadership Development at IESE. She holds a PhD in Organizational Behavior from Maastricht University and a M.A. in Psychology at the Radboud University Nijmegen in the Netherlands. Prior to joining IESE, Prof. Raes worked as an Assistant Professor at the University of St. Gallen in Switzerland, and she held visiting scholarships at UCLA’s Anderson School of Management and Harvard University.\nProf. Raes’ research expertise includes the fields of top management teams, teamwork, self-management, and leadership. Her work has been published in academic journals such as the Academy of Management Review, Journal of Applied Psychology, Human Relations, and Small Group Research, and was awarded with various grants and awards. It has also been featured in press outlets, including the Financial Times and La Vanguardia.\nAt IESE, Prof. Raes teaches classes on Leadership, Human Resources Management, and Teamwork, at the MBA and executive levels. She is also member of the supervisory board of Rijk Zwaan.",
        "pdf_url": ""
    },
    {
        "name": "Shawn Quinn",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Shawn-Quinn-web-1-150x150.jpg",
        "title": "Master’s degree in Organizational & Social Psychology from Columbia University",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    },
    {
        "name": "Conor Neill",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/ConorNeill_web-150x150.jpg",
        "title": "Director académico Profesor asociado de Dirección de Personas en las Organizaciones",
        "university_school": "2222_EUR",
        "intro_desc": "Conor Neill es presidente de Vistage en España. Vistage es la organación líder mundial de CEOs. Su misión es incrementar la eficacia y mejorar la vida de CEOs y altos ejecutivos. Ha fundado seis empresas, con las que ha levantado capital, contratado equipos y alcanzado más de diez millones de euros en ventas. Durante seis años, revolucionó el transporte en jet privado con su empresa Taxijet. Ha invertido en dos startups. Ha sido director por Europa de la Entrepreneurs’ Organization, la principal comunidad mundial de empresarios. Es padre de dos hijas, Alexandra y Sofia.\nDirige los cursos de liderazgo y comunicación en los programas MBA, Executive MBA y Global Executive MBA del IESE, así como varios programas para altos directivos. Ha trabajado con empresas como Accenture, Applus, Avanade, Barcelona Activa, IBM, ISDIN, el Partido Laborista (Reino Unido), Microsoft, Novartis, y Puig en las que ha impartido seminarios sobre liderazgo a través de la comunicación.\nConor Neill tiene una licenciatura en Psicología e Inteligencia Artificial, así como un MBA del IESE.",
        "pdf_url": ""
    },
    {
        "name": "Maty Tchey",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Maty_Tchey_web-150x150.jpg",
        "title": "Colaboradora externa",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    },
    {
        "name": "Fabrizio Ferraro",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/2011-Ferraro-WEB_258-e1594934386164-150x150.jpg",
        "title": "Academic Director",
        "university_school": "2222_EUR",
        "intro_desc": "Fabrizio Ferraro is Professor and Head of the Strategic Management Department at IESE Business School. He received his PhD in Management from Stanford University. His current research explores the emergence of responsible and impact investing in the financial sector.\nPreviously he studied the institutionalization of the Global Reporting Initiative (GRI), the robust action strategies to tackle grand challenges and the role of economics language in organizing. His work has been published in Administrative Science Quarterly, Academy of Management Review, Academy of Management Journal, Organization Science, and Organization Studies, among others.\nHe received the 2005 IESE Prize for Excellence in Research, the 2006 Best Paper Award from the Academy of Management Review, and the 2017 Roland Calori Price for the Best Paper published in Organization Studies. His research on responsible investing in the main financial markets has been supported by a five-year grant (2011-2015) of the European Research Council. He serves or has served as a member of the editorial board of Academy of Management Review, Academy of Management Discovery, and European Management Review.\nHis teaching in the MBA, EMBA, GEMBA, AMP and other Executive Education programs is primarily focused on strategic leadership and strategy execution. He also teaches the Impact Investing and Strategic Management Fashion and Luxury Goods Industry courses in the MBA program.\nHe also taught executive programs and/or consulted for firms such as Shiseido, Swire, Abertis, Telefonica, ENEL, Oracle, Banco Santander, Henkel, Nestlé, Puig, Lavazza, and Gonzalez-Byass.",
        "pdf_url": "https://blog.iese.edu/ferraro/"
    },
    {
        "name": "Massimo Maoret",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/maoret-web-e1600266595158-150x150.jpg",
        "title": "Associate Professor of Strategic Management",
        "university_school": "2222_EUR",
        "intro_desc": "Massimo Maoret is an Associate Professor in the Strategic Management Department at IESE Business School, and a European Commission Marie Curie Fellow. He received a Ph.D. in Management from Boston College in 2013; he is an active member of the Academy of Management and was also part of the Economic Sociology Work Group at the MIT Sloan School of Management between 2010 and 2013.\nMassimo’s research focuses on how social networks Impact performance, innovation, organizational socialization and the social creation of culture. His work has appeared in multiple academic outlets, including Organization Science, Strategic Management Journal, Journal of Organizational Behavior, Journal of Management Studies, Academy of Management Discoveries, Advances in Strategic Management and Research in the Sociology of Organizations. He currently serves in the Editorial Review Board of Organization Science, Academy of Management Journal, Journal of Management, Journal of Management Studies and Organization Studies.\nAt IESE, Massimo teaches Strategy Execution, Organizational Theory and Organizational Change, and Competitive Strategy (with a focus on the energy sector). He also teaches modules on Managing your Network and Getting Things Done at the Executive level, where he has offered customized modules for the Adecco Group, Boehringer Ingelheim, DOW Chemical, DSM, ERSTE, Faurecia, HARMAN, Henkel, Shiseido, UNICEF, UPS, WebSummit and XING.\nDownload complete CV",
        "pdf_url": ""
    },
    {
        "name": "Yago de la Cierva",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/YagoCierva-1.jpg",
        "title": "Senior Lecturer of Managing People in Organizations",
        "university_school": "2222_EUR",
        "intro_desc": "After his graduation in Law and his Ph.D. in Philosophy, Yago de la Cierva has dedicated all his professional life to the four branches of communications: journalism (he founded and directed the international TV news agency ROMEreports), corporate communication, university teaching and as a crisis consultant, with particular emphasis in universities and educational institutions.\nHis main professional interest is on crisis management and communication. He teaches this subject at the MBA program, in custom programs and as a visiting professor in Navarra, Colombia, Perú, Uruguay and Rome.\nHis last book is Leading companies through storms and crises, Pearson, London 2018, recently published also in Spanish: Navegar en aguas turbulentas – Principios y buenas practices en gestion y comunicación de crisis (KDP, 2020). He is now working on his new book: How to ask for pardon and be pardoned – best practices in corporate apologies (Eunsa, 2021).\nIn IESE, Yago is the academic director of the MBA and MiM courses on communication skills. His new subjects at the MBA program are “Storytelling in Business” and “Public Affairs and Reputation”.\nHis second field regards large events organization as a communicational tool. After his experience as Executive Director of World Youth Day Madrid 2011 and international media director in other large-scale events, he published Megaevents of the Catholic Church – Logbook for organizers and communicators, KDP, 2018 (available also in Italian and Spanish), and teaches “Events organization” in Rome.",
        "pdf_url": ""
    },
    {
        "name": "Brian McCarthy",
        "pic_url": "https://execedprograms.iese.edu/wp-content/uploads/Brian_8_web-150x150.jpg",
        "title": "External Collaborator",
        "university_school": "2222_EUR",
        "intro_desc": "",
        "pdf_url": ""
    }
]