[
    {
        "name": "Jose-Luis Alvarez",
        "title": "Senior Affiliate Professor of Leadership and Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/amp/images/Jose-Luis-Alvarez.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Antonio Fatas",
        "title": "Professor of EconomicsThe Portuguese Council Chaired Professor of European Studies",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3522",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/antonio-fatas",
        "intro_desc": "Antonio Fatás is a Professor of Economics at INSEAD. He received his PhD in Economics from Harvard University. He is a Research Fellow at the Centre for Economic and Policy Research in London and has worked as an external consultant for international organisations such as the International Monetary Fund, the OECD and the World Bank. He teaches the macroeconomics core course in the MBA programme, as well as different modules on the global macroeconomic environment in the Executive Education. His research focuses on the study of business cycles, fiscal policy and the economics of European integration. His articles appear in academic journals such as the Quarterly Journal of Economics, Journal of Monetary Economics, Journal of Money, Credit and Banking, Journal of Public Economics, Journal of International Economics, Journal of Economic Growth, European Economic Review and Economic Policy.",
        "pdf_url": "http://faculty.insead.edu/fatas",
        "university_school": "8888_EUR"
    },
    {
        "name": "Anil Gaba",
        "title": "Professor of Decision SciencesThe Orpar Chaired Professor of Risk ManagementAcademic Director, Center for Decision Making and Risk Analysis",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3393",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/anil-gaba",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Schon L. Beechler",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3549",
        "faculty_sub_url": "https://www.insead.edu/node/6836",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "V. (Paddy) Padmanabhan",
        "title": "Professor of MarketingThe Unilever Chaired Professor of MarketingAcademic Director, Emerging Markets Institute",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3456",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/v-paddy-padmanabhan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Sameer Hasija",
        "title": "Associate Professor of Technology and Operations Management",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9841",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/sameer-hasija",
        "intro_desc": "Sameer Hasija is a Professor of Technology and Operations Management at INSEAD. He earned his PhD in Operations Management and MS in Management Science Methods from the Simon School of Business at the University of Rochester and his BTech from the Indian Institute of Technology Madras. Sameer’s teaching focusses on using a process lens to understand new levers of innovation. Using a systematic analysis of processes within and across firm boundaries, he emphasises the role of process-based innovation in creating new business models and/or fresh competitive positioning for existing business models. Sameer conducts workshops for executives on understanding the latest developments in technology and their role in radically disrupting and/or transforming businesses. Sameer’s current research uses an economics lens to understand the design and management of technology, knowledge, and information intensive service systems. ",
        "pdf_url": "http://www.sameerhasija.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Pascal Maenhout",
        "title": "Associate Professor of Finance",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9622",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/pascal-maenhout",
        "intro_desc": "Pascal Maenhout is an Associate Professor of Finance at INSEAD. He teaches corporate finance, portfolio theory, and capital markets in MBA, PhD and Executive Education programmes. He graduated summa cum laude from the Department of Economics at the University of Leuven, Belgium and obtained an MA and a PhD in Financial Economics from Harvard University.His research interests include portfolio theory, derivatives, asset pricing, and risk management. Recent papers have been published, or are forthcoming, in leading academic journals such as the Journal of Finance, Review of Financial Studies, Journal of Economic Theory, Journal of Financial and Quantitative Analysis, Review of Finance, and Journal of Banking and Finance. Pascal Maenhout received the 2006 Institut Europlace Award for best article in finance published in 2005, the 2000 BACOB ARTESIA Prize for Research in Financial Economics, and grants from BSI Gamma and Inquire. He has previously taught at Harvard University.",
        "pdf_url": "http://faculty.insead.edu/pascal-maenhout",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ram Charan",
        "title": "Global CEO and Business AdvisorDistinguished Author and Speaker",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/amp/images/EDP2017-Ram-Charan.jpg",
        "faculty_sub_url": "http://www.ram-charan.com/about-ram/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ian Woodward",
        "title": "Professor of Management Practice",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/mgvt/images/Ian_Woodward.JPG",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ian-c-woodward",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Horacio Falcao",
        "title": "Affiliate Professor of Decision Sciences",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9845",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/horacio-falcao",
        "intro_desc": "Horacio Falcão is a Professor of Management Practice at INSEAD, where he teaches and researches on Negotiation Sciences, while also directing the  INSEAD executive education Negotiation Dynamics programme. He is the creator of the Value Negotiation system: a strategic and flexible approach to negotiation designed to maximize rewards at minimum risk in an international and complex world. He is also the founding partner of two companies: Value Negotiation Co. (VN), an advisory company to support organizations in their complex negotiations; and VN Tech, a negotiation-support software company. In 2010, Horacio published his book: Value Negotiation: How to Finally Get the Win-Win Right.Previously, Horacio worked at Cambridge Negotiation Strategies and CMI International Group (a spin-off from the Harvard Negotiation Project) and, before that, at two prestigious law firms in Brazil. He founded and was the first Vice President of the Harvard Latin America Law Society. He has worked for the International Court of Arbitration in Paris, and as a Harvard-trained mediator, he has mediated cases at the courts of Massachusetts. A lawyer trained in both civil and common law systems, Horacio graduated as an LL.M. from Harvard Law School with a concentration on alternative dispute resolution in 1997. He has an MBA (2002) and an Executive Masters in Organizational Psychology (2010) at INSEAD. In 2019, he earned his Ph.D. at Singapore Management University.For the past 20 years, Horacio has been teaching INSEAD clients and assisting Value Negotiation Co. & VN Tech clients in several different industries. His diverse list of clients includes: Aberdeen Asset Mgt, Abraaj Capital, Adidas, Aditya Birla Financial Group, Alianza Hispana, ALSTOM, AOL, Arcelor, Astellas, ATKearney, BHP Billiton, Biogen Idec, BMC Software, BP-Aral, Bristol Myers Squibb, BTG Pactual, BW Maritime, Cathay Pacific, CB Richard Ellis, Coats Viyella, Confederação Nacional de Indústrias, Credit Suisse, Danske commodities, DBS, Discovery Networks, DJOEF, DKSH, Dong Energy/Orsted, Dubai School of Gov’t, DuPont, FAS-PwC, Ford, Gemalto, GlobalFoundries, Goldman Sachs, Google, Henkel, Hewlett Packard, IBM, Incyte, Infineon, Inter-American Development Bank, JP Morgan, LLoyds TSB Group, Labein-Tecnalia, London School of Economics, MacQuarie Bank, Maersk Oil, Mastercard, MBK Partners, Merial, Microsoft, Mubadala, Nescaum, Netflix, Nokia Siemens Network, Novartis, OC&C partners, OCBC, Open Society Foundation, Oxfam, Pacific Basin, Pepsico, Permira, Pernod-Ricard, Pertamina, Petronas, Pikasso, PwC, Sabanci University, Samarco, SAP, Search for Common Ground, Schlumberger, Shell, Singtel-Optus, SK Holdings, Société Générale, ST College, Starwood, STATS, Swire, Syngenta, Temasek Group, The Bhutanese Royal Institute for Governance and Social Studies, The Crown Prince Court at Abu Dhabi, The Gov’t of Paraguay, The Gov’t of Thailand, The President of Costa Rica, The President of Ecuador, Toshiba, TNK-BP, UDV, UNDP, UOB, Valeo, Van Lanschot, Visa, World Medical Association, YPO (Saudi and Singapore chapters), besides other confidential clients.Before INSEAD, Horacio taught negotiation at the Program of Instruction for Lawyers (PIL) at Harvard Law School and mediation at the Fletcher School of Law and Diplomacy, Tufts University and the Harvard Mediation Program. He is an active angel investor and advisor to a variety of start-ups around the world.He has lived in Brazil, US, France, Singapore, and Switzerland, and worked in projects in over 30 other countries. He was based at INSEAD Singapore for more than 16 years and transferred to the Abu Dhabi campus in mid-2019. Since the beginning of his tenure at INSEAD, Horacio received the following awards:• Best MBA Elective Professor in 2004, ’05, ’06, ’08, ’09, ’12, ’13, ’14, ’15, ’16, ’17, ’18, ‘19 (INSEAD)• Best EMBA Elective Professor in 2005 (INSEAD)• Best TIEMBA Elective Professor in 2008 (Tsinghua University, Beijing, China).",
        "pdf_url": "http://www.valuenegotiation.com",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van der Heyden",
        "title": "Professor of Technology and Operations ManagementThe INSEAD Chaired Professor in Corporate Governance and StrategyAcademic Director, INSEAD Corporate Governance Centre",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ludo-van-der-heyden",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Eyal Maoz",
        "title": "Adjunct Professor of Marketing​",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/tgm/images/Eyal-Maoz.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Subramanian Rangan",
        "title": "Professor of Strategy and ManagementThe Abu Dhabi Crown Prince Court Endowed Chair in Societal Progress",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3474",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/subramanian-rangan",
        "intro_desc": "Subi Rangan received an MBA from the MIT Sloan School of Management and a Ph.D. in political economy from Harvard University.His current work explores the future of capitalism and in particular how enterprises may better integrate performance and progress. In 2013 he initiated the Society for Progress, a fellowship of eminent philosophers, social scientists, and business leaders (www.societyforprogress.org). Their first work was published in a volume entitled Performance & Progress: Essays on Capitalism, Business, and Society (Oxford University Press, 2015). Their second book is Capitalism Beyond Mutuality? Perspectives Integrating Philosophy and Social Science (Oxford University Press, 2018).His other research explores the political sociology of discrimination of foreign transnational firms and these firms’ non-market strategies. In 1998 he won the Academy of International Business’ Eldridge Haynes Prize for the best original work in international business. In 1995 that academy awarded their Best Dissertation Award to his doctoral thesis. In 2010 his research won the Emerald award for Top 50 papers in management. His articles appear in the Administrative Science Quarterly, Academy of Management Review, Brookings Papers on Economic Activity, Journal of International Business Studies, Strategic Management Journal, Sloan Management Review, and Harvard Business Review. Subi is coauthor of two books: Manager in the International Economy, and A Prism on Globalization. He is associate editor of the Academy of Management Review; former chair of the World Economic Forum’s Global Agenda Council on Emerging Multinationals; a member of the board of trustees of Fundacao Dom Cabral, a leading business school in Brazil; and a member of the Board of the Schwab Foundation for Social Entrepreneurship. Subi directs INSEAD’s top executive seminar AVIRA: Awareness, Vision, Imagination, Role, and Action, as well as the newly launched Integrating Performance & Progress. Professor Rangan is a multiple-time recipient of the Outstanding Teacher award and Dean’s Commendation for Excellence in Teaching. He is married and has a daughter and son.",
        "pdf_url": "http://faculty.insead.edu/subramanian-rangan",
        "university_school": "8888_EUR"
    },
    {
        "name": "Loic Sadoulet",
        "title": "Affiliate Professor of Economics",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3475",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/loic-sadoulet",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ian Woodward",
        "title": "Professor of Management Practice",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3507",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ian-c-woodward",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Douglas Rosefsky",
        "title": "Adjunct Professor",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3327",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/douglas-rosefsky",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Charles Galunic",
        "title": "Professor of Organisational BehaviourThe Aviva Chaired Professor of Leadership and Responsibility",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3396",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/charles-galunic",
        "intro_desc": "Charles Galunic is a Professor of Organisational Behaviour and the Aviva Chaired Professor of Leadership and Responsibility at INSEAD. He works within the fields of organisation behaviour and strategy. His research explores the social fabric of innovation and change, and at multiple levels. At the individual level, he has studied the influence of social networks on a manager’s ability to innovate. At a corporate level, he has examined structural changes and the processes which help firms to adapt. The latter work is also focused on organisation culture, including its alignment with strategy, how it changes, and the role of leadership. Finally, he explores leadership transitions, that is how managers develop their leadership skills and identity. He has served on the editorial board of Strategic Organisation and the Strategic Management Journal, and is a former departmental editor of the Journal of International Business Studies. He has published in various academic and practitioner-oriented journals, including the Journal of Managerial and Decision Economics, Administrative Science Quarterly, Academy of Management Journal, Organisation Science, Strategic Management Journal, Harvard Business Review, and Research in Organisational Behaviour. Professor Galunic has been a pioneer of several courses at INSEAD, including the core MBA course on Managing Organisations. He has won best case study awards, including the 2007 ECCH Best Case Award (Organisational Behaviour/Human Resources area). He also teaches in a variety of INSEAD Executive Education programmes, both in Fontainebleau and in Asia, and was a programme director of the INSEAD's high potentials programme (Management Acceleration Programme). He was a nominee for the Best Core Teacher Award, EMBA in 2004, 2005, 2006, and received the 2004/2005 INSEAD Excellence Award in Executive Education.Professor Galunic holds a PhD in Organisational Behaviour/Industrial Engineering from Stanford University, California; a BA in Philosophy, Politics and Economics from Oxford University (Canadian Rhodes Scholar); and a BSc in Chemical Engineering from Queen's University, Canada.Charles Galunic directs the Executive Education Transition to General Management Programme and Leading Organisations in Disruptive Times.'",
        "pdf_url": "https://www.charlesgalunic.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lucie Tepla",
        "title": "Affiliate Professor of Finance",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3492",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/lucie-tepla",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Noah Askin",
        "title": "Assistant Professor of Organisational Behaviour",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3351",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/noah-askin",
        "intro_desc": "Noah Askin is an Assistant Professor of Organisational Behaviour at INSEAD, where he teaches the organisational design and leadership core course in the MBA program. His teaching focuses primarily on firms’ organisational-strategic alignment, leading and experiencing organisational change, managing corporate culture, and utilizing social networks.Noah is interested in social and cultural networks, the antecedents and consequences of creativity and innovation, the production and consumption of culture, and the dynamics of organisational and individual status. His current research is divided among these interests in two streams. The first is around the creation and performance of cultural products: music chart and industry dynamics, what factors contribute to creativity, the tradeoffs associated with being innovative, the implications of the shift to digital distribution, and the analysis of culture using big data. The second area of research is around the role and impact of network- and rankings-based status on organisations. His work, which has garnered him recognition on the Thinkers 50 Radar list, has appeared in Administrative Science Quarterly, computational social science publications, and been covered in Forbes, Quartz.com, The Times of London, and music industry blogs. Prior to becoming a business school academic, Noah had a number of roles in the business and not-for-profit sectors. He was a management consultant for the Monitor Group, working in its strategy practice and its Executive Development group. This was followed by several years as an early member of a start-up in the educational services space. Noah received a joint PhD from the University of Chicago’s Booth School of Business and its Sociology department. He also has an MA in Sociology from the University of Chicago and an MBA from Booth, as well as an AB in Psychology from Harvard University. ",
        "pdf_url": "http://noahaskin.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Youssef F. Bissada",
        "title": "Emeritus Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3358",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/youssef-f-bissada",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Hernan Bruno",
        "title": "Assistant Professor of Marketing",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/map/images/Hernan_Bruno.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Gavin Cassar",
        "title": "Associate Professor of Accounting and Control",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3369",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/gavin-cassar",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "James Costantini",
        "title": "Affiliate Professor of Strategy",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3379",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/james-costantini",
        "intro_desc": "James's research interest is on how firm strategy and industrial organization is affected by the broader institutional environment. James has taught courses on strategy and economics to undergraduates, MBAs and executives.Before joining INSEAD, James received his PhD in Business Economics from Harvard University/Harvard Business School. James's prior education includes a Masters in Business Administration from Harvard Business School, where he graduated Baker Scholar, and a MPhil in Finance and a BA in Mathematics from Cambridge University, U.K..James has over a ten years experience as a consultant. James was a management consultant in the London and New York offices of McKinsey & Company from 1991 to 2001, except for the two years to complete his MBA. James advised primarily on issues of business unit strategy and corporate strategy to clients across a range of industries. James has also consulted with ghSmart & Company, with a focus on assessment of senior management teams for private equity investors.At INSEAD James teaches in the MBA programme and in a range of executive education programmes. Within executive education, James’s programme direction has been with companies from a wide range of sectors and geographies, including KPMG, Toshiba, Amdocs, Orkla, Borregaard, OliverWyman, GERBUS (http://www.gerbus-academy.com/), NSG, and Ferrovial.",
        "pdf_url": "http://faculty.insead.edu/james-costantini",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jason P. Davis",
        "title": "Associate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3380",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jason-p-davis",
        "intro_desc": "Jason Davis is an Associate Professor of Entrepreneurship and Family Enterprise at INSEAD. He is an expert on digital transformation and innovation in large enterprises and the strategies of startups in digital platform ecosystems. His research has focused on issues of collaboration and adaptation by 'big tech' computing companies in Silicon Valley and Seattle, fast experimentation by mobile app ventures on the iPhone and Android platforms, and the social media strategies of the Fortune 500 companies using Twitter and Facebook. He applies these insights to large organizations as they seek to create value with new digital technologies and systems like artificial intelligence, automation, platform-marketplaces, blockchain, and super-apps, and to new ventures in his MBA course, Digital Entrepreneurship. Jason has focused effort on investigating business model innovations by big tech companies in Asia, having developed teaching cases about how companies such as Go-Jek, Grab, Alibaba, ByteDance, Pinduoduo, and Circles.Life are innovating in the region, and how Amazon, Facebook, Microsoft, and Google compete globally. Prior to joining INSEAD, Jason was an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management in the MIT Sloan School of Management where he taught Technology Strategy.Jason earned PhD and MA degrees from Stanford University, where his research was supported by the National Science Foundation. He also earned MS and SB degrees from Caltech and MIT where he did thesis research in computation theory and molecular biology. His research has been published in top academic journals such as the Administrative Science Quarterly, American Economic Review, Strategic Management Journal, Academy of Management Journal, and Academy of Management Review. Jason has served as editorial board member at Academy of Management Journal, Organization Science, Strategic Management Journal, and Strategic Organization. He has received multiple research awards including the AOM Academy-Wide Newman Award for Best Paper from a Dissertation (2009), the TIM Division Best Doctoral Dissertation Award (2009), the TIM Division Best Paper Award (2009), the OMT Division Best Paper Award (2008), and the ACAC Competitive Advantage Best Paper Award (2014). Jason also received an Honorable Mention Award for the Granovetter Prize for best article in Economic Sociology from the American Sociological Association (2012). He is also the recipient of the Academy of Management's Technology Innovation Management Emerging Scholar Award (2012). Finally, Jason was selected to receive the ASQ Award for Scholarly Contribution (2015) given to “the most significant paper published in ASQ five years earlier.” His research has also been featured in a variety of popular and industry publications like Harvard Business Review, BBC, Financial Times, Wall Street Journal, Bloomberg, The Atlantic, Forbes, Fortune, The Economist Podcast, Wired, Channel News Asia, South China Morning Post, Jakarta Post, Huffington Post, Sloan Management Review, Computer World and Technology Review. Jason has also consulted, advised, or spoken about his research or conducted executive education at multiple companies including Intel, Microsoft, Cisco, Google, Broadcom, ESI, Sun Microsystems, Tesla, Citibank, Bank Indonesia, BCA, Pertamina, Astra, Go-Jek, Axiata, Natixis, Frasers, Prudential, Aviva, CIMB, Jardines, JG Summit, Lenovo, and various startups. He is a recipient of the EFMD EiP Gold Award (2020) in executive education. At INSEAD, he serves as Program Director for customized executive education programs about Digital Strategy & Leadership and the Leading Digital Transformation and Innovation open enrollment program on INSEAD’s Asia campus.",
        "pdf_url": "http://faculty.insead.edu/jason-davis",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lily Hua Fang",
        "title": "Associate Professor of Finance",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3391",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/lily-hua-fang",
        "intro_desc": "Lily Fang is a Professor of Finance at INSEAD and the holder of the AXA Chair in Financial Market Risk. Professor Fang joined INSEAD in 2003. She is currently based in the European campus, after having spent twelve years in the Asian campus.Professor Fang’s primary research interest is financial market information and investment strategies. She has published numerous papers on the performance, behavior, and incentives of financial analysts, fund managers, and financial institutions in top academic journals such as the Journal of Finance, the Journal of Financial Economics, and the Review of Financial Studies. Her work on the relation between media coverage and stock returns received the prestigious Smith Breeden prize for outstanding papers published in the Journal of Finance. Professor Fang has advised a number of large institutional investors on investment strategies.At INSEAD Professor Fang teaches corporate finance, capital markets, valuation, private equity, venture capital and entrepreneurial finance in the MBA, EMBA, and Executive Education programmes. She has won the Dean's Commendation Award for Excellence in MBA Teaching numerous times and has taught and directed numerous Executive Education programmes. Professor Fang has also been a Visiting Professor of Finance at the MIT Sloan School of Management where she won the Outstanding Teacher Award.Professor Fang obtained her PhD in Finance from the Wharton School, University of Pennsylvania. Prior to that, she studied mathematics, actuarial science and management science at Simon Fraser University in Vancouver. ",
        "pdf_url": " http://faculty.insead.edu/lily-fang",
        "university_school": "8888_EUR"
    },
    {
        "name": "Sameer Hasija",
        "title": "Associate Professor of Technology and Operations Management",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9841",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/sameer-hasija",
        "intro_desc": "Sameer Hasija is a Professor of Technology and Operations Management at INSEAD. He earned his PhD in Operations Management and MS in Management Science Methods from the Simon School of Business at the University of Rochester and his BTech from the Indian Institute of Technology Madras. Sameer’s teaching focusses on using a process lens to understand new levers of innovation. Using a systematic analysis of processes within and across firm boundaries, he emphasises the role of process-based innovation in creating new business models and/or fresh competitive positioning for existing business models. Sameer conducts workshops for executives on understanding the latest developments in technology and their role in radically disrupting and/or transforming businesses. Sameer’s current research uses an economics lens to understand the design and management of technology, knowledge, and information intensive service systems. ",
        "pdf_url": "http://www.sameerhasija.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Erin Meyer",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/11088.jpg?itok=qMrxH3EJ",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/erin-meyer",
        "intro_desc": "Erin Meyer is Senior Affiliate Professor in the Organisational Behaviour Department at INSEAD and specialises in the field of cross-cultural management, organisational culture, intercultural negotiations, and multi-Cultural leadership. Erin is the Programme Director for Leading Across Borders and Cultures. She is the author of the best-selling book The Culture Map: Breaking Through the Invisible Boundaries of Global Business. She is also the co-author, with Netflix CEO Reed Hastings, of the New York Times best-seller and FT short-listed best business book of 2020 No Rules Rules: Netflix and the Culture of Reinvention. Erin’s work focuses on how the world’s most successful leaders navigate the complexities of cultural differences in a global environment. In 2019 Erin was selected by the Thinkers50 as one of the world’s 50 most influential business thinkers.Living and working in Africa, Europe, and the United States prompted Erin Meyer’s study of the communication patterns and business systems of different parts of the world. Her culture mapping framework allows international executives to pinpoint their leadership preferences and compare their methods to the management styles of other cultures. Erin has taught thousands of executives from 5 continents to decode cross-cultural complexities impacting their work, and to lead more effectively across these differences.Erin has published articles in Harvard Business Review magazine: “Being the Boss in Brussels, Boston, and Beijing (July 2017), Getting to Si, Ja Oui, Hai and Da (December 2015), When Culture Doesn’t Translate (October 2015,) Navigating the Cultural Minefield (May 2014), and Debunking China Myths (January 2010). Her work has been published in the New York Times Sunday paper “Looking Another Culture in the Eye” (September 2014), the Times of India “A Business-Man’s Guide to Manners” (September 2014), Forbes.Com “The Four Keys to Success with Virtual Teams” (September 2010), South China Morning Post “Eight-Scale Tool for Mapping Cultural Differences” (May 2014) and The Jakarta Post “When to Speak Up, When to Shut Up” (April 2014). She has been interviewed by Fareed Zakaria on CNN and by Scarlet Fu on Bloomberg Surveillance. Her case, “Leading Across Cultures at Michelin,” won the ECCH 2010 European case award for best human resources management case of the year.Find more media articles here: https://erinmeyer.com/resources/ ",
        "pdf_url": "http://erinmeyer.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "V. (Paddy) Padmanabhan",
        "title": "Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3456",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/v-paddy-padmanabhan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Haydn Pound",
        "title": "Adjunct Professor of Accounting and Control",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/map/images/Haydn_Pound.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jasjit Singh",
        "title": "Associate Professor of StrategyThe Shell Fellow in Business and the Environment",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9846",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jasjit-singh",
        "intro_desc": "Jasjit has been an INSEAD professor since 2004. His expertise includes Strategy, Innovation, Sustainable Development, Purpose-Driven Business, Impact Investing and Impact Evaluation. He regularly speaks on these topics, and also advises entrepreneurs, philanthropists, investors and organizations on how to best manage their societal impact.Jasjit has written numerous articles for leading journals and case studies that have won prestigious awards. He earned a PhD in Business Economics (Strategy) at Harvard Business School and an MA in Economics at Harvard University, having earlier obtained a BTech in Computer Science & Engineering at IIT Delhi and a double-MS at Georgia Tech.Details of Jasjit’s work can be found at http://faculty.insead.edu/jasjit-singh",
        "pdf_url": "http://faculty.insead.edu/jasjit-singh/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enver Yucesan",
        "title": "Professor of Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3511",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enver-yucesan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Gianpiero Petriglieri",
        "title": "Associate Professor of Organisational BehaviourAcademic Director, Initiative for Learning Innovation and Teaching Excellence",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/map/images/Gianpiero_Petriglieri.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/gianpiero-petriglieri",
        "intro_desc": "Gianpiero Petriglieri is an Associate Professor of Organisational Behaviour at INSEAD, and an expert on leadership and learning in the workplace. He directs the Management Acceleration Programme , the school’s flagship Executive Education programme for emerging leaders, and is the Academic Director of the INSEAD Initiative for Learning Innovation and Teaching Excellence . Gianpiero's award-winning research and teaching focus on what it means, and what it takes, to become a leader. He is particularly interested in the development and exercise of leadership in the age of \"nomadic professionalism,\" in which people have deep bonds to work but loose affiliations to institutions, and authenticity and mobility have replaced loyalty and advancement as hallmarks of virtue and success.Gianpiero's research has appeared in leading academic journals such as the Administrative Science Quarterly , Academy of Management Annals , Academy of Management Learning & Education , Organization Studies and Organization Theory . He also writes essays regularly for the Harvard Business Review and Sloan Management Review . His work has been featured in a range of media including the BBC , Financial Times , The Economist , The Guardian , New York Times , Wall Street Journal , Washington Post , Quartz , Vox , Le Figaro and El Pais , and he is listed among the 50 most influential management thinkers in the world by Thinkers50 .Building on this research, Gianpiero has contributed to refining a unique approach to experiential leadership development that aims to accelerate the development of individual leaders as well as to strengthen leadership communities within and across organisations. Alongside the Management Acceleration Programme, he designs and directs customized leadership development programmes for multinationals in a variety of industries. He aslo speaks widely on how to live, lead, and learn \"on the move\" without losing one's roots.In the INSEAD MBA, Gianpiero teaches the core course \"Ethics: Value-based leadership for cosmopolitans.\" He taught the \"Leading People and Groups\" core course for five years, receiving the students' Outstanding Teacher Award, and has earned numerous Dean's Commendations for Teaching Excellence in MBA and Executive Education. His executive programmes have also received school- and industry-wide awards for exellence in the practice of executive education.A Medical Doctor and Pyschiatrist by training, Gianpiero has worked as an executive coach, practiced as a psychotherapist, and served on the staff of group relations conferences in Europe and the United States. He has held Visiting Professor positions at the Harvard Business School, and at Copenhagen Business School. You can learn more about Gianpiero's work on Twitter , or connect with him on LinkedIn .",
        "pdf_url": "http://gpetriglieri.com",
        "university_school": "8888_EUR"
    },
    {
        "name": "Henrik Bresman",
        "title": "Associate Professor of Organisational BehaviourAcademic Director, INSEAD Global Leadership Centre",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10814",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/henrik-bresman",
        "intro_desc": "Henrik Bresman is an Associate Professor of Organisational Behaviour at INSEAD. He studied economics at the Stockholm School of Economics, philosophy and Japanese at Lund University, Sweden, and financial management at Keio University, Japan. He received his PhD from the Massachusetts Institute of Technology.Professor Bresman is an expert on distributed leadership and high-performance teams. He is the co-author of the top-selling book X-Teams: How to Build Teams that Lead, Innovate, and Succeed (published by Harvard Business School Press), which examines how teams at all levels can take on strategic leadership roles and change the direction of their firms. It also documents how top management can unlock the talent of the organisation to create an infrastructure for innovation across their company.His research on leadership and teams in contexts of technological innovation, international post-acquisition integration, and strategic change draws on data from industries such as biotechnology, pharmaceuticals, aerospace, software development, and investment banking. His articles have appeared in peer-reviewed academic journals such as Academy of Management Journal, Journal of International Business Studies, Journal of Management Studies, MIT Sloan Management Review, and Organization Science. He has served on the editorial boards of Academy of Management Journal, Academy of Management Review, and Organization Science. His work has been profiled in many media outlets including Time Magazine, The New York Times, The Wall Street Journal, Financial Times, Forbes, and The Economist. Professor Bresman’s work has been recognised with honours such as the Journal of International Business Studies Decade Award (winner), the George R. Terry Book Award (finalist), the Academy of Management’s William H. Newman Award (winner), the Academy of Management’s Best Paper Award (Organizational Development and Change Division), and the Richard Beckhard Prize for best article on organisational change published in the MIT Sloan Management Review.Professor Bresman's current teaching at INSEAD focuses on developing principled and effective leaders. He is directing the Management Acceleration Programme. His teaching at INSEAD has been awarded the Dean’s Commendation for Excellence in Executive Development Programmes (EDP) Teaching, Excellence in EDP Direction, and Excellence in MBA Teaching. He has also been nominated for the Best MBA Core Course Teacher award. Prior to entering academia, Professor Bresman worked in several roles as a manager, consultant, and entrepreneur. He co-founded a venture capital firm focused on early-stage technology businesses.",
        "pdf_url": "http://faculty.insead.edu/henrik-bresman/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jennifer Petriglieri",
        "title": "Associate Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10890",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jennifer-petriglieri",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Pushan Dutt",
        "title": "Professor of EconomicsThe Shell Fellow of Economic Transformation",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9967",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/pushan-dutt",
        "intro_desc": "Pushan Dutt is a Professor of Economics and Political Science at INSEAD. He holds a PhD in Economics from New York University, a Masters in Economics from the Delhi School of Economics, and a Bachelor degree in Economics from Presidency College, Calcutta. Professor Dutt directs the Leading Business Transformation in Asia.Professor Dutt's work lies at the intersection of politics, institutions and international economics. His main research examines how partisan concerns (the political ideology of parties in power) and populist concerns (inequality in income and asset distribution) play an important role in the determination of trade policies. The second stream of his research has a developmental focus and examines the links between institutions and policies. His recent work shows that political instability is very costly in terms of investment and growth, whereas the level of democracy or dictatorship in a country matters much less. A third stream of his research examines the role played by international trade and technological change in accelerating the wage gap between skilled and unskilled workers.Professor Dutt’s research has been published in Canadian Journal of Economics, Review of Economics and Statistics, Economic Journal and the Journal of International Economics. He has also contributed to the Oxford Dictionary of Social Sciences where he wrote the entries on Economics.Professor Dutt has worked as an economist at the World Bank's Development Research Group and the Latin American and Caribbean Division, and is currently consulting for the World Bank on a major research project. He has also worked as a fellow at the Ford Foundation, and as a writer and consultant for the Oxford University Press. In addition, he has taught microeconomics, economic development, and international trade and finance to undergraduate, MBA, and PhD participants since 1994. He has won the Best Teacher Award in the INSEAD MBA programme multiple times.",
        "pdf_url": "http://faculty.insead.edu/pushan-dutt/",
        "university_school": "8888_EUR"
    },
    {
        "name": "V. (Paddy) Padmanabhan",
        "title": "Professor of MarketingThe Unilever Chaired Profesor of Marketing",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ilpse/images/Padmanabhan.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/v-paddy-padmanabhan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philip Anderson",
        "title": "Professor of EntrepreneurshipThe INSEAD Alumni Fund Chaired Professor of Entrepreneurship",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=7063",
        "faculty_sub_url": "http://www.insead.edu/faculty-research/faculty/philip-anderson",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Erin Meyer",
        "title": "Associate Professor of Organisational Behaviour",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3554",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/erin-meyer",
        "intro_desc": "Erin Meyer is Senior Affiliate Professor in the Organisational Behaviour Department at INSEAD and specialises in the field of cross-cultural management, organisational culture, intercultural negotiations, and multi-Cultural leadership. Erin is the Programme Director for Leading Across Borders and Cultures. She is the author of the best-selling book The Culture Map: Breaking Through the Invisible Boundaries of Global Business. She is also the co-author, with Netflix CEO Reed Hastings, of the New York Times best-seller and FT short-listed best business book of 2020 No Rules Rules: Netflix and the Culture of Reinvention. Erin’s work focuses on how the world’s most successful leaders navigate the complexities of cultural differences in a global environment. In 2019 Erin was selected by the Thinkers50 as one of the world’s 50 most influential business thinkers.Living and working in Africa, Europe, and the United States prompted Erin Meyer’s study of the communication patterns and business systems of different parts of the world. Her culture mapping framework allows international executives to pinpoint their leadership preferences and compare their methods to the management styles of other cultures. Erin has taught thousands of executives from 5 continents to decode cross-cultural complexities impacting their work, and to lead more effectively across these differences.Erin has published articles in Harvard Business Review magazine: “Being the Boss in Brussels, Boston, and Beijing (July 2017), Getting to Si, Ja Oui, Hai and Da (December 2015), When Culture Doesn’t Translate (October 2015,) Navigating the Cultural Minefield (May 2014), and Debunking China Myths (January 2010). Her work has been published in the New York Times Sunday paper “Looking Another Culture in the Eye” (September 2014), the Times of India “A Business-Man’s Guide to Manners” (September 2014), Forbes.Com “The Four Keys to Success with Virtual Teams” (September 2010), South China Morning Post “Eight-Scale Tool for Mapping Cultural Differences” (May 2014) and The Jakarta Post “When to Speak Up, When to Shut Up” (April 2014). She has been interviewed by Fareed Zakaria on CNN and by Scarlet Fu on Bloomberg Surveillance. Her case, “Leading Across Cultures at Michelin,” won the ECCH 2010 European case award for best human resources management case of the year.Find more media articles here: https://erinmeyer.com/resources/ ",
        "pdf_url": "http://erinmeyer.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Stanislav Shekshnia",
        "title": "Affiliate Professor of Entrepreneurship and Family EnterpriseCo-Director of the Leading from the Chair Programme",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/stanislav_shekshnia.jpg",
        "faculty_sub_url": "https://www.insead.edu/executive-education/corporate-governance/leading-from-the-chair",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/enrico-diecidue.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "Anil Gaba",
        "title": "Professor of Decision SciencesThe Orpar Chaired Professor of Risk ManagementAcademic Director, Center for Decision Making and Risk Analysis",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3393",
        "faculty_sub_url": "http://www.insead.edu/faculty-research/faculty/anil-gaba",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Timothy Rowley",
        "title": "INSEAD Corporate Governance Centre Distinguished Fellow and Visiting Professor of StrategyProfessor of Strategic Management at the Rotman School of Management, University of Toronto",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lcp/images/Tim_Rowley.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/timothy-rowley",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "José Luis Alvarez",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lt/images/jose_luis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Karel Cool",
        "title": "Professor of Strategic ManagementThe BP Chaired Professor of European Competitiveness",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/cs/images/faculty-Karel-Cool.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/karel-cool",
        "intro_desc": "Karel Cool is a Professor of Strategic Management and the BP Chaired Professor of European Competitiveness at INSEAD. His research, teaching, and consulting focus on problems of industry dynamics and competitive strategy (e.g., competitive positioning; assessment of profit opportunities in markets; strategic supply chain dynamics and management; eco-system leadership; vertical integration and de-integration; industry overcapacity; critical mass races, customer value creation, and capturing). Karel Cool is directing the Competitive Strategy Executive Education programme.He has published in many journals, including Management Science, Strategic Management Journal, Harvard Business Review, Organization Science, Academy of Management Journal, Marketing Letters, Advances in Strategic Management, Journal of Supply Chain Management, etc.; edited books such as European Industrial Restructuring in the 1990s (with D. Neven and I. Walter; Macmillan 1992), and Industry Structuring and Restructuring (with J. Henserson and R. Abate; Blackwell 2004, SMS Book Series); and has contributed to many books on competitive strategy.From 1995 to 2007 he was an Associate Editor of the Strategic Management Journal, a leading strategy journal.He has consulted on major strategic issues of corporate and industry restructuring, and worked with various corporations including Unilever, PriceWaterhouseCoopers, Daimler-Chrysler, Borealis, RollsRoyce, Thomson Travel Group, Exxon, Solvay, Novo-Nordisk Lufthansa, KBC, Whirlpool, IBM, Expedia, Banque de France, McKinsey, Starwood, BCG, Shell, ING, Aktiva, Amgen, Bayer, Nordea, World Economic Forum, IBM, KGL Kuwait, Hearst, Reynaers Aluminium, Dong Energy Wind Power, Vandemoortele, Mars, etc.During the 1995-1996 academic year, he was a Visiting Professor at the Graduate School of Business at the University of Chicago. He was also a Visiting Professor at Northwestern University, and was a co-chair of the annual 2002 Strategic Management Society Conference held in Paris.He is a six-times winner of the 'Best Teaching Award' in the MBA programme, and is the founder and Programme Director of the long-running 'Competitive Strategy' Executive Education programme at INSEAD in Fontainebleau and Singapore. In 2007 he was inducted as a Fellow of the Strategic Management Society. In 2009 he received the George S. Day Distinguished Alumni Academic Service Award from Purdue University. In September 2014, he was honoured by the Case Center as one of the best-selling case authors over the past forty years — Karel has (co-)authored more than sixty case studies.Karel Cool obtained his PhD (1985) and MScIA (1982) from Purdue University, and his MA (1981) and Lic (1978) in Applied Economics from the University of Antwerp (UFSIA).'''",
        "pdf_url": "http://faculty.insead.edu/karel-cool",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jose Santos",
        "title": "Affiliated Professor of Practice in Global Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/msib/images/Jose-santos.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jos%C3%A9-santos",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van Der Heyden",
        "title": "INSEAD Chaired Professor in Corporate GovernanceEmeritus Professor of Technology and Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/node/7069",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Timothy Rowley",
        "title": "INSEAD Corporate Governance Centre Distinguished Fellow and Visiting Professor of StrategyProfessor of Strategic Management at the Rotman School of Management, University of Toronto",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lcp/images/Tim_Rowley.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/timothy-rowley",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Stanislav Shekshnia",
        "title": "Senior Affiliate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/stanislav_shekshnia.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/stanislav-shekshnia",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van Der Heyden",
        "title": "INSEAD Chaired Professor in Corporate GovernanceEmeritus Professor of Technology and Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ludo-van-der-heyden",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffman Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van Der Heyden",
        "title": "INSEAD Chaired Professor in Corporate GovernanceEmeritus Professor of Technology and Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/node/7069",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Peter Nathanial",
        "title": "INSEAD Corporate Governance Centre Fellow",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/mgb/images/Peter_Nathaniel_133x133.jpg",
        "faculty_sub_url": "https://www.insead.edu/executive-education/interviews/corporate-governance/bank-director-training",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Christine Blondel",
        "title": "Adjunct Professor of Family Business",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3534",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/christine-blondel",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Randel Carlock",
        "title": "Senior Affiliate Professor of Entrepreneurship and Family EnterpriseThe Berghmans Lhoist Chaired Professor of Entrepreneurial Leadership",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/fame/images/Randy_Carlock.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/randel-carlock",
        "intro_desc": "Dr. Randel S. Carlock researches and teaches about entrepreneurship, family business and leadership based on his experience as a CEO, management professor, consultant and psychotherapist. He is the first Berghmans Lhoist Chaired Professor in Entrepreneurial Leadership and is the founding academic director of the Wendel International Centre for Family Enterprise at INSEAD (Europe, Asia, Abu Dhabi and San Francisco) he directed from 2005 until 2009. He is co-directing the The Family Business Enterprise Challenge. Previously he was the first Opus Professor of Family Enterprise and founder of the family business centre at the University of St. Thomas in Minneapolis, MN (USA).Carlock has an MA in education and training (1976), an Executive MBA in strategic management (1983), and a Ph.D. (1991), all from the University of Minnesota. His doctoral dissertation explored the role of organization development in managing high growth entrepreneurial firms. He has also completed a post graduate certification in family and marriage therapy at the Institute of Psychiatry, King¹s College, University of London (1998) and a certificate in psychodynamic counseling at Birkbeck College, University of London (1999). He was awarded a Certificate in Family Business Advising with Fellow Status (2001) by the Family Firm Institute, Boston, MA (USA). He completed The Art and Practice of Leadership Development at Harvard University Kennedy School of Government in 2011 and in 2015 Strategic Family Therapy Training at the Mental Research Institute in Palo Alto, California. Carlock is author or co-author of six books and several articles, chapters, and case studies including his latest book A Family Business on the Moon with Keng Fun Loh (2018), When Family Businesses are Best: The Parallel Planning Process for Family Harmony and Business Success with John L. Ward (Macmillan, 2010), Family Business on the Couch: A Psychological Perspective with Manfred Kets de Vries and Liz Florent (John Wiley and Sons, 2007), Strategic Planning for the Family Business with John L. Ward (Macmillan, 2003) and Organization Development in Successful Entrepreneurial Firms (Garland Publishing, 1994). Carlock has also written chapters in two edited coaching books, Leadership Coaching in Family Businesses (2008) and Failure in Family Business Coaching (2010).In 2008 Carlock received the Family Firm Institute International Achievement Award for furthering the understanding of family business issues through educational programs with the primary focus on the work of family businesses crossing international borders. An article Fair Process: Striving for Justice in Family Firms (with L. Van der Heyden and C. Blondel) received the 2006 Family Business Network Research Award for the best-published research article on family business practice (Family Business Review, XVIII, (1), March 2005). The HP-Compaq Merger: A Battle for the Heart and Soul of a Company (with Liz Florent) was awarded the 2005 IMD-European Foundation for Management Education Family Business Case Competition prize.Carlock has 25 years of management and leadership experience serving first as an executive with a New York Stock Exchange family business, Dayton-Hudson (now Target Corporation) and as a CEO and Chairman of four companies he created including a NASDAQ listed corporation. He currently advises global business families and corporations specializing strategy, leadership and governance.",
        "pdf_url": "javascript:;",
        "university_school": "8888_EUR"
    },
    {
        "name": "Karel Cool",
        "title": "Professor of Strategic ManagementThe BP Chaired Professor of European Competitiveness",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/cs/images/faculty-Karel-Cool.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/karel-cool",
        "intro_desc": "Karel Cool is a Professor of Strategic Management and the BP Chaired Professor of European Competitiveness at INSEAD. His research, teaching, and consulting focus on problems of industry dynamics and competitive strategy (e.g., competitive positioning; assessment of profit opportunities in markets; strategic supply chain dynamics and management; eco-system leadership; vertical integration and de-integration; industry overcapacity; critical mass races, customer value creation, and capturing). Karel Cool is directing the Competitive Strategy Executive Education programme.He has published in many journals, including Management Science, Strategic Management Journal, Harvard Business Review, Organization Science, Academy of Management Journal, Marketing Letters, Advances in Strategic Management, Journal of Supply Chain Management, etc.; edited books such as European Industrial Restructuring in the 1990s (with D. Neven and I. Walter; Macmillan 1992), and Industry Structuring and Restructuring (with J. Henserson and R. Abate; Blackwell 2004, SMS Book Series); and has contributed to many books on competitive strategy.From 1995 to 2007 he was an Associate Editor of the Strategic Management Journal, a leading strategy journal.He has consulted on major strategic issues of corporate and industry restructuring, and worked with various corporations including Unilever, PriceWaterhouseCoopers, Daimler-Chrysler, Borealis, RollsRoyce, Thomson Travel Group, Exxon, Solvay, Novo-Nordisk Lufthansa, KBC, Whirlpool, IBM, Expedia, Banque de France, McKinsey, Starwood, BCG, Shell, ING, Aktiva, Amgen, Bayer, Nordea, World Economic Forum, IBM, KGL Kuwait, Hearst, Reynaers Aluminium, Dong Energy Wind Power, Vandemoortele, Mars, etc.During the 1995-1996 academic year, he was a Visiting Professor at the Graduate School of Business at the University of Chicago. He was also a Visiting Professor at Northwestern University, and was a co-chair of the annual 2002 Strategic Management Society Conference held in Paris.He is a six-times winner of the 'Best Teaching Award' in the MBA programme, and is the founder and Programme Director of the long-running 'Competitive Strategy' Executive Education programme at INSEAD in Fontainebleau and Singapore. In 2007 he was inducted as a Fellow of the Strategic Management Society. In 2009 he received the George S. Day Distinguished Alumni Academic Service Award from Purdue University. In September 2014, he was honoured by the Case Center as one of the best-selling case authors over the past forty years — Karel has (co-)authored more than sixty case studies.Karel Cool obtained his PhD (1985) and MScIA (1982) from Purdue University, and his MA (1981) and Lic (1978) in Applied Economics from the University of Antwerp (UFSIA).'''",
        "pdf_url": "http://faculty.insead.edu/karel-cool",
        "university_school": "8888_EUR"
    },
    {
        "name": "Erin Meyer",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=11088",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/erin-meyer",
        "intro_desc": "Erin Meyer is Senior Affiliate Professor in the Organisational Behaviour Department at INSEAD and specialises in the field of cross-cultural management, organisational culture, intercultural negotiations, and multi-Cultural leadership. Erin is the Programme Director for Leading Across Borders and Cultures. She is the author of the best-selling book The Culture Map: Breaking Through the Invisible Boundaries of Global Business. She is also the co-author, with Netflix CEO Reed Hastings, of the New York Times best-seller and FT short-listed best business book of 2020 No Rules Rules: Netflix and the Culture of Reinvention. Erin’s work focuses on how the world’s most successful leaders navigate the complexities of cultural differences in a global environment. In 2019 Erin was selected by the Thinkers50 as one of the world’s 50 most influential business thinkers.Living and working in Africa, Europe, and the United States prompted Erin Meyer’s study of the communication patterns and business systems of different parts of the world. Her culture mapping framework allows international executives to pinpoint their leadership preferences and compare their methods to the management styles of other cultures. Erin has taught thousands of executives from 5 continents to decode cross-cultural complexities impacting their work, and to lead more effectively across these differences.Erin has published articles in Harvard Business Review magazine: “Being the Boss in Brussels, Boston, and Beijing (July 2017), Getting to Si, Ja Oui, Hai and Da (December 2015), When Culture Doesn’t Translate (October 2015,) Navigating the Cultural Minefield (May 2014), and Debunking China Myths (January 2010). Her work has been published in the New York Times Sunday paper “Looking Another Culture in the Eye” (September 2014), the Times of India “A Business-Man’s Guide to Manners” (September 2014), Forbes.Com “The Four Keys to Success with Virtual Teams” (September 2010), South China Morning Post “Eight-Scale Tool for Mapping Cultural Differences” (May 2014) and The Jakarta Post “When to Speak Up, When to Shut Up” (April 2014). She has been interviewed by Fareed Zakaria on CNN and by Scarlet Fu on Bloomberg Surveillance. Her case, “Leading Across Cultures at Michelin,” won the ECCH 2010 European case award for best human resources management case of the year.Find more media articles here: https://erinmeyer.com/resources/ ",
        "pdf_url": "http://erinmeyer.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Simone-Eva Redrupp",
        "title": "",
        "pic_url": "https://media-exp1.licdn.com/dms/image/C4E03AQF7knA1HIoCDg/profile-displayphoto-shrink_200_200/0/1516289114833?e=1617840000&v=beta&t=qd0T95ZV-VYhRsLMmZ43jP-TGzK-3Q64qoEG70WcrlQ",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philipp Meyer-Doyle",
        "title": "Associate Professor of Strategy",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9843",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/philipp-meyerdoyle",
        "intro_desc": "Philipp Meyer-Doyle is an Associate Professor of Strategy at INSEAD. He obtained a PhD and a Master of Science degree at the Wharton School of the University of Pennsylvania, and a BSc at the London School of Economics. He directs INSEAD’s open enrolment executive program on M&As and Corporate Strategy.His research explores the micro-foundations of strategy and capabilities. His research has been published in premier journals such as the Strategic Management Journal or Organization Science. He has won awards for his research from leading academic management and strategy associations. He is a member of the Editorial Board of the Strategic Management Journal.Philipp is an award-winning teacher at INSEAD. He teaches in INSEAD’s executive education programs, the EMBA program, the MBA program and the PhD program. His teaching focuses on corporate strategy, mergers and acquisitions, strategic alliances, and strategic management. His teaching fuses academic insights with practical knowledge.Before becoming an academic, Philipp worked in investment banking (M&A advisory) and private equity.",
        "pdf_url": "http://faculty.insead.edu/philipp-meyer-doyle",
        "university_school": "8888_EUR"
    },
    {
        "name": "Laurence Capron",
        "title": "Dean of FacultyProfessor of Strategy",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3366",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/laurence-capron",
        "intro_desc": "Laurence Capron is a Professor of Strategy at INSEAD where she holds the Paul Desmarais Chair in Partnership and Active Ownership and the The Sauvage Family Endowed Chair for Academic Excellence, and she is Dean of Faculty. She is a leading expert on M&As, Alliances, and Business Portfolio Growth. She recently published a book Build, Borrow, or Buy: Solving the Growth Dilemma (Harvard Business Review Press), co-authored with Professor W. Mitchell, which examines how companies should select and balance their different modes of growth: organic growth (build), licensing and alliances (borrow), and M&As (buy). Her book is the recipient of the 2013 Best International Book Awards, granted by the USA Book News. So far, it has been translated into French, Portuguese and Chinese languages.Professor Capron received multiple awards for her teaching and research activities, including INSEAD MBA Best Teacher Award, Academy of Management Best Paper Award, McKinsey/Strategic Management Society Best Paper Award, HEC Paris Best Doctoral Dissertation Award and Syntec Federation Award for Best Research in Management. Her research has been profiled in a wide range of media including Financial Times, The Globe & Mail, Le Monde, Les Echos, The Economist, The Independent, Sunday Times, Business+strategy, Business Insider, Forbes, France 24, CFO Magazine, Irish Times, The National, The Austrailian, Engineering & Technology, Business Traveller, Economia, The Hindu, Business Standard, The Jakarta Post, Chief Executive, [email protected], South China Morning Post… Professor Capron joined INSEAD in 1997 after serving on faculty and earning her PhD in Corporate Strategy from HEC Paris. She was a visiting professor at MIT Sloan (2011-12), Wharton (2005-06), Kellogg School of Management (2004-05). She directed the INSEAD-Wharton Alliance from 2007 to 2010. She is on the editorial board of Strategic Management Journal and Strategy & Leadership as well as Senior Editor of Strategy Science.",
        "pdf_url": "http://faculty.insead.edu/laurence-capron",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Douglas Rosefsky",
        "title": "Adjunct Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3327",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/douglas-rosefsky",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Douglas Rosefsky",
        "title": "Adjunct Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3327",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/douglas-rosefsky",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Mark Lee Hunter",
        "title": "Adjunct Professor at the INSEAD Social Innovation Centre",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/Mark_Hunter.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Bart De Roover",
        "title": "Adjunct Professor",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10687",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/bart-de-roover",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Andrew V. Shipilov",
        "title": "Professor of StrategyJohn H Loudon Chair of International Management at INSEAD",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9992",
        "faculty_sub_url": "https://sloanreview.mit.edu/article/building-the-right-ecosystem-for-innovation/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Urs Peyer",
        "title": "Associate Professor of FinanceDean of Degree Programmes",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3462",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/urs-peyer",
        "intro_desc": "Urs Peyer is the Dean of Master Programmes and an Associate Professor of Finance at INSEAD. He holds a PhD in Finance from the Kenan-Flagler Business School, University of North Carolina, and a Lic.rer.pol. from the University of Berne, Switzerland.Urs Peyer’s research interests focus on corporate governance, executive compensation, empirical corporate finance, and share repurchases. He has published his research in the top finance and managerial journals. Recent publications include The Best-Performing CEOs in the World (Harvard Business Review), Lucky CEOs and Lucky Directors (Journal of Finance), The CEOs Pay Slice (Journal of Financial Economics), and The Nature and Persistence of Buyback Anomalies (Review of Financial Studies).Urs Peyer is teaching in INSEAD’s MBA, PhD and Executive Education programmes. He teaches the Corporate Governance MBA and PhD courses and has directed both customised and open-enrolment programmes. Urs was a visiting faculty at the University of Chicago and at UNC’s Kenan-Flagler Business School. Previously, he has worked in the portfolio management team for a subsidiary of Credit Suisse and was a jet pilot in the Swiss Airforce.",
        "pdf_url": "http://faculty.insead.edu/urs-peyer",
        "university_school": "8888_EUR"
    },
    {
        "name": "Theo Vermaelen",
        "title": "Professor of FinanceThe UBS Chair in Investment Banking, endowed in memoriam Henry Grunfeld",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3500",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/theo-vermaelen",
        "intro_desc": "Theo Vermaelen is a Professor of Finance, the UBS Chair in Investment Banking, endowed in honour of Henry Grunfeld, and and the chair of the Finance Area at INSEAD. He teaches in the MBA, PhD and Executive Education programmes and is an Academic Director of the Advanced International Corporate Finance programme. He is a graduate from the Department of Applied Economics at the Catholic University of Leuven (Commercial Engineer) and obtained his MBA and PhD in Finance from the Graduate School of Business, University of Chicago.Professor Vermaelen has taught at the University of British Columbia, the Catholic University of Leuven, the London Business School, UCLA and the University of Chicago. He has published articles on corporate finance and investments in leading academic journals including the Journal of Finance, the Journal of Financial Economics, and the Journal of Banking and Finance. He serves as a co-editor of the Journal of Empirical Finance, an associate editor of the Journal of Corporate Finance and the European Financial Review, and an advisory editor of Teaching and Case Abstracts. Professor Vermaelen is a consultant to various corporations and government agencies and a Programme Director of the Amsterdam Institute of Finance.",
        "pdf_url": "http://faculty.insead.edu/theo-vermaelen",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lily Hua Fang",
        "title": "Professor of FinanceThe AXA Chaired Professor in Financial Market Risk",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3391",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/lily-hua-fang",
        "intro_desc": "Lily Fang is a Professor of Finance at INSEAD and the holder of the AXA Chair in Financial Market Risk. Professor Fang joined INSEAD in 2003. She is currently based in the European campus, after having spent twelve years in the Asian campus.Professor Fang’s primary research interest is financial market information and investment strategies. She has published numerous papers on the performance, behavior, and incentives of financial analysts, fund managers, and financial institutions in top academic journals such as the Journal of Finance, the Journal of Financial Economics, and the Review of Financial Studies. Her work on the relation between media coverage and stock returns received the prestigious Smith Breeden prize for outstanding papers published in the Journal of Finance. Professor Fang has advised a number of large institutional investors on investment strategies.At INSEAD Professor Fang teaches corporate finance, capital markets, valuation, private equity, venture capital and entrepreneurial finance in the MBA, EMBA, and Executive Education programmes. She has won the Dean's Commendation Award for Excellence in MBA Teaching numerous times and has taught and directed numerous Executive Education programmes. Professor Fang has also been a Visiting Professor of Finance at the MIT Sloan School of Management where she won the Outstanding Teacher Award.Professor Fang obtained her PhD in Finance from the Wharton School, University of Pennsylvania. Prior to that, she studied mathematics, actuarial science and management science at Simon Fraser University in Vancouver. ",
        "pdf_url": " http://faculty.insead.edu/lily-fang",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Pierre Hillion",
        "title": "Professor of FinanceThe de Picciotto Chaired Professor of Alternative Investments",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/aicf/images/faculty-Pierre-Hillion.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/pierre-hillion",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Theo Vermaelen",
        "title": "Professor of FinanceThe UBS Chaired Professor of Investment Banking, endowed in memoriam Henry Grunfeld",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3500",
        "faculty_sub_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3500",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Pierre Hillion",
        "title": "Professor of Finance",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/aam/images/faculty-Pierre-Hillion.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/pierre-hillion",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/idp/images/Enrico_Diecidue.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jean Dermine",
        "title": "Professor of Banking and Finance",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/rmb/images/Jean_Dermine.jpg",
        "faculty_sub_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/rmb/articles/Jean_Dermine_book.pdf",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philip Anderson",
        "title": "Professor of EntrepreneurshipThe INSEAD Alumni Fund Chaired Professor of EntrepreneurshipAcademic Director of the Rudolf and Valerie Maag INSEAD Centre for Entrepreneurship (ICE)",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=7063",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/philip-anderson",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Associate Professor of Decision Sciences",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3383",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "Antonio Fatas",
        "title": "Professor of EconomicsThe Portuguese Council Chaired Professor of European StudiesChair, Economics and Political Science Area",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3522",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/antonio-fatas",
        "intro_desc": "Antonio Fatás is a Professor of Economics at INSEAD. He received his PhD in Economics from Harvard University. He is a Research Fellow at the Centre for Economic and Policy Research in London and has worked as an external consultant for international organisations such as the International Monetary Fund, the OECD and the World Bank. He teaches the macroeconomics core course in the MBA programme, as well as different modules on the global macroeconomic environment in the Executive Education. His research focuses on the study of business cycles, fiscal policy and the economics of European integration. His articles appear in academic journals such as the Quarterly Journal of Economics, Journal of Monetary Economics, Journal of Money, Credit and Banking, Journal of Public Economics, Journal of International Economics, Journal of Economic Growth, European Economic Review and Economic Policy.",
        "pdf_url": "http://faculty.insead.edu/fatas",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ilian Mihov",
        "title": "Dean of INSEADProfessor of EconomicsThe Novartis Chaired Professor of Management and Environment",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3670",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ilian-mihov",
        "intro_desc": "Professor Ilian Mihov was appointed Dean of INSEAD on 1 October 2013. He is concurrently the Rausing Chaired Professor of Economic and Business Transformation. His expertise is in macroeconomics with a focus on monetary policy, fiscal policy and economic growth. He is a fellow at the Center for Economic Policy Research and vice president of the Asian Bureau of Finance and Economic Research. Currently he is a board member of the Singapore Economic Development Board (EDB), the Association to Advance Collegiate Schools of Business (AACSB), Singapore American School (SAS) and other advisory boards. He was a member of the scientific committee of the Banque de France’s Research Foundation, the advisory board of the Bulgarian National Bank, and the World Economic Forum’s Global Agenda Council on Fiscal Crises. He holds a PhD from Princeton University and a BSc in business administration from the Moore School of Business at the University of South Carolina where, in 2006, he was recognised as a Distinguished Young Alumnus. At INSEAD he has been recognized several times with the Outstanding Teacher Award. In 2018 he won the UN Women (Singapore Chapter) HeForShe Leader Award for his outstanding service and contributions towards gender equality at INSEAD. ",
        "pdf_url": "http://faculty.insead.edu/ilian-mihov",
        "university_school": "8888_EUR"
    },
    {
        "name": "Subramanian Rangan",
        "title": "Professor of Strategy and ManagementThe Abu Dhabi Crown Prince Court Endowed Chair in Societal Progress",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/subramanian-rangan.jpg",
        "faculty_sub_url": "http://www.societyforprogress.org",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Narayan Pant",
        "title": "Professor of Management PracticeRaoul de Vitry d'Avaucourt Chair in Leadership Development",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/amp/images/Narayan_Pant.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/narayan-pant",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Elisabet Engellau",
        "title": "Adjunct Clinical Professor of Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3312",
        "faculty_sub_url": "https://www.insead.edu/node/6889",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Manfred F. R. Kets De Vries",
        "title": "Distinguished Clinical Professor of Leadership Development and Organisational ChangeThe Raoul de Vitry d'Avaucourt Chaired Professor of Leadership Development, Emeritus",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3422",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/manfred-f-r-kets-de-vries",
        "intro_desc": "Manfred F. R. Kets de Vries is the Distinguished Clinical Professor of Leadership Development and Organisational Change and the Raoul de Vitry d'Avaucourt Chaired Professor of Leadership Development, Emeritus, at INSEAD. He brings a different view to the much-studied subjects of leadership and the dynamics of individual and organisational change. Bringing to bear his knowledge and experience of economics (EconDrs, University of Amsterdam), management (ITP, MBA, and DBA, Harvard Business School), and psychoanalysis (Canadian Psychoanalytic Society and the International Psychoanalytic Association), he scrutinises the interface between international management, psychoanalysis, psychotherapy, and dynamic psychiatry. His specific areas of interest are leadership, career dynamics, executive stress, entrepreneurship, family business, succession planning, cross-cultural management, team building, coaching, and the dynamics of corporate transformation and change. Manfred F. R. Kets de Vries directs The Challenge of Leadership Executive Education programme.A clinical professor of leadership and organisational change, he held the Raoul de Vitry d'Avaucourt Chair of Leadership Development at INSEAD from September 1992 to March 2013. He is the founder of the INSEAD Global Leadership Centre, the programme director of INSEAD's top management seminar The Challenge of Leadership, and the scientific director of the INSEAD Executive Master in Consulting and Coaching for Change. He has received the INSEAD Distinguished Teacher Award five times. He has held professorships at McGill University, the Ecole des Hautes Etudes Commerciales, Montreal, and the Harvard Business School, and has lectured at management institutions around the world. Financial Times, Le Capital, Wirtschaftswoche, and The Economist rated Manfred Kets de Vries as one of the world's top fifty leading management thinkers, as well as one of the most influential contributors to human resource management. In 2008, he received the Lifetime Achievement Award from the International Leadership Association (the Leadership Legacy Project), being viewed as one of the world’s six founding professionals in the development of leadership as a field and discipline.He is the author, co-author or editor of forty-nine books and has published over 400 papers as articles or chapters in books. His books and articles were translated into thirty-one languages. He is a member of seventeen editorial boards. He has been elected a Fellow of the Academy of Management. In 2011, he was awarded the Doctor Honoris Causa title by the IEDC-Bled School in recognition of his contributions to leadership development and research. In 2001, he received the Harry and Miriam Levinson Award (Organizational Consultation division) from the American Psychological Association for his contributions to the field of consultation. He is a founding member of the International Society for the Psychoanalytic Study of Organizations (ISPSO), and in 2009 he became its Lifetime Distinguished Member. Kets de Vries is also the first non-American recipient of the International Leadership Award from the International Leadership Association (ILA) for “his contributions to the classroom and the boardroom”. In 2010, he received the Freud Memorial Award from the Dutch Psychoanalytic Institute in acknowledgement of his exceptional work on the interface between psychoanalysis and organisations.Kets de Vries is a consultant on organisational design/transformation and strategic human resource management to leading US, Canadian, European, African, and Asian companies. As an educator and consultant, he has worked in more than forty countries.He was awarded an Officer in the Order of Oranje Nassau by the Dutch government. He was the first fly fisherman in Outer Mongolia and is a member of New York's Explorers Club. In his spare time, he can be found in the rainforests or savannas of Central and Southern Africa, the Siberian taiga, the Ussuri Krai, Kamchatka, the Pamir and Altai Mountains, Arnhemland, or within the Arctic Circle.",
        "pdf_url": "javascript:;",
        "university_school": "8888_EUR"
    },
    {
        "name": "J. Stewart Black",
        "title": "Professor of Management Practice in Global Leadership and Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/stewart-black.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/stewart-black",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jose-Luis Alvarez",
        "title": "Senior Affiliate Professor of Leadership and Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lfr/jose_luis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Albert A. Angehrn",
        "title": "Professor of Information Technology",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3349",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/albert-a-angehrn",
        "intro_desc": "Albert Angehrn is a Professor of Information Technology at INSEAD. His research activities concentrate on the impact of information and communication technologies and networks on learning, change, and collaboration processes within and across organisations, and on the design of innovative solutions to management learning, including the design of advanced simulations, intelligent agents, and virtual learning spaces.His research work has received various international awards, and his publications may be found in academic journals, such as Communications of the ACM, Journal of Management Information Systems, European Management Journal, Interfaces, Interacting with Computers, Information Systems Management, Human Systems Management, Decision Support Systems, European Journal of Operations Research; and his articles are published in The Financial Times and The Wall Street Journal. He has also contributed to chapters of several books.Professor Angehrn has directed the INSEAD Executive Education programmes 'Competing in the Information Age' and 'Leadership in the Knowledge Society (LinKS)' and has offered MBA courses including 'Organisational Computing' and 'CyberEntrepreneurship', as well as workshops, such as 'Are European managers ready for leadership in the Information Society' for The European Round Table of Industrialists (ERT) and an international executive workshop 'Value Creation with Communities of Practice (CoP Workshop)'. He is currently active in presenting his latest research via INSEAD Online.In the frame of INSEAD's Centre for Advanced Learning Technologies (CALT), Professor Angehrn has designed a variety of multimedia and internet-based management learning and development tools through the CALT portfolio of projects, including the EIS Simulation, which is adopted by schools such as Stanford, MIT, Duke or Columbia University, and the LingHe Simulation, which allows managers to experience the challenge of interacting and driving change within a Chinese organisation.Professor Angehrn explores new effective ways to model and improve learning, change, and collaboration processes at the individual, group, organisational, inter-organisational, and community levels. His research projects have been sponsored by European Community Research Funds and the European Space Agency. His academic and industry partners for these projects have included IKEA from Sweden, IBM and HP from the United States, Pfizer, SAP and BMW from Germany, the FIAT Group and Unicredit from Italy, French Eutelsat, the Scottish Government, the Danish Finance Ministry, and the Swedish Trade Council.'",
        "pdf_url": " https://sites.insead.edu/facultyresearch/personal/aangehrn/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Mansour Javidan",
        "title": "Garvin Distinguished Professor and Director of Najafi Global Mindset Institute at Thunderbird School of Global Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/labc/images/Mansour_Javidan_130x130.jpg",
        "faculty_sub_url": "https://thunderbird.asu.edu/mansour-javidan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Paul Saunders",
        "title": "Adjunct Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/labc/images/Paul_Saunders_130x130.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Erin Meyer",
        "title": "Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/msib/images/ErinMeyer.JPG",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/erin-meyer",
        "intro_desc": "Erin Meyer is Senior Affiliate Professor in the Organisational Behaviour Department at INSEAD and specialises in the field of cross-cultural management, organisational culture, intercultural negotiations, and multi-Cultural leadership. Erin is the Programme Director for Leading Across Borders and Cultures. She is the author of the best-selling book The Culture Map: Breaking Through the Invisible Boundaries of Global Business. She is also the co-author, with Netflix CEO Reed Hastings, of the New York Times best-seller and FT short-listed best business book of 2020 No Rules Rules: Netflix and the Culture of Reinvention. Erin’s work focuses on how the world’s most successful leaders navigate the complexities of cultural differences in a global environment. In 2019 Erin was selected by the Thinkers50 as one of the world’s 50 most influential business thinkers.Living and working in Africa, Europe, and the United States prompted Erin Meyer’s study of the communication patterns and business systems of different parts of the world. Her culture mapping framework allows international executives to pinpoint their leadership preferences and compare their methods to the management styles of other cultures. Erin has taught thousands of executives from 5 continents to decode cross-cultural complexities impacting their work, and to lead more effectively across these differences.Erin has published articles in Harvard Business Review magazine: “Being the Boss in Brussels, Boston, and Beijing (July 2017), Getting to Si, Ja Oui, Hai and Da (December 2015), When Culture Doesn’t Translate (October 2015,) Navigating the Cultural Minefield (May 2014), and Debunking China Myths (January 2010). Her work has been published in the New York Times Sunday paper “Looking Another Culture in the Eye” (September 2014), the Times of India “A Business-Man’s Guide to Manners” (September 2014), Forbes.Com “The Four Keys to Success with Virtual Teams” (September 2010), South China Morning Post “Eight-Scale Tool for Mapping Cultural Differences” (May 2014) and The Jakarta Post “When to Speak Up, When to Shut Up” (April 2014). She has been interviewed by Fareed Zakaria on CNN and by Scarlet Fu on Bloomberg Surveillance. Her case, “Leading Across Cultures at Michelin,” won the ECCH 2010 European case award for best human resources management case of the year.Find more media articles here: https://erinmeyer.com/resources/ ",
        "pdf_url": "http://erinmeyer.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jennifer Petriglieri",
        "title": "Associate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/map/images/Jennifer_Petriglieri.jpg",
        "faculty_sub_url": "https://www.insead.edu/executive-education/interviews/leadership/closing-the-gender-leadership-gap",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "José Luis Alvarez",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10034",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Noah Askin",
        "title": "Assistant Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/fr/images/Askin_2014.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/noah-askin",
        "intro_desc": "Noah Askin is an Assistant Professor of Organisational Behaviour at INSEAD, where he teaches the organisational design and leadership core course in the MBA program. His teaching focuses primarily on firms’ organisational-strategic alignment, leading and experiencing organisational change, managing corporate culture, and utilizing social networks.Noah is interested in social and cultural networks, the antecedents and consequences of creativity and innovation, the production and consumption of culture, and the dynamics of organisational and individual status. His current research is divided among these interests in two streams. The first is around the creation and performance of cultural products: music chart and industry dynamics, what factors contribute to creativity, the tradeoffs associated with being innovative, the implications of the shift to digital distribution, and the analysis of culture using big data. The second area of research is around the role and impact of network- and rankings-based status on organisations. His work, which has garnered him recognition on the Thinkers 50 Radar list, has appeared in Administrative Science Quarterly, computational social science publications, and been covered in Forbes, Quartz.com, The Times of London, and music industry blogs. Prior to becoming a business school academic, Noah had a number of roles in the business and not-for-profit sectors. He was a management consultant for the Monitor Group, working in its strategy practice and its Executive Development group. This was followed by several years as an early member of a start-up in the educational services space. Noah received a joint PhD from the University of Chicago’s Booth School of Business and its Sociology department. He also has an MA in Sociology from the University of Chicago and an MBA from Booth, as well as an AB in Psychology from Harvard University. ",
        "pdf_url": "http://noahaskin.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "José Luis Alvarez",
        "title": "Senior Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10034",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Martin Gargiulo",
        "title": "Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/hilp/martin_gargiulo.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/martin-gargiulo",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Vibha Gaba",
        "title": "Associate Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lld/images/vibha_gaba.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/vibha-gaba",
        "intro_desc": "Vibha Gaba is a Professor of Entrepreneurship at INSEAD and The INSEAD Fellow in Memory of Erin Anderson. She is broadly interested in how organizations learn and how it impacts their ability to innovate and adapt, especially in discontinuous environments. Her more recent research focuses on the implications of multiple goals and aspirations, organizational structure, and decision-makers' attributes on adaptive change. Her work has been published in leading management journals such as the Academy of Management Journal, Academy of Management Annals, Organization Science, Strategic Management Journal, Management Science, Strategic Entrepreneurship Journal, and Journal of International Business Studies. She is currently serving her second term as the Associate Editor of the Strategic Management Journal, a top-tier management journal. At INSEAD, Vibha teaches modules on Corporate Entrepreneurship, Organizational Change, and Leadership in various Executive Education programs, including Adidas, Alstom, Astra Zeneca, Bank Mandiri, Cartier, COFRA, EDF, Expedia, Heineken, Hewlett Packard, IBM, Indian Railways, KPMG, Larsen & Toubro, McKinsey, Mitsubishi, Permata Bank, Pertamina, Petronas, Randstad, RHB, Roche Diagnostics, Shell, Star Energy, Sumitomo Chemical, Swire, UNICEF, and World Medical Association. She is also the Academic Program Director for three open enrolment programs - Corporate Venturing & Innovation, Leading Successful Change, and Learning to Lead, for senior and junior executives. She has received the INSEAD Executive Education Award for Outstanding Teaching and Program Direction multiple times. She has also taught MBA core Organizational Behavior course and an MBA elective on Leadership and Change. Her teaching portfolio also includes Ph.D. courses on Organization Theory and Corporate Entrepreneurship.Vibha holds a Ph.D. in Management from the Lundquist College of Business, University of Oregon, USA, a Masters in Sociology from the Delhi School of Economics, and a Bachelor's degree in Economics from Delhi University, India.Vibha has lived in three continents – North America, Europe, and Asia. Currently, she resides in Singapore but teaches on both INSEAD campuses (France and Singapore).",
        "pdf_url": "http://faculty.insead.edu/vibha-gaba",
        "university_school": "8888_EUR"
    },
    {
        "name": "Martin Gargiulo",
        "title": "Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lsc/martin_gargiulo.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/martin-gargiulo",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Vibha Gaba",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lsc/vibha_gaba.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/vibha-gaba",
        "intro_desc": "Vibha Gaba is a Professor of Entrepreneurship at INSEAD and The INSEAD Fellow in Memory of Erin Anderson. She is broadly interested in how organizations learn and how it impacts their ability to innovate and adapt, especially in discontinuous environments. Her more recent research focuses on the implications of multiple goals and aspirations, organizational structure, and decision-makers' attributes on adaptive change. Her work has been published in leading management journals such as the Academy of Management Journal, Academy of Management Annals, Organization Science, Strategic Management Journal, Management Science, Strategic Entrepreneurship Journal, and Journal of International Business Studies. She is currently serving her second term as the Associate Editor of the Strategic Management Journal, a top-tier management journal. At INSEAD, Vibha teaches modules on Corporate Entrepreneurship, Organizational Change, and Leadership in various Executive Education programs, including Adidas, Alstom, Astra Zeneca, Bank Mandiri, Cartier, COFRA, EDF, Expedia, Heineken, Hewlett Packard, IBM, Indian Railways, KPMG, Larsen & Toubro, McKinsey, Mitsubishi, Permata Bank, Pertamina, Petronas, Randstad, RHB, Roche Diagnostics, Shell, Star Energy, Sumitomo Chemical, Swire, UNICEF, and World Medical Association. She is also the Academic Program Director for three open enrolment programs - Corporate Venturing & Innovation, Leading Successful Change, and Learning to Lead, for senior and junior executives. She has received the INSEAD Executive Education Award for Outstanding Teaching and Program Direction multiple times. She has also taught MBA core Organizational Behavior course and an MBA elective on Leadership and Change. Her teaching portfolio also includes Ph.D. courses on Organization Theory and Corporate Entrepreneurship.Vibha holds a Ph.D. in Management from the Lundquist College of Business, University of Oregon, USA, a Masters in Sociology from the Delhi School of Economics, and a Bachelor's degree in Economics from Delhi University, India.Vibha has lived in three continents – North America, Europe, and Asia. Currently, she resides in Singapore but teaches on both INSEAD campuses (France and Singapore).",
        "pdf_url": "http://faculty.insead.edu/vibha-gaba",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/enrico-diecidue.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "Derek Deasy",
        "title": "Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ICC/derek_deasy_300x300_V2.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/derek-deasy",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Derek Deasy",
        "title": "Affiliate Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ICC/derek_deasy_300x300_V2.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/derek-deasy",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Subramanian Rangan",
        "title": "Professor of Strategy and ManagementThe Abu Dhabi Crown Prince Court Endowed Chair in Societal Progress",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/subramanian-rangan.jpg",
        "faculty_sub_url": "http://www.societyforprogress.org",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Filip Hron",
        "title": "Adjunct Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/nd/images/Filip_Hron.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/filip-hron",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Horacio Falcao",
        "title": "Senior Affiliate Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/horacio-falcao.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/horacio-falcao",
        "intro_desc": "Horacio Falcão is a Professor of Management Practice at INSEAD, where he teaches and researches on Negotiation Sciences, while also directing the  INSEAD executive education Negotiation Dynamics programme. He is the creator of the Value Negotiation system: a strategic and flexible approach to negotiation designed to maximize rewards at minimum risk in an international and complex world. He is also the founding partner of two companies: Value Negotiation Co. (VN), an advisory company to support organizations in their complex negotiations; and VN Tech, a negotiation-support software company. In 2010, Horacio published his book: Value Negotiation: How to Finally Get the Win-Win Right.Previously, Horacio worked at Cambridge Negotiation Strategies and CMI International Group (a spin-off from the Harvard Negotiation Project) and, before that, at two prestigious law firms in Brazil. He founded and was the first Vice President of the Harvard Latin America Law Society. He has worked for the International Court of Arbitration in Paris, and as a Harvard-trained mediator, he has mediated cases at the courts of Massachusetts. A lawyer trained in both civil and common law systems, Horacio graduated as an LL.M. from Harvard Law School with a concentration on alternative dispute resolution in 1997. He has an MBA (2002) and an Executive Masters in Organizational Psychology (2010) at INSEAD. In 2019, he earned his Ph.D. at Singapore Management University.For the past 20 years, Horacio has been teaching INSEAD clients and assisting Value Negotiation Co. & VN Tech clients in several different industries. His diverse list of clients includes: Aberdeen Asset Mgt, Abraaj Capital, Adidas, Aditya Birla Financial Group, Alianza Hispana, ALSTOM, AOL, Arcelor, Astellas, ATKearney, BHP Billiton, Biogen Idec, BMC Software, BP-Aral, Bristol Myers Squibb, BTG Pactual, BW Maritime, Cathay Pacific, CB Richard Ellis, Coats Viyella, Confederação Nacional de Indústrias, Credit Suisse, Danske commodities, DBS, Discovery Networks, DJOEF, DKSH, Dong Energy/Orsted, Dubai School of Gov’t, DuPont, FAS-PwC, Ford, Gemalto, GlobalFoundries, Goldman Sachs, Google, Henkel, Hewlett Packard, IBM, Incyte, Infineon, Inter-American Development Bank, JP Morgan, LLoyds TSB Group, Labein-Tecnalia, London School of Economics, MacQuarie Bank, Maersk Oil, Mastercard, MBK Partners, Merial, Microsoft, Mubadala, Nescaum, Netflix, Nokia Siemens Network, Novartis, OC&C partners, OCBC, Open Society Foundation, Oxfam, Pacific Basin, Pepsico, Permira, Pernod-Ricard, Pertamina, Petronas, Pikasso, PwC, Sabanci University, Samarco, SAP, Search for Common Ground, Schlumberger, Shell, Singtel-Optus, SK Holdings, Société Générale, ST College, Starwood, STATS, Swire, Syngenta, Temasek Group, The Bhutanese Royal Institute for Governance and Social Studies, The Crown Prince Court at Abu Dhabi, The Gov’t of Paraguay, The Gov’t of Thailand, The President of Costa Rica, The President of Ecuador, Toshiba, TNK-BP, UDV, UNDP, UOB, Valeo, Van Lanschot, Visa, World Medical Association, YPO (Saudi and Singapore chapters), besides other confidential clients.Before INSEAD, Horacio taught negotiation at the Program of Instruction for Lawyers (PIL) at Harvard Law School and mediation at the Fletcher School of Law and Diplomacy, Tufts University and the Harvard Mediation Program. He is an active angel investor and advisor to a variety of start-ups around the world.He has lived in Brazil, US, France, Singapore, and Switzerland, and worked in projects in over 30 other countries. He was based at INSEAD Singapore for more than 16 years and transferred to the Abu Dhabi campus in mid-2019. Since the beginning of his tenure at INSEAD, Horacio received the following awards:• Best MBA Elective Professor in 2004, ’05, ’06, ’08, ’09, ’12, ’13, ’14, ’15, ’16, ’17, ’18, ‘19 (INSEAD)• Best EMBA Elective Professor in 2005 (INSEAD)• Best TIEMBA Elective Professor in 2008 (Tsinghua University, Beijing, China).",
        "pdf_url": "http://www.valuenegotiation.com",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van der Heyden",
        "title": "Professor of Technology and Operations ManagementThe Mubadala Chaired Professor in Corporate Governance and StrategyAcademic Director, INSEAD Corporate Governance Centre",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/uae/faculty-ludo-Van-der-Heyden.jpg",
        "faculty_sub_url": "https://www.insead.edu/node/7069",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Michael Jarrett",
        "title": "Professor of Management Practice in Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=6748",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/michael-jarrett",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Quy Huy",
        "title": "Professor of Strategy",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10792",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/quy-huy",
        "intro_desc": "Dr. Quy Nguyen Huy is a professor of strategy at INSEAD since 1998. He is known as a pioneering world scholar in linking social-emotional factors to the performance of strategic change and organizational innovation. Dr. Huy’s research on strategic change, strategy execution, and organizational innovation has won ten international awards and was published in prestigious scholarly and practice journals such as Administrative Science Quarterly, the Academy of Management Journal, Academy of Management Review, Harvard Business Review, MIT Sloan Management Review, Organization Science, and Strategic Management Journal. Dr. Huy’s research on middle managers was published in and selected by Harvard Business Review as “Breakthrough Ideas for Today's Business Agenda.\"  Dr Huy’s pioneering research on how collective emotions and emotional capital enhance organizational innovation and strategy execution has been applied by numerous organizations worldwide, both in the private and nonprivate sectors. Dr. Huy has done executive development, teaching, consulting or coaching for a wide range of profit and non-profit organizations worldwide, including Aerospatiale Matra, Alcan, the Aga Khan Foundation, Alcan, Alstom, Arcelor Mittal, Astra Zeneca, Bell Canada Enterprises, British Telecom, Electricité et Gaz de France, Fiat, Fujitsu, Google, Hewlett Packard, IBM, HIV Aids Alliance, Intesalat, the International Federation of Red Cross Red Crescent, LG Electronics, Lufthansa, Marconi, Matsushita, Motorola, Petrobras, the Royal Bank of Canada, Sasken, Standard Chartered Bank, Sicredi, Siemens, United Arab Emirates Civil Service, and Via Rail Canada.  Huy was originally trained as an electrical engineer then in corporate finance. He worked for 16 years in various managerial functions with several large information technology firms in North America. His managerial career covered systems and software engineering; sales and marketing of digital platforms; and corporate finance, where he dealt with institutional investors and credit rating agencies and worked on joint ventures, mergers and acquisitions, and turnarounds of firms with turnover up to 10 billion dollars. Huy is also a Chartered Financial Analyst (CFA). He specialized in the determination of cost of capital, analysis of very large capital projects, capital structure and debt financing, and valuation of business ventures and risks. ",
        "pdf_url": "http://faculty.insead.edu/quy-huy",
        "university_school": "8888_EUR"
    },
    {
        "name": "Catherine S.M. Duggan",
        "title": "Professor of Management and Political EconomyVice Dean for Strategy and ResearchAfrican Leadership University (ALU), Rwanda",
        "pic_url": "http://4dpq382gj4bpkt9v0310966g-wpengine.netdna-ssl.com/wp-content/uploads/2016/05/Catherine-Duggan-Circle-Crop-509x.png",
        "faculty_sub_url": "https://www.alusb.com/catherine-duggan/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Loic Sadoulet",
        "title": "Affiliate Professor of Economics",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3475",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/loic-sadoulet",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Declan Fitzsimons",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ELDA/declan.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/declan-fitzsimons",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Mark Mortensen",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/mark-mortensen.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/mark-mortensen",
        "intro_desc": "Mark Mortensen is an Associate Professor of Organisational Behaviour at INSEAD. Mark Mortensen is co-directing Emerging Leaders in a Digital Age.His area of expertise is organisational collaboration, with an emphasis on two increasingly prevalent ways of organisng that do not fit traditional models of team dynamics: globally distributed (virtual) and project-based work. In his research, he has investigated the nature of conflict in distributed collaborations and its relationship to identity, context, and communication; the impact of dispersion structure – in the form of balance, imbalance, and isolation – on collaboration dynamics; and the effects of first-hand experience – gained through site visits and expatriate assignments – on trust. He has also explored the interpersonal effects of working in multiple, partially-overlapping, fluidly-shifting projects, developing a fundamentally new model of collaboration. Professor Mortensen's research has been recognised by the academic community through awards including the William H. Newman Award, Organisational Behaviour Division Best Dissertation-Based Paper Award, and Runner-up OCIS Division Best Paper Award from the Academy of Management; and the Best Paper Award Finalist nomination by the Interdisciplinary Network of Groups Researchers. His research has been published in top peer-reviewed academic journals including the Organization Science, Management Science, Academy of Management Review, Journal of Organizational Behavior, and International Journal of Conflict Management. His works has been featured in multiple edited volumes, practitioner journals such as the MIT-Sloan Management Review, Harvard Business Review Online, and IESE Insight; and in media outlets including the Economist, The Boston Globe, and The Globe and Mail.Professor Mortensen teaches the Organisational Behaviour core course in the INSEAD MBA programme. He directs the Global Leadership Programme for DNV GL and teaches modules on Team Dynamics and Virtual Teams; Power, Networks, and Influence; and Organisational Change. He has taught in open Executive Education programmes including Consulting and Coaching for Change, Managing Global Virtual Teams, Manufacturing in a Global Network, and Strategic R&D Management, as well as in the customised programmes for Associated British Foods, Astellas Pharmaceuticals, Bayer / Bayer Crop Science, HCL, KONE, Lundbeck A/S, Ma’aden, Maersk Oil, Manulife Financial, Merck KGaA, MetInvest Holdings, Oliver Wyman, pwc, Takeda Pharmaceuticals, United Technologies, and the World Economic Forum. Professor Mortensen consults widely on issues of team dynamics, global collaboration, power and social networks, and organisational change. He has worked with companies such as First Solar, Generalized Reinsurance, Goldman Sachs/Pine Street, Maersk Oil, and Merck KGaA.Prior to joining INSEAD, Professor Mortensen was on the faculty of the MIT-Sloan School of Management, and before that, the Desautels School of Management at McGill University. Professor Mortensen holds a PhD in Management Science and Engineering from Stanford University, and an MS from Stanford University and a BA from Colby College, both in Computer Science.",
        "pdf_url": "http://faculty.insead.edu/mark-mortensen",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ian Woodward",
        "title": "Professor of Management Practice",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3507",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ian-c-woodward",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Charles Galunic",
        "title": "Professor of Organisational BehaviourThe Aviva Chaired Professor of Leadership and Responsibility",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3396",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/charles-galunic",
        "intro_desc": "Charles Galunic is a Professor of Organisational Behaviour and the Aviva Chaired Professor of Leadership and Responsibility at INSEAD. He works within the fields of organisation behaviour and strategy. His research explores the social fabric of innovation and change, and at multiple levels. At the individual level, he has studied the influence of social networks on a manager’s ability to innovate. At a corporate level, he has examined structural changes and the processes which help firms to adapt. The latter work is also focused on organisation culture, including its alignment with strategy, how it changes, and the role of leadership. Finally, he explores leadership transitions, that is how managers develop their leadership skills and identity. He has served on the editorial board of Strategic Organisation and the Strategic Management Journal, and is a former departmental editor of the Journal of International Business Studies. He has published in various academic and practitioner-oriented journals, including the Journal of Managerial and Decision Economics, Administrative Science Quarterly, Academy of Management Journal, Organisation Science, Strategic Management Journal, Harvard Business Review, and Research in Organisational Behaviour. Professor Galunic has been a pioneer of several courses at INSEAD, including the core MBA course on Managing Organisations. He has won best case study awards, including the 2007 ECCH Best Case Award (Organisational Behaviour/Human Resources area). He also teaches in a variety of INSEAD Executive Education programmes, both in Fontainebleau and in Asia, and was a programme director of the INSEAD's high potentials programme (Management Acceleration Programme). He was a nominee for the Best Core Teacher Award, EMBA in 2004, 2005, 2006, and received the 2004/2005 INSEAD Excellence Award in Executive Education.Professor Galunic holds a PhD in Organisational Behaviour/Industrial Engineering from Stanford University, California; a BA in Philosophy, Politics and Economics from Oxford University (Canadian Rhodes Scholar); and a BSc in Chemical Engineering from Queen's University, Canada.Charles Galunic directs the Executive Education Transition to General Management Programme and Leading Organisations in Disruptive Times.'",
        "pdf_url": "https://www.charlesgalunic.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "José Luis Alvarez",
        "title": "Senior Affiliate Professor of Leadership and Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lfr/jose_luis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joseluis-alvarez",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Sameer Hasija",
        "title": "Associate Professor of Technology and Operations ManagementThe Shell Fellow in Business and the EnvironmentChair, Technology and Operations Management",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9841",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/sameer-hasija",
        "intro_desc": "Sameer Hasija is a Professor of Technology and Operations Management at INSEAD. He earned his PhD in Operations Management and MS in Management Science Methods from the Simon School of Business at the University of Rochester and his BTech from the Indian Institute of Technology Madras. Sameer’s teaching focusses on using a process lens to understand new levers of innovation. Using a systematic analysis of processes within and across firm boundaries, he emphasises the role of process-based innovation in creating new business models and/or fresh competitive positioning for existing business models. Sameer conducts workshops for executives on understanding the latest developments in technology and their role in radically disrupting and/or transforming businesses. Sameer’s current research uses an economics lens to understand the design and management of technology, knowledge, and information intensive service systems. ",
        "pdf_url": "http://www.sameerhasija.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philip M. Parker",
        "title": "Professor of MarketingINSEAD Chaired Professor of Management Science",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3458",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/philip-m-parker",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ville Satopaa",
        "title": "",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=5805",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ville-satopaa",
        "intro_desc": "Ville Satopaa is an Assistant Professor of Technology and Operations Management at INSEAD. His current research explores different areas of forecasting: judgmental and statistical forecasting, modeling crowdsourced predictions, combining and evaluating different predictions, and information elicitation. It involves developing general theory and methodology but also specific projects that analyse real-world data. In addition to working on forecasting, Ville has experience in applying Bayesian statistics to rank hospitals in terms of disease-specific mortality rates. Before joining INSEAD, Ville received his MA/PhD degrees in Statistics from the Wharton School of the University of Pennsylvania. He also holds a BA in Mathematics and Computer Sciences from Williams College. ",
        "pdf_url": "http://faculty.insead.edu/ville-satopaa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Phanish Puranam",
        "title": "Professor of StrategyThe Roland Berger Chaired Professor of Strategy and Organisation Design",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9844",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/phanish-puranam",
        "intro_desc": "Phanish Puranam is a Professor of Strategy, the Roland Berger Chaired Professor of Strategy and Organisation Design at INSEAD. Phanish’s research in organizational science focuses on how organizations work, and how we can make them work better. His current interests include non-hierarchical organizations, the design of informal organization, and organizational architectures that support self-assembling teams. Besides publishing his research extensively in peer reviewed journals (see link to Personal Website above), Phanish has also written several books. “The Microstructure of Organizations” (Oxford University Press, 2018) offers researchers a new perspective on organization design. Phanish’s books for practitioners include \"Corporate Strategy: Tools for analysis and decisions\" (co-authored with Bart Vanneste, Cambridge University Press, 2016) which is used as a reference in MBA programs around the world. India Inside (co-authored with Nirmalya Kumar, Harvard Business Review Press, 2012) won critical acclaim for its balanced look at the prospect of India emerging as a global hub for innovation. Phanish obtained his PhD at the Wharton School of the University of Pennsylvania in 2001, and was on the faculty of London Business School till 2012. Reflecting his commitment to doctoral training, he has served as the Academic Director for the PhD Program at both London Business School and INSEAD.Phanish Puranam directs the AI for Business programme.",
        "pdf_url": "http://faculty.insead.edu/phanish-puranam",
        "university_school": "8888_EUR"
    },
    {
        "name": "Charles Galunic",
        "title": "Professor of Organisational BehaviourThe AVIVA Chaired Professor of Leadership and Responsibility",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3396",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/charles-galunic",
        "intro_desc": "Charles Galunic is a Professor of Organisational Behaviour and the Aviva Chaired Professor of Leadership and Responsibility at INSEAD. He works within the fields of organisation behaviour and strategy. His research explores the social fabric of innovation and change, and at multiple levels. At the individual level, he has studied the influence of social networks on a manager’s ability to innovate. At a corporate level, he has examined structural changes and the processes which help firms to adapt. The latter work is also focused on organisation culture, including its alignment with strategy, how it changes, and the role of leadership. Finally, he explores leadership transitions, that is how managers develop their leadership skills and identity. He has served on the editorial board of Strategic Organisation and the Strategic Management Journal, and is a former departmental editor of the Journal of International Business Studies. He has published in various academic and practitioner-oriented journals, including the Journal of Managerial and Decision Economics, Administrative Science Quarterly, Academy of Management Journal, Organisation Science, Strategic Management Journal, Harvard Business Review, and Research in Organisational Behaviour. Professor Galunic has been a pioneer of several courses at INSEAD, including the core MBA course on Managing Organisations. He has won best case study awards, including the 2007 ECCH Best Case Award (Organisational Behaviour/Human Resources area). He also teaches in a variety of INSEAD Executive Education programmes, both in Fontainebleau and in Asia, and was a programme director of the INSEAD's high potentials programme (Management Acceleration Programme). He was a nominee for the Best Core Teacher Award, EMBA in 2004, 2005, 2006, and received the 2004/2005 INSEAD Excellence Award in Executive Education.Professor Galunic holds a PhD in Organisational Behaviour/Industrial Engineering from Stanford University, California; a BA in Philosophy, Politics and Economics from Oxford University (Canadian Rhodes Scholar); and a BSc in Chemical Engineering from Queen's University, Canada.Charles Galunic directs the Executive Education Transition to General Management Programme and Leading Organisations in Disruptive Times.'",
        "pdf_url": "https://www.charlesgalunic.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Nathan Furr",
        "title": "Associate Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/nathan-furr.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/nathan-furr",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jason Davis",
        "title": "Associate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ldti/images/Jason_Davis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jason-p-davis",
        "intro_desc": "Jason Davis is an Associate Professor of Entrepreneurship and Family Enterprise at INSEAD. He is an expert on digital transformation and innovation in large enterprises and the strategies of startups in digital platform ecosystems. His research has focused on issues of collaboration and adaptation by 'big tech' computing companies in Silicon Valley and Seattle, fast experimentation by mobile app ventures on the iPhone and Android platforms, and the social media strategies of the Fortune 500 companies using Twitter and Facebook. He applies these insights to large organizations as they seek to create value with new digital technologies and systems like artificial intelligence, automation, platform-marketplaces, blockchain, and super-apps, and to new ventures in his MBA course, Digital Entrepreneurship. Jason has focused effort on investigating business model innovations by big tech companies in Asia, having developed teaching cases about how companies such as Go-Jek, Grab, Alibaba, ByteDance, Pinduoduo, and Circles.Life are innovating in the region, and how Amazon, Facebook, Microsoft, and Google compete globally. Prior to joining INSEAD, Jason was an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management in the MIT Sloan School of Management where he taught Technology Strategy.Jason earned PhD and MA degrees from Stanford University, where his research was supported by the National Science Foundation. He also earned MS and SB degrees from Caltech and MIT where he did thesis research in computation theory and molecular biology. His research has been published in top academic journals such as the Administrative Science Quarterly, American Economic Review, Strategic Management Journal, Academy of Management Journal, and Academy of Management Review. Jason has served as editorial board member at Academy of Management Journal, Organization Science, Strategic Management Journal, and Strategic Organization. He has received multiple research awards including the AOM Academy-Wide Newman Award for Best Paper from a Dissertation (2009), the TIM Division Best Doctoral Dissertation Award (2009), the TIM Division Best Paper Award (2009), the OMT Division Best Paper Award (2008), and the ACAC Competitive Advantage Best Paper Award (2014). Jason also received an Honorable Mention Award for the Granovetter Prize for best article in Economic Sociology from the American Sociological Association (2012). He is also the recipient of the Academy of Management's Technology Innovation Management Emerging Scholar Award (2012). Finally, Jason was selected to receive the ASQ Award for Scholarly Contribution (2015) given to “the most significant paper published in ASQ five years earlier.” His research has also been featured in a variety of popular and industry publications like Harvard Business Review, BBC, Financial Times, Wall Street Journal, Bloomberg, The Atlantic, Forbes, Fortune, The Economist Podcast, Wired, Channel News Asia, South China Morning Post, Jakarta Post, Huffington Post, Sloan Management Review, Computer World and Technology Review. Jason has also consulted, advised, or spoken about his research or conducted executive education at multiple companies including Intel, Microsoft, Cisco, Google, Broadcom, ESI, Sun Microsystems, Tesla, Citibank, Bank Indonesia, BCA, Pertamina, Astra, Go-Jek, Axiata, Natixis, Frasers, Prudential, Aviva, CIMB, Jardines, JG Summit, Lenovo, and various startups. He is a recipient of the EFMD EiP Gold Award (2020) in executive education. At INSEAD, he serves as Program Director for customized executive education programs about Digital Strategy & Leadership and the Leading Digital Transformation and Innovation open enrollment program on INSEAD’s Asia campus.",
        "pdf_url": "http://faculty.insead.edu/jason-davis",
        "university_school": "8888_EUR"
    },
    {
        "name": "Manuel Sosa",
        "title": "Associate Professor of Technology and Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3484",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/manuel-sosa",
        "intro_desc": "Manuel E. Sosa is a Professor of Technology and Operations Management and the Director of the Heinrich and Esther Baumann–Steiner Fund for Creativity and Business at INSEAD. He received a BS degree in Mechanical Engineering from Universidad Simón Bolívar (Caracas, Venezuela) and an SM and a PhD degrees in Mechanical Engineering from the Massachusetts Institute of Technology (MIT). He directs the Innovation by Design Programme.Professor Sosa's research efforts are applied to improving product development systems. He is particularly interested in studying coordination and innovation networks in complex product and software development organisations. Professor Sosa teaches in the MBA, PhD and Executive Education programmes covering topics related to innovation and operations management. His teaching achievements include the development of a programme with the Art Center College of Design (Pasadena, California) to integrate business and design disciplines for successful product development. His professional experience includes systems engineering in the petrochemical industry and development and deployment of computer-aided engineering software applications. ",
        "pdf_url": "http://faculty.insead.edu/manuel-sosa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Joerg Niessing",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Peter Zemsky",
        "title": "Deputy Dean of INSEAD, Dean of InnovationThe Eli Lilly Chaired Professor of Strategy and Innovation",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ICOP/images/Peter_Zemsky.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/peter--zemsky",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Nathan Furr",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/nathan-furr.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/nathan-furr",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Fares Boulos",
        "title": "Affiliated Professor of Practice in Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/bos/images/Faculty-Fares-Boulos.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/fares-boulos",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Michael Shiel",
        "title": "Adjunct Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/bos/images/faculty-Michael-Shiel.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/michael-shiel",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Guoli Chen",
        "title": "Associate Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/guoli-chen.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/guoli-chen",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Andrew V. Shipilov",
        "title": "Professor of StrategyAkzo Nobel Fellow of Strategic Management",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9992",
        "faculty_sub_url": "http://www.amazon.com/Network-Advantage-Unlock-Alliances-Partnerships/dp/1118561457/ref=sr_1_1?ie=UTF8&qid=1458209712&sr=8-1&keywords=the+network+advantage",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Neil Jones",
        "title": "Senior Affiliate Professor of Strategy",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3418",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/neil-jones",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lauren Mathys",
        "title": "Adjunct Professor at INSEAD",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/bos/images/faculty-Lauren-Mathys.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lauren Mathys",
        "title": "Adjunct Professor at INSEAD",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/bos/images/faculty-Lauren-Mathys.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Theodoros Evgeniou",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/summer/images/theodoros-evgeniou.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/theodoros-evgeniou",
        "intro_desc": "Theos Evgeniou is a Professor of Decision Sciences and Technology Management at INSEAD, and was Academic Director of INSEAD eLab, a research and analytics center at INSEAD that focused on data analytics for business.Professor Evgeniou has received four degrees from MIT, two BSc degrees simultaneously, one in Computer Science and one in Mathematics, as well as a Master and a PhD degrees in Computer Science. He graduated first in the MIT class of 1995 dual degrees in Mathematics, won medals in international mathematical Olympiads, and European awards for business case studies.Professor Evgeniou has authored more than 30 academic and business articles which have been cited by more than 5000 other publications. At INSEAD, Theos has been focusing on data analytics (and “Big Data”) applied to a range of areas from customer insights and marketing to finance. He has been developing and teaching courses on Data Analytics, Statistics and Decision Making. Professor Evgeniou gives talks and consults for a number of organisations in his areas of expertise.His recent focus is on statistical arbitrage in finance. He has been involved in developing hedge fund strategies with more than $100 million invested.He recently developed a novel Data Analytics for Business course for MBA and Executive Education participants, which is based on cloud technologies and state of the art open source analytics tools.",
        "pdf_url": "http://faculty.insead.edu/theodoros-evgeniou",
        "university_school": "8888_EUR"
    },
    {
        "name": "Phanish Puranam",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/alumni/images/LLL/phanish.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/phanish-puranam",
        "intro_desc": "Phanish Puranam is a Professor of Strategy, the Roland Berger Chaired Professor of Strategy and Organisation Design at INSEAD. Phanish’s research in organizational science focuses on how organizations work, and how we can make them work better. His current interests include non-hierarchical organizations, the design of informal organization, and organizational architectures that support self-assembling teams. Besides publishing his research extensively in peer reviewed journals (see link to Personal Website above), Phanish has also written several books. “The Microstructure of Organizations” (Oxford University Press, 2018) offers researchers a new perspective on organization design. Phanish’s books for practitioners include \"Corporate Strategy: Tools for analysis and decisions\" (co-authored with Bart Vanneste, Cambridge University Press, 2016) which is used as a reference in MBA programs around the world. India Inside (co-authored with Nirmalya Kumar, Harvard Business Review Press, 2012) won critical acclaim for its balanced look at the prospect of India emerging as a global hub for innovation. Phanish obtained his PhD at the Wharton School of the University of Pennsylvania in 2001, and was on the faculty of London Business School till 2012. Reflecting his commitment to doctoral training, he has served as the Academic Director for the PhD Program at both London Business School and INSEAD.Phanish Puranam directs the AI for Business programme.",
        "pdf_url": "http://faculty.insead.edu/phanish-puranam",
        "university_school": "8888_EUR"
    },
    {
        "name": "Joerg Niessing",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Manuel Sosa",
        "title": "Associate Professor of Technology and Operations Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/dtcb/Manuel_Sosa_3_133x133_1.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/manuel-sosa",
        "intro_desc": "Manuel E. Sosa is a Professor of Technology and Operations Management and the Director of the Heinrich and Esther Baumann–Steiner Fund for Creativity and Business at INSEAD. He received a BS degree in Mechanical Engineering from Universidad Simón Bolívar (Caracas, Venezuela) and an SM and a PhD degrees in Mechanical Engineering from the Massachusetts Institute of Technology (MIT). He directs the Innovation by Design Programme.Professor Sosa's research efforts are applied to improving product development systems. He is particularly interested in studying coordination and innovation networks in complex product and software development organisations. Professor Sosa teaches in the MBA, PhD and Executive Education programmes covering topics related to innovation and operations management. His teaching achievements include the development of a programme with the Art Center College of Design (Pasadena, California) to integrate business and design disciplines for successful product development. His professional experience includes systems engineering in the petrochemical industry and development and deployment of computer-aided engineering software applications. ",
        "pdf_url": "http://faculty.insead.edu/manuel-sosa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jean-Claude Larréché",
        "title": "Professor of MarketingThe Alfred H. Heineken Chaired Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3658",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jeanclaude-larreche",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philip Parker",
        "title": "INSEAD Chaired Professor of Management Science",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3458",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/philip-m-parker",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jörg Niessing",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Wolfgang Ulaga",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/b2b/images/wolfganag1.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/wolfgang--ulaga",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "David Dubois",
        "title": "Associate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3385",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/david-dubois",
        "intro_desc": "David Dubois (PhD, Kellogg School of Management) is a tenured Associate Professor at INSEAD and one of the world’s leading scholar on data-driven marketing, customer centricity and digital transformation. Through his research and teaching, he helps professionals and organizations to unlock valuable customer insights from advanced data analytics, and to design and implement effective omnichannel strategies. To do so, he focuses on when and how companies can turn insights from digital technologies such as social media, IoT, AI or blockchain into long-term competitive advantages in the marketplace. He also helps business leaders unpack the steps they need to take to transform their organization and create long-term customer value from data analytics. David is also a global expert on luxury and fashion brand management. David’s work on digital consumer behavior, analytics-driven customer insights, social influence, social media behavior, word-of-mouth and luxury consumption has appeared in top journals such as Nature Communications, Journal of Consumer Research, Journal of Marketing Research, Journal of Marketing, Journal of Consumer Psychology, Harvard Business Review, Journal of Personality and Social Psychology, Psychological Science, Journal of Experimental Social Psychology, Social Psychological and Personality Science and Current Opinion in Psychology. His work is regularly featured in outlets such as The Financial Times, The Economist, The Wall Street Journal, Forbes, Bloomberg, CNN, NPR, Time Magazine and Le Monde, among others. He is an editorial review board member of the Journal of Consumer Research and Recherche et Applications en Marketing. In recognition of his top publications, David was named 2017 Young Scholar by the Marketing Science Institute. At INSEAD, David is the co-director of the Leading Digital Marketing Strategy Programme (on campus and online) and the Driving Digital Marketing Strategy Programme (online). He has designed, directed and delivered dozens of executive education programs or workshops for companies such as Google, Cartier, Moët Hennessy, Diageo Reserve, l'Oréal Paris, Pernod Ricard, Silversea Cruises, Ferrero, Adecco, Celgene, Sanofi, Abbvie, Biogen, Grünenthal, Takeda, Mizuho, Ajinomoto, Nitto Denko, HDFC Life, Hewlett Packard Enterprise and teaches in several of INSEAD’s flagship executive education programs. He has also launched and teaches MBA electives on (1) Digital and Social Media Strategy and (2) Value Creation in Luxury and Fashion.  A passionate educator, David has developed many pedagogical tools on data-driven marketing, customer centricity and digital transformation. He was in among the top 40 bestselling case authors worldwide in 2018 and 2019. He won the 2017 and 2018 best marketing case awards by the Case Center for his work on L'Oréal Paris’ big data and analytics strategy and the customer experience makeover at AccorHotels. He also won the 2019 EFMD case competition for his case on Air Liquide’s customer-centric digital transformation. David regularly accompanies business leaders in the digitalization of their organisations and is involved in selected business analytics and insights generation ventures.  A global citizen, David grew up in France and has lived in the USA (Chicago) and Japan. He currently lives in Singapore with his wife and two kids. ",
        "pdf_url": "http://faculty.insead.edu/david-dubois/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Klaus Wertenbroch",
        "title": "Professor of MarketingThe Novartis Chaired Professor of Management and the Environment",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/klaus-wertenbroch.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/klaus-wertenbroch",
        "intro_desc": "Klaus Wertenbroch is the Novartis Chaired Professor of Management and the Environment and Professor of Marketing at INSEAD. He directs the INSEAD Strategic Marketing Programme. Trained at the University of Chicago’s influential Center for Decision Research, Dr. Wertenbroch is an expert in behavioural economics and consumer decision-making, strategic brand management, and pricing. He has taught these topics in undergraduate, MBA, Ph.D., and executive education programmes in the U.S., Europe, and Asia and has worked with clients including Allianz, Booz Allen Hamilton, Cemex, Citigroup, ExxonMobil, Ferrero, GfK, IBM, Indian Railways, Lafarge, LG, L'Oreal, Mediamarkt/Saturn, Metro, Nissan, Petronas, Philip Morris, Starwood Hotels, and Unilever. His research focuses on behavioural economics and its strategic marketing and public policy implications. He is an expert on consumer self-control problems, with a focus on overconsumption, overspending, and consumer debt, and has contributed to financial education initiatives by the public and the private sector (e.g., Citigroup, Friedrich-Ebert-Foundation, German Institute for Economic Research/DIW, OECD, U.S. Treasury Department). He is currently investigating how consumers respond to the more dystopian aspects of artificial intelligence (AI) and marketing automation (e.g., in the areas of data privacy, explainability of algorithms, and consumer autonomy).His work has appeared in leading scientific journals such as the Journal of Consumer Research, Journal of Marketing Research, Marketing Science, Organizational Behavior and Human Decision Processes, and Psychological Science. His work was featured by the Financial Times, Sloan Management Review, and Harvard Business Review and has received international newspaper, radio, and TV coverage by various media outlets including BBC Radio, Le Figaro, National Public Radio, Nightly Business Report, Psychology Today, Tagesspiegel, The Economist.com, and U.S. Industry Today. His research won the 1995 American Marketing Association (AMA) Doctoral Dissertation Award and the 2005 AMA O’Dell Award, the most prestigious annual award in marketing, for the Journal of Marketing Research article that has made the most significant long-term contribution to marketing over the previous five years. He was a finalist for the 2006 and 2009 Journal of Consumer Research Best Article Awards. He was also selected as one of the inaugural Marketing Science Institute Young Scholars in 2001.Klaus will be an Associate Editor for Journal of Consumer Research from 2021 and for the Journal of Public Policy and Marketing from 2020. He has served as the launching editor-in-chief of the Journal of Marketing Behavior, as an Associate Editor of the Journal of Consumer Psychology, and as a member of the editorial boards of the Journal of Consumer Research and the Journal of Marketing Research, among others, for many years.He holds a Ph.D. and an MBA from the University of Chicago and an M.Sc. (Diploma) in Psychology from the Darmstadt University of Technology in his native Germany. At INSEAD, he has been based in both Singapore and Fontainebleau and has served as the director of what is now the INSEAD-Sorbonne Université Behavioural Lab in Paris. Before joining INSEAD, he was a faculty member at Duke University and then at Yale University. Klaus also held appointments as Visiting Professor of Marketing at the University of California, Berkeley, in 2009 and at The Wharton School of the University of Pennsylvania from 2010 to 2013, where he was also the Judith C. and William G. Bollinger Visiting Professor. ",
        "pdf_url": "http://scholar.google.com/citations?user=ABYkyCoAAAAJ",
        "university_school": "8888_EUR"
    },
    {
        "name": "Hellmut Schütte",
        "title": "Emeritus Professor of International Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3478",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/hellmut-schtte",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Michael A. Witt",
        "title": "Affiliate Professor of Strategy and International Business",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/imap/images/michael-witt.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/michael-a-witt",
        "intro_desc": "Professor Witt teaches and researches international business at INSEAD and is an Associate in Research at Harvard's Reischauer Institute. He is primarily based in Singapore.His research and teaching focuses on international business, global strategy, and Blue Ocean Shift.Professor Witt has published five major books, including Asian Business and Mangement (2019, Macmillan), The Oxford Handbook of Asian Business Systems (2014, Oxford U. Press), The Future of Chinese Capitalism  (2007, Oxford U. Press), and Changing Japanese Capitalism (2006, Cambridge U. Press). His academic research has appeared or is forthcoming in leading publications, including the Journal of International Business Studies, Strategic Management Journal, Journal of Management Studies, Journal of World Business, Management and Organization Review, Socio-Economic Review, and Business Ethics Quarterly.Professor Witt is former Editor-in-Chief of Asian Business & Management, a major academic journal on business and management in the Asian context, and serves as Consulting Editor of the Journal of International Business Studies as well as Senior Editor of the Management and Organization Review. Honors received include a prestigious Humboldt Fellowship. At INSEAD, he is the Program Director of a range of executive development programs, including International Management in Asia Pacific, a senior executive open-enrollment program on succeeding in business in Asia.Professor Witt holds a Ph.D. and M.A. from Harvard University and an A.B. from Stanford University. He has lived in China, France, Germany, Japan, Korea, Singapore, and the United States.For up-to-date research and teaching details and access to papers, please click on \"Personal Website\" on top of this page or visit his ResearchGate profile profile.",
        "pdf_url": "http://faculty.insead.edu/michael-witt",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jasjit Singh",
        "title": "Associate Professor of StrategyShell Fellow in Business and the Environment",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9846",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jasjit-singh",
        "intro_desc": "Jasjit has been an INSEAD professor since 2004. His expertise includes Strategy, Innovation, Sustainable Development, Purpose-Driven Business, Impact Investing and Impact Evaluation. He regularly speaks on these topics, and also advises entrepreneurs, philanthropists, investors and organizations on how to best manage their societal impact.Jasjit has written numerous articles for leading journals and case studies that have won prestigious awards. He earned a PhD in Business Economics (Strategy) at Harvard Business School and an MA in Economics at Harvard University, having earlier obtained a BTech in Computer Science & Engineering at IIT Delhi and a double-MS at Georgia Tech.Details of Jasjit’s work can be found at http://faculty.insead.edu/jasjit-singh",
        "pdf_url": "http://faculty.insead.edu/jasjit-singh/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jason Davis",
        "title": "Associate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ldti/images/Jason_Davis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jason-p-davis",
        "intro_desc": "Jason Davis is an Associate Professor of Entrepreneurship and Family Enterprise at INSEAD. He is an expert on digital transformation and innovation in large enterprises and the strategies of startups in digital platform ecosystems. His research has focused on issues of collaboration and adaptation by 'big tech' computing companies in Silicon Valley and Seattle, fast experimentation by mobile app ventures on the iPhone and Android platforms, and the social media strategies of the Fortune 500 companies using Twitter and Facebook. He applies these insights to large organizations as they seek to create value with new digital technologies and systems like artificial intelligence, automation, platform-marketplaces, blockchain, and super-apps, and to new ventures in his MBA course, Digital Entrepreneurship. Jason has focused effort on investigating business model innovations by big tech companies in Asia, having developed teaching cases about how companies such as Go-Jek, Grab, Alibaba, ByteDance, Pinduoduo, and Circles.Life are innovating in the region, and how Amazon, Facebook, Microsoft, and Google compete globally. Prior to joining INSEAD, Jason was an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management in the MIT Sloan School of Management where he taught Technology Strategy.Jason earned PhD and MA degrees from Stanford University, where his research was supported by the National Science Foundation. He also earned MS and SB degrees from Caltech and MIT where he did thesis research in computation theory and molecular biology. His research has been published in top academic journals such as the Administrative Science Quarterly, American Economic Review, Strategic Management Journal, Academy of Management Journal, and Academy of Management Review. Jason has served as editorial board member at Academy of Management Journal, Organization Science, Strategic Management Journal, and Strategic Organization. He has received multiple research awards including the AOM Academy-Wide Newman Award for Best Paper from a Dissertation (2009), the TIM Division Best Doctoral Dissertation Award (2009), the TIM Division Best Paper Award (2009), the OMT Division Best Paper Award (2008), and the ACAC Competitive Advantage Best Paper Award (2014). Jason also received an Honorable Mention Award for the Granovetter Prize for best article in Economic Sociology from the American Sociological Association (2012). He is also the recipient of the Academy of Management's Technology Innovation Management Emerging Scholar Award (2012). Finally, Jason was selected to receive the ASQ Award for Scholarly Contribution (2015) given to “the most significant paper published in ASQ five years earlier.” His research has also been featured in a variety of popular and industry publications like Harvard Business Review, BBC, Financial Times, Wall Street Journal, Bloomberg, The Atlantic, Forbes, Fortune, The Economist Podcast, Wired, Channel News Asia, South China Morning Post, Jakarta Post, Huffington Post, Sloan Management Review, Computer World and Technology Review. Jason has also consulted, advised, or spoken about his research or conducted executive education at multiple companies including Intel, Microsoft, Cisco, Google, Broadcom, ESI, Sun Microsystems, Tesla, Citibank, Bank Indonesia, BCA, Pertamina, Astra, Go-Jek, Axiata, Natixis, Frasers, Prudential, Aviva, CIMB, Jardines, JG Summit, Lenovo, and various startups. He is a recipient of the EFMD EiP Gold Award (2020) in executive education. At INSEAD, he serves as Program Director for customized executive education programs about Digital Strategy & Leadership and the Leading Digital Transformation and Innovation open enrollment program on INSEAD’s Asia campus.",
        "pdf_url": "http://faculty.insead.edu/jason-davis",
        "university_school": "8888_EUR"
    },
    {
        "name": "Balagopal Vissa",
        "title": "Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/9849.jpg?itok=T7EAlxKj",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/balagopal-vissa",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Vibha Gaba",
        "title": "Professor of EntrepreneurshipThe INSEAD Fellow in Memory of Erin Anderson",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/11705.jpg?itok=tVuwE_OS",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/vibha-gaba",
        "intro_desc": "Vibha Gaba is a Professor of Entrepreneurship at INSEAD and The INSEAD Fellow in Memory of Erin Anderson. She is broadly interested in how organizations learn and how it impacts their ability to innovate and adapt, especially in discontinuous environments. Her more recent research focuses on the implications of multiple goals and aspirations, organizational structure, and decision-makers' attributes on adaptive change. Her work has been published in leading management journals such as the Academy of Management Journal, Academy of Management Annals, Organization Science, Strategic Management Journal, Management Science, Strategic Entrepreneurship Journal, and Journal of International Business Studies. She is currently serving her second term as the Associate Editor of the Strategic Management Journal, a top-tier management journal. At INSEAD, Vibha teaches modules on Corporate Entrepreneurship, Organizational Change, and Leadership in various Executive Education programs, including Adidas, Alstom, Astra Zeneca, Bank Mandiri, Cartier, COFRA, EDF, Expedia, Heineken, Hewlett Packard, IBM, Indian Railways, KPMG, Larsen & Toubro, McKinsey, Mitsubishi, Permata Bank, Pertamina, Petronas, Randstad, RHB, Roche Diagnostics, Shell, Star Energy, Sumitomo Chemical, Swire, UNICEF, and World Medical Association. She is also the Academic Program Director for three open enrolment programs - Corporate Venturing & Innovation, Leading Successful Change, and Learning to Lead, for senior and junior executives. She has received the INSEAD Executive Education Award for Outstanding Teaching and Program Direction multiple times. She has also taught MBA core Organizational Behavior course and an MBA elective on Leadership and Change. Her teaching portfolio also includes Ph.D. courses on Organization Theory and Corporate Entrepreneurship.Vibha holds a Ph.D. in Management from the Lundquist College of Business, University of Oregon, USA, a Masters in Sociology from the Delhi School of Economics, and a Bachelor's degree in Economics from Delhi University, India.Vibha has lived in three continents – North America, Europe, and Asia. Currently, she resides in Singapore but teaches on both INSEAD campuses (France and Singapore).",
        "pdf_url": "http://faculty.insead.edu/vibha-gaba",
        "university_school": "8888_EUR"
    },
    {
        "name": "Claudia Zeisberger",
        "title": "Senior Affiliate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/3691.jpg?itok=pPjlCtES",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/claudia-zeisberger",
        "intro_desc": "Claudia Zeisberger is a Senior Affiliate Professor of Decision Sciences and Entrepreneurship & Family Enterprise at INSEAD, and the Founder and Academic Director of the school’s private equity centre (GPEI).Through the centre’s work, INSEAD has established itself as the go-to source for insights on PE in emerging markets and as an incubator for talent and professionals.Her links to alumni in the venture space were instrumental in the 2015 formation of “INSEAD Alum Ventures (IAV)”, the school’s first dedicated seed fund, by Alumni – for Alumni.Professor Zeisberger is known for her extensive research on PE in emerging markets, and her output is a function of her close working relationships with private equity firms and their investee companies, institutional investors, Family Offices and Sovereign Wealth Funds.Joining Academia in 2005 after a 16-year career in investment banking & alternative investments, allowed her to leverage her extensive network and combine her passion for education & innovation by connecting academia with industry. In 2010, she launched INSEAD’s popular elective “Managing Corporate Turnarounds,” which combines in-class case studies and visits from industry professionals with an intensive computer-based simulation involving the iconic car brand SAAB and its struggle with bankruptcy. Over a full weekend student teams work to rescue the distressed car manufacturer by drawing on their management, finance and operational skills while facing increasingly complex decisions impacting both the firm’s short-term liquidity and long-term value creation. Students consider MCT the perfect course to put their MBA skills to test; corporations see the simulation as an opportunity to prepare their senior executives for challenging times ahead.Professor Zeisberger teaches the Private Equity & Venture Capital, Corporate Turnaround and Risk management electives in INSEAD’s MBA, EMBA and Executive Education programmes. She has frequently been nominated for the “Best Teaching Award” in her PE elective and has been awarded the “Dean’s Commendation for Excellence in MBA Teaching” annually since 2008.Professor Zeisberger is a founding committee member of the Financial Women’s Association (FWA) in Singapore and was previously on the Board of the Singapore Venture Capital Association (SVCA). She has worked with clients in China, Hong Kong, Malaysia, Thailand, Taiwan, Europe & the Middle East and continues to advise institutional investors, Asian family offices, sovereign wealth funds and regulators on Financial Market Dynamics, Risk Management and Private Capital related issues.She recently published 'Mastering Private Equity – Transformation via Venture Capital, Minority Investments & Buyouts' as well the corresponding INSEAD case book 'Private Equity in Action – Case Studies from Developed & Emerging Markets'. http://claudiazeisberger.com/'''",
        "pdf_url": "http://claudiazeisberger.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van Der Heyden",
        "title": "Professor of Technology and Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/node/7069",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Stylianos Kavadias",
        "title": "Margaret Thatcher Professor of Enterprise Studies in Innovation and GrowthDirector of Research Judge Business School Cambridge",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/srdm/images/faculty-Stylianos-Kavadias.jpg",
        "faculty_sub_url": "http://www.jbs.cam.ac.uk/faculty-research/faculty-a-z/stylianos-stelios-kavadias/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jürgen Mihm",
        "title": "Professor of Technology and Operations ManagementChair, Technology and Operations Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/fr/images/jurgen-mihm.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jurgen-mihm",
        "intro_desc": " Jürgen Mihm is a professor of technology and operations management and the director of the Strategic R&D Management open-enrollment executive programme. He holds a Doctorate degree from WHU’s Otto Beisheim School of Management, Vallendar, Germany as well as a joint degree in Business and Electrical Engineering (Dipl. Wirtsch. Ing.) from Technische Universität Darmstadt.Jürgen's research explores how established companies can make their innovation efforts more nimble and effective. He is especially interested in addressing coordination issues within large engineering programs, in devising incentives for innovation, and (more recently) in integrating design and design thinking into existing organizations. His research has appeared in leading journals, such as Management Science, Organization Science, Manufacturing & Service Operations Management, ASME Journal of Mechanical Design, and Production and Operations Management.Jürgen teaches in the Executive, PhD, EMBA, and MBA programs on topics related to innovation and R&D management. He designs and directs programs in R&D management for Executives—programs that are open to the general public in addition to custom programs for a diverse range of clients.Prior to his position at INSEAD, Jürgen was a long-standing consultant with McKinsey & Company in Frankfurt, Germany. There he primarily served clients in the semiconductor and automotive sectors. His specializations were technology and operations management.",
        "pdf_url": "https://faculty.insead.edu/jurgen-mihm/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Peter Zemsky",
        "title": "Deputy Dean of INSEAD, Dean of InnovationThe Eli Lilly Chaired Professor of Strategy and Innovation",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ICOP/images/Peter_Zemsky.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/peter--zemsky",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Daniel A. Bens",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/dvba/dan-bens1.png",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/daniel-bens",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Gavin Cassar",
        "title": "Professor of Accounting and ControlResearch Director of the INSEAD-Wharton Alliance",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/gavin-cassar.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/gavin-cassar",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Daniel A. Bens",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/dvba/dan-bens1.png",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/daniel-bens",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Pierre Hillion",
        "title": "Professor of FinanceThe de Picciotto Chaired Professor of Alternative Investments",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/aicf/images/faculty-Pierre-Hillion.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/pierre-hillion",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jörg Niessing",
        "title": "Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Karel Cool",
        "title": "Professor of Strategic ManagementThe BP Chaired Professor of European Competitiveness",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3377",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/karel-cool",
        "intro_desc": "Karel Cool is a Professor of Strategic Management and the BP Chaired Professor of European Competitiveness at INSEAD. His research, teaching, and consulting focus on problems of industry dynamics and competitive strategy (e.g., competitive positioning; assessment of profit opportunities in markets; strategic supply chain dynamics and management; eco-system leadership; vertical integration and de-integration; industry overcapacity; critical mass races, customer value creation, and capturing). Karel Cool is directing the Competitive Strategy Executive Education programme.He has published in many journals, including Management Science, Strategic Management Journal, Harvard Business Review, Organization Science, Academy of Management Journal, Marketing Letters, Advances in Strategic Management, Journal of Supply Chain Management, etc.; edited books such as European Industrial Restructuring in the 1990s (with D. Neven and I. Walter; Macmillan 1992), and Industry Structuring and Restructuring (with J. Henserson and R. Abate; Blackwell 2004, SMS Book Series); and has contributed to many books on competitive strategy.From 1995 to 2007 he was an Associate Editor of the Strategic Management Journal, a leading strategy journal.He has consulted on major strategic issues of corporate and industry restructuring, and worked with various corporations including Unilever, PriceWaterhouseCoopers, Daimler-Chrysler, Borealis, RollsRoyce, Thomson Travel Group, Exxon, Solvay, Novo-Nordisk Lufthansa, KBC, Whirlpool, IBM, Expedia, Banque de France, McKinsey, Starwood, BCG, Shell, ING, Aktiva, Amgen, Bayer, Nordea, World Economic Forum, IBM, KGL Kuwait, Hearst, Reynaers Aluminium, Dong Energy Wind Power, Vandemoortele, Mars, etc.During the 1995-1996 academic year, he was a Visiting Professor at the Graduate School of Business at the University of Chicago. He was also a Visiting Professor at Northwestern University, and was a co-chair of the annual 2002 Strategic Management Society Conference held in Paris.He is a six-times winner of the 'Best Teaching Award' in the MBA programme, and is the founder and Programme Director of the long-running 'Competitive Strategy' Executive Education programme at INSEAD in Fontainebleau and Singapore. In 2007 he was inducted as a Fellow of the Strategic Management Society. In 2009 he received the George S. Day Distinguished Alumni Academic Service Award from Purdue University. In September 2014, he was honoured by the Case Center as one of the best-selling case authors over the past forty years — Karel has (co-)authored more than sixty case studies.Karel Cool obtained his PhD (1985) and MScIA (1982) from Purdue University, and his MA (1981) and Lic (1978) in Applied Economics from the University of Antwerp (UFSIA).'''",
        "pdf_url": "http://faculty.insead.edu/karel-cool",
        "university_school": "8888_EUR"
    },
    {
        "name": "Michael Shiel",
        "title": "Adjunct Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/smb/images/Michael_Shiel.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/michael-shiel",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Lily Hua Fang",
        "title": "Professor of FinanceThe AXA Chaired Professor in Financial Market Risk",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3391",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/lily-hua-fang",
        "intro_desc": "Lily Fang is a Professor of Finance at INSEAD and the holder of the AXA Chair in Financial Market Risk. Professor Fang joined INSEAD in 2003. She is currently based in the European campus, after having spent twelve years in the Asian campus.Professor Fang’s primary research interest is financial market information and investment strategies. She has published numerous papers on the performance, behavior, and incentives of financial analysts, fund managers, and financial institutions in top academic journals such as the Journal of Finance, the Journal of Financial Economics, and the Review of Financial Studies. Her work on the relation between media coverage and stock returns received the prestigious Smith Breeden prize for outstanding papers published in the Journal of Finance. Professor Fang has advised a number of large institutional investors on investment strategies.At INSEAD Professor Fang teaches corporate finance, capital markets, valuation, private equity, venture capital and entrepreneurial finance in the MBA, EMBA, and Executive Education programmes. She has won the Dean's Commendation Award for Excellence in MBA Teaching numerous times and has taught and directed numerous Executive Education programmes. Professor Fang has also been a Visiting Professor of Finance at the MIT Sloan School of Management where she won the Outstanding Teacher Award.Professor Fang obtained her PhD in Finance from the Wharton School, University of Pennsylvania. Prior to that, she studied mathematics, actuarial science and management science at Simon Fraser University in Vancouver. ",
        "pdf_url": " http://faculty.insead.edu/lily-fang",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jason Davis",
        "title": "Associate Professor of Entrepreneurship and Family Enterprise",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ldti/images/Jason_Davis.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jason-p-davis",
        "intro_desc": "Jason Davis is an Associate Professor of Entrepreneurship and Family Enterprise at INSEAD. He is an expert on digital transformation and innovation in large enterprises and the strategies of startups in digital platform ecosystems. His research has focused on issues of collaboration and adaptation by 'big tech' computing companies in Silicon Valley and Seattle, fast experimentation by mobile app ventures on the iPhone and Android platforms, and the social media strategies of the Fortune 500 companies using Twitter and Facebook. He applies these insights to large organizations as they seek to create value with new digital technologies and systems like artificial intelligence, automation, platform-marketplaces, blockchain, and super-apps, and to new ventures in his MBA course, Digital Entrepreneurship. Jason has focused effort on investigating business model innovations by big tech companies in Asia, having developed teaching cases about how companies such as Go-Jek, Grab, Alibaba, ByteDance, Pinduoduo, and Circles.Life are innovating in the region, and how Amazon, Facebook, Microsoft, and Google compete globally. Prior to joining INSEAD, Jason was an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management in the MIT Sloan School of Management where he taught Technology Strategy.Jason earned PhD and MA degrees from Stanford University, where his research was supported by the National Science Foundation. He also earned MS and SB degrees from Caltech and MIT where he did thesis research in computation theory and molecular biology. His research has been published in top academic journals such as the Administrative Science Quarterly, American Economic Review, Strategic Management Journal, Academy of Management Journal, and Academy of Management Review. Jason has served as editorial board member at Academy of Management Journal, Organization Science, Strategic Management Journal, and Strategic Organization. He has received multiple research awards including the AOM Academy-Wide Newman Award for Best Paper from a Dissertation (2009), the TIM Division Best Doctoral Dissertation Award (2009), the TIM Division Best Paper Award (2009), the OMT Division Best Paper Award (2008), and the ACAC Competitive Advantage Best Paper Award (2014). Jason also received an Honorable Mention Award for the Granovetter Prize for best article in Economic Sociology from the American Sociological Association (2012). He is also the recipient of the Academy of Management's Technology Innovation Management Emerging Scholar Award (2012). Finally, Jason was selected to receive the ASQ Award for Scholarly Contribution (2015) given to “the most significant paper published in ASQ five years earlier.” His research has also been featured in a variety of popular and industry publications like Harvard Business Review, BBC, Financial Times, Wall Street Journal, Bloomberg, The Atlantic, Forbes, Fortune, The Economist Podcast, Wired, Channel News Asia, South China Morning Post, Jakarta Post, Huffington Post, Sloan Management Review, Computer World and Technology Review. Jason has also consulted, advised, or spoken about his research or conducted executive education at multiple companies including Intel, Microsoft, Cisco, Google, Broadcom, ESI, Sun Microsystems, Tesla, Citibank, Bank Indonesia, BCA, Pertamina, Astra, Go-Jek, Axiata, Natixis, Frasers, Prudential, Aviva, CIMB, Jardines, JG Summit, Lenovo, and various startups. He is a recipient of the EFMD EiP Gold Award (2020) in executive education. At INSEAD, he serves as Program Director for customized executive education programs about Digital Strategy & Leadership and the Leading Digital Transformation and Innovation open enrollment program on INSEAD’s Asia campus.",
        "pdf_url": "http://faculty.insead.edu/jason-davis",
        "university_school": "8888_EUR"
    },
    {
        "name": "Bart Zhou Yueshen",
        "title": "Assistant Professor of Finance",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/bart-zhou-yueshen.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/bart-zhou-yueshen",
        "intro_desc": "Bart Zhou Yueshen is an assistant professor (Finance area) at INSEAD. His research focuses on the operation, organization, and regulation of financial securities markets, with specific interests on how real-world frictions and market structure affect resource allocation and information.Bart holds a PhD in Finance (VU University Amsterdam, Tinbergen Institute, and Duisenberg School of Finance; 2014), an M.Phil. in finance (Universiteit van Amsterdam, Tinbergen Institute, and Duisenberg School of Finance; 2011), and a B.E&F (The University of Hong Kong; 2009).'",
        "pdf_url": "http://www.yueshen.me/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Joerg Niessing",
        "title": "Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Wolfgang Ulaga",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10063",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/wolfgang--ulaga",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Leonard Lodish",
        "title": "Samuel R. Harrell Emeritus Professor of Marketing, WhartonLeader and Co-Founder, Global Consulting Practicum",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lesf/images/Leonoard_Lodish.jpg",
        "faculty_sub_url": "https://marketing.wharton.upenn.edu/profile/192/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/idp/images/Enrico_D.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "Robert Davenport",
        "title": "Retired Vice President and Director of HayManagement Consultants’ Sales ForceEffectiveness Consulting Practice",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lesf/images/Robert_Davenport.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Michael Writer",
        "title": "Principal of Writercross ConsultingFor the Singapore session",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/lesf/images/Michael_Writer_-_version_2.jpg",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "V. (Paddy) Padmanabhan",
        "title": "Professor of MarketingThe Unilever Chaired Professor of MarketingAcademic Director, Emerging Markets Institute",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3456",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/v-paddy-padmanabhan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Andre Calmon",
        "title": "Assistant Professor of Technology and Operations Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/scm/images/Andre_Calmon.png",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/andre-calmon",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Gavin Cassar",
        "title": "Associate Professor of Accounting and Control",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/mp/emba/images/Gavin_cassar.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/gavin-cassar",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enver Yucesan",
        "title": "Professor of Operations Management",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3511",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enver-yucesan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Henning Piezunka",
        "title": "Assistant Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/Henning-Piezunka.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/henning-piezunka",
        "intro_desc": "Henning Piezunka is an Assistant Professor of Entrepreneurship and Family Entreprise at INSEAD. He obtained a PhD at Stanford University, a Master of Science at the London School of Economics, UK, and a Diplom Kaufmann from the University of Mannheim, Germany. Henning is an accomplished researcher in the areas of competition and innovation, and publishes his work in leading academic journals including the Academy of Management Journal. Before starting his academic career, he co-founded a web design company in 1998 and acted as its founder-CEO until selling it in January 2016. By 2016, Henning’s company employed more than 30 people and served customers in more than 80 countriesHenning’s teaching focus is on the New Business Ventures course which he teaches in the MBAand the Executive MBA programmes. Henning has received outstanding teaching ratings, has been on Dean’s list for excellence in MBA teaching, and has won the INSEAD best teacher award.",
        "pdf_url": "http://henningpiezunka.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Nuno Delicado",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/isep/images/Nuno-Delicado.jpg",
        "faculty_sub_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/isep/docs/Nuno_Delicado_bio.pdf",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Zoe Kinias",
        "title": "Associate Professor of Organisational Behaviour",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3426",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/zoe-kinias",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ilze Kivleniece",
        "title": "",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/ilze-kivleniece.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ilze-kivleniece",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jasjit Singh",
        "title": "Professor of StrategyThe Paul Dubrule Chaired Professor of Sustainable DevelopmentAcademic Director, INSEAD Social Impact Initiative",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ltbs/images/Jasjit_Singh.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jasjit-singh",
        "intro_desc": "Jasjit has been an INSEAD professor since 2004. His expertise includes Strategy, Innovation, Sustainable Development, Purpose-Driven Business, Impact Investing and Impact Evaluation. He regularly speaks on these topics, and also advises entrepreneurs, philanthropists, investors and organizations on how to best manage their societal impact.Jasjit has written numerous articles for leading journals and case studies that have won prestigious awards. He earned a PhD in Business Economics (Strategy) at Harvard Business School and an MA in Economics at Harvard University, having earlier obtained a BTech in Computer Science & Engineering at IIT Delhi and a double-MS at Georgia Tech.Details of Jasjit’s work can be found at http://faculty.insead.edu/jasjit-singh",
        "pdf_url": "http://faculty.insead.edu/jasjit-singh/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Filipe Santos",
        "title": "Dean Católica-Lisbon School of Business and EconomicsVisiting Professor of Social Entrepreneurship at INSEAD",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3333",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/filipe-santos",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Annet Aris",
        "title": "Adjunct Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/events/speakers/Annet_Aris_web.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/annet-aris",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jean Dermine",
        "title": "Professor of Banking and FinanceDocteur es Sciences Economiques,Université Catholique de Louvaintant",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10464",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/jean-dermine",
        "intro_desc": "Jean Dermine is a Professor of Banking and Finance at INSEAD. He holds Doctorat en Sciences Economiques from the Université Catholique de Louvain and Master of Business Administration from Cornell University. He directs the INSEAD Executive Education programmes on Risk Management in Banking and Strategic Management in Banking.Author of numerous articles on asset and liability management, European financial markets, and the Theory of Banking, Jean Dermine has published five books, among which are European Capital Markets with a Single Currency (Oxford University Press), and Bank Valuation and Value-based Management (McGraw-Hill). His research papers have appeared in the Journal of Financial Intermediation, Journal of Money, Credit and Banking, Journal of Banking and Finance, and other academic and professional journals. Laureate of the EIB Prize for his essay \"Eurobanking, a New World\", he is a co-author of the ALCO Challenge, a computer-based training simulation used in Europe, Africa, the Americas, and Asia.Jean Dermine has served as a Visiting Professor at the Wharton School of the University of Pennsylvania, at the Universities of Louvain and Lausanne, CESAG in Dakar, as well as a Salomon Center Visiting Fellow at New York University, and a Danielsson Foundation Guest Professor of Bank Management at the Göteborg and Stockholm Schools of Economics. As a consultant or director of training and executive education programmes, he worked with several international banks, accounting and consulting firms, national central banks, European Central Bank, Bank for International Settlements, HM Treasury, the OECD, the World Bank, the European Commission, and the Mentor Forum for the US Supreme Court and the European Court of Justice.",
        "pdf_url": "http://faculty.insead.edu/jean-dermine",
        "university_school": "8888_EUR"
    },
    {
        "name": "Quy Huy",
        "title": "Professor of StrategyPhD, McGill University",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3748",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/quy-huy",
        "intro_desc": "Dr. Quy Nguyen Huy is a professor of strategy at INSEAD since 1998. He is known as a pioneering world scholar in linking social-emotional factors to the performance of strategic change and organizational innovation. Dr. Huy’s research on strategic change, strategy execution, and organizational innovation has won ten international awards and was published in prestigious scholarly and practice journals such as Administrative Science Quarterly, the Academy of Management Journal, Academy of Management Review, Harvard Business Review, MIT Sloan Management Review, Organization Science, and Strategic Management Journal. Dr. Huy’s research on middle managers was published in and selected by Harvard Business Review as “Breakthrough Ideas for Today's Business Agenda.\"  Dr Huy’s pioneering research on how collective emotions and emotional capital enhance organizational innovation and strategy execution has been applied by numerous organizations worldwide, both in the private and nonprivate sectors. Dr. Huy has done executive development, teaching, consulting or coaching for a wide range of profit and non-profit organizations worldwide, including Aerospatiale Matra, Alcan, the Aga Khan Foundation, Alcan, Alstom, Arcelor Mittal, Astra Zeneca, Bell Canada Enterprises, British Telecom, Electricité et Gaz de France, Fiat, Fujitsu, Google, Hewlett Packard, IBM, HIV Aids Alliance, Intesalat, the International Federation of Red Cross Red Crescent, LG Electronics, Lufthansa, Marconi, Matsushita, Motorola, Petrobras, the Royal Bank of Canada, Sasken, Standard Chartered Bank, Sicredi, Siemens, United Arab Emirates Civil Service, and Via Rail Canada.  Huy was originally trained as an electrical engineer then in corporate finance. He worked for 16 years in various managerial functions with several large information technology firms in North America. His managerial career covered systems and software engineering; sales and marketing of digital platforms; and corporate finance, where he dealt with institutional investors and credit rating agencies and worked on joint ventures, mergers and acquisitions, and turnarounds of firms with turnover up to 10 billion dollars. Huy is also a Chartered Financial Analyst (CFA). He specialized in the determination of cost of capital, analysis of very large capital projects, capital structure and debt financing, and valuation of business ventures and risks. ",
        "pdf_url": "http://faculty.insead.edu/quy-huy",
        "university_school": "8888_EUR"
    },
    {
        "name": "Joerg Niessing",
        "title": "Affiliate Professor of MarketingPhD, University of Muenster",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/joerg-niessing",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Subramanian Rangan",
        "title": "Professor of Strategy and ManagementThe Abu Dhabi Crown Prince Court Endowed Chair in Societal ProgressPhD, Harvard",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3474",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/subramanian-rangan",
        "intro_desc": "Subi Rangan received an MBA from the MIT Sloan School of Management and a Ph.D. in political economy from Harvard University.His current work explores the future of capitalism and in particular how enterprises may better integrate performance and progress. In 2013 he initiated the Society for Progress, a fellowship of eminent philosophers, social scientists, and business leaders (www.societyforprogress.org). Their first work was published in a volume entitled Performance & Progress: Essays on Capitalism, Business, and Society (Oxford University Press, 2015). Their second book is Capitalism Beyond Mutuality? Perspectives Integrating Philosophy and Social Science (Oxford University Press, 2018).His other research explores the political sociology of discrimination of foreign transnational firms and these firms’ non-market strategies. In 1998 he won the Academy of International Business’ Eldridge Haynes Prize for the best original work in international business. In 1995 that academy awarded their Best Dissertation Award to his doctoral thesis. In 2010 his research won the Emerald award for Top 50 papers in management. His articles appear in the Administrative Science Quarterly, Academy of Management Review, Brookings Papers on Economic Activity, Journal of International Business Studies, Strategic Management Journal, Sloan Management Review, and Harvard Business Review. Subi is coauthor of two books: Manager in the International Economy, and A Prism on Globalization. He is associate editor of the Academy of Management Review; former chair of the World Economic Forum’s Global Agenda Council on Emerging Multinationals; a member of the board of trustees of Fundacao Dom Cabral, a leading business school in Brazil; and a member of the Board of the Schwab Foundation for Social Entrepreneurship. Subi directs INSEAD’s top executive seminar AVIRA: Awareness, Vision, Imagination, Role, and Action, as well as the newly launched Integrating Performance & Progress. Professor Rangan is a multiple-time recipient of the Outstanding Teacher award and Dean’s Commendation for Excellence in Teaching. He is married and has a daughter and son.",
        "pdf_url": "http://faculty.insead.edu/subramanian-rangan",
        "university_school": "8888_EUR"
    },
    {
        "name": "Loic Sadoulet",
        "title": "Affiliate Professor of EconomicsPhD, Princeton University",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3475",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/loic-sadoulet",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ludo Van Der Heyden",
        "title": "Professor of Technology and Operations ManagementThe INSEAD Chaired Professor in Corporate Governance and StrategyAcademic Director, INSEAD Corporate Governance Initiative",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3498",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ludo-van-der-heyden",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Javier Gimeno",
        "title": "Professor of StrategyAon Dirk Verbeek Chaired Professor in International Risk and Strategic Management",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/tgm/images/javier-gimeno.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/javier-gimeno",
        "intro_desc": "Javier Gimeno is Professor of Strategy at INSEAD (Fontainebleau campus), in France, where he holds the Aon Dirk Verbeek Chair in International Risk and Strategic Management. A Spanish national, he holds a PhD degree in strategic management from Purdue University. Since 2001, he has taught strategy and industry and competitive analysis at INSEAD at all levels – MBA, Executive MBA, Ph.D., and executive programmes for leading global companies. From 2009 to 2011, he also served as Dean of Executive MBA programmes at INSEAD. Javier served as Chair of the Strategy department at INSEAD, and as Academic Director of the INSEAD European Competitiveness Initiative, a broad initiative by INSEAD faculty to understand and improve business competitiveness in Europe. Javier's research focuses on understanding competitive strategy decisions, and how these decisions lead to competitive interactions and performance consequences. He has done research and developed pedagogical materials in industries such as travel and transportation (airlines), mobile telecommunication services, energy, and computer equipment. His current research integrates a risk management perspective on the analysis of strategic opportunities. Javier’s research has been published in the top academic journals in strategy and management, and has received numerous awards from leading academic and practitioner associations. For instance, his dissertation on multi-market competition in the US airline industry received the prize to the best doctoral dissertation in strategy in its year. He received several Best Paper Awards from the Academy of Management for his research on entrepreneurship, and the Blackrock/National Association of Corporate Directors Best Paper Award for research on strategy and corporate governance. He has taken editorial responsibilities in journals such as Organization Science and Strategy Science. Javier has been a leader in several major professional associations. He was a member of the Board of Governors of the Academy of Management, an association of over 18,000 management academics worldwide. He chaired the Academy’s Business Policy and Strategy division - the largest organisation of strategy academics and practitioners, with over 5,000 members worldwide. Most recently, Javier has been very involved with the Strategic Management Society, a global association of strategy academics, practitioners and consultants. He was the Chairman of the Strategic Management Society International Conference in 2006, served on the Board of Directors from 2010-2015, and is currently the President-Elect of the Society.",
        "pdf_url": " http://faculty.insead.edu/javier-gimeno",
        "university_school": "8888_EUR"
    },
    {
        "name": "Gavin Cassar",
        "title": "Associate Professor of Accounting and Control",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/mp/emba/images/Gavin_cassar.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/gavin-cassar",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ayse Önçüler",
        "title": "Adjunct Professor of Decision SciencesESSEC Business School",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/dlgb/images/Ayse_Onculer.jpg",
        "faculty_sub_url": "http://www.essec.edu/en/staff/faculty/ayse-onculer",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research FundPhD, Yale University",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/aam/images/faculty-Massimo-Massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Li Huang",
        "title": "Assistant Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3412",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/li-huang",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Noah Askin",
        "title": "Assistant Professor of Organisational Behaviour",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/fr/images/Askin_2014.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/noah-askin",
        "intro_desc": "Noah Askin is an Assistant Professor of Organisational Behaviour at INSEAD, where he teaches the organisational design and leadership core course in the MBA program. His teaching focuses primarily on firms’ organisational-strategic alignment, leading and experiencing organisational change, managing corporate culture, and utilizing social networks.Noah is interested in social and cultural networks, the antecedents and consequences of creativity and innovation, the production and consumption of culture, and the dynamics of organisational and individual status. His current research is divided among these interests in two streams. The first is around the creation and performance of cultural products: music chart and industry dynamics, what factors contribute to creativity, the tradeoffs associated with being innovative, the implications of the shift to digital distribution, and the analysis of culture using big data. The second area of research is around the role and impact of network- and rankings-based status on organisations. His work, which has garnered him recognition on the Thinkers 50 Radar list, has appeared in Administrative Science Quarterly, computational social science publications, and been covered in Forbes, Quartz.com, The Times of London, and music industry blogs. Prior to becoming a business school academic, Noah had a number of roles in the business and not-for-profit sectors. He was a management consultant for the Monitor Group, working in its strategy practice and its Executive Development group. This was followed by several years as an early member of a start-up in the educational services space. Noah received a joint PhD from the University of Chicago’s Booth School of Business and its Sociology department. He also has an MA in Sociology from the University of Chicago and an MBA from Booth, as well as an AB in Psychology from Harvard University. ",
        "pdf_url": "http://noahaskin.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Massimo Massa",
        "title": "Professor of FinanceThe Rothschild Chaired Professor of BankingCo-Director of the Hoffmann Research Fund",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/massimo-massa.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/massimo-massa",
        "intro_desc": "Massimo Massa is the Rothschild Chaired Professor of Banking and a Professor of Finance at INSEAD. He teaches international finance, corporate finance, asset management, behavioural finance, and governance in MBA, EMBA, PhD and Executive Education programmes. He has an MBA from the Yale School of Management and an MA and a PhD in Financial Economics from Yale University. He is a CPA and an Auditor. He has previously worked in the Bank of Italy. His research interests include asset management, corporate finance, behavioural finance, and financial intermediation. He has published articles on M&A, alliances, capital structure, dividend policy, share repurchases, IPOs, mutual funds, hedge funds, short-selling, behavioural biases, banking, asset management, international finance, the role of media and social networks in financial markets, ownership structure, corporate governance, family firms. His publications have been featured in top academic journals and his research has been quoted in major magazines, newspapers, professional journals, and forums. He is an Associate Editor of the Journal of Empirical Finance and the Review of Finance.Professor Massa has been a consultant with several companies on strategic issues related to governance and corporate financial and growth strategies. He co-directs the Hoffmann Fund for research in family firms and is the director of the Advanced Asset Management programme, the Interalpha Banking programme and the Executive Master in Finance. He co-directs Value Creation for Owners and Directors programme and has managed several programmes for corporations and banks, including ABN AMRO, Maybank, Société Générale, Fineco, Technip, Mubadala, Bertelsmann. Professor Massa is also teaching in the International Directors Programme and directing the Developing Leaders in Global Banking programme.Professor Massa's current research focuses on the link between corporate financial strategies, governance, and type of ownership and how this affects value creation and growth in corporations as well as the strategies of asset managers and banks and their synergies.",
        "pdf_url": "http://faculty.insead.edu/massimo-massa",
        "university_school": "8888_EUR"
    },
    {
        "name": "Graham Ward",
        "title": "Adjunct Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3325",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/graham-ward",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Annet Aris",
        "title": "Senior Affiliate Professor of Strategy",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=10275",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/annet-aris",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Joerg Niessing",
        "title": "Senior Affiliate Professor of Marketing",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3454",
        "faculty_sub_url": "http://www.B2BDigitalTransformation.com",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Stefan Thau",
        "title": "Professor of Organisational Behaviour - INSEADThe Cora Chaired Professor of Leadership and LearningAcademic Director, Singapore Data Team (SiDaT)",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9854",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/stefan-thau",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Sriram Chakravarthi",
        "title": "Chief Legal Counsel & Senior Director - SAL",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/SAL/Images/Sriram-Chakravarthi-130x130.jpg",
        "faculty_sub_url": "https://www.sal.org.sg/About-Us/Senate-Committees/Key-Executives",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Philip Anderson",
        "title": "",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=7063",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/philip-anderson",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Ji-Yub (Jay) Kim",
        "title": "Associate Professor of Entrepreneurship and Family Enterprise - INSEADChair, Entrepreneurship and Family Enterprise Area - INSEAD",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=6387",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/ji-yub-jay-kim",
        "intro_desc": "Ji-Yub (Jay) Kim is an Associate Professor of Entrepreneurship and Family Enterprise at INSEAD. His research centers on organisational learning and its implications on organisational performance and evolution. His research interests also include mergers and acquisitions, community influences, corporate entrepreneurship and innovation, and corporate misbehaviour. He has published in leading academic journals including American Sociological Review, Administrative Science Quarterly, Academy of Management Journal, Organization Science, and Strategic Management Journal. He serves on the editorial review boards of Administrative Science Quarterly, Academy of Management Journal, and Organization Science.He teaches a broad spectrum of strategy, innovation and organisation topics including competitive strategy, technology disruption, digital strategy, strategy and business model innovation, value innovation, corporate entrepreneurship, and mergers and acquisitions. He has extensive experience in designing, directing and teaching for executive development programmes for global corporate clients. His clients include OCBC, Nike, Mitsubishi Corporation, Schroders, Mizuho Bank, Central Group, Ajinomoto, AmBank, Takeda, Borouge, SK Group, Permatabank, Korean Management Association, Pertamina, and Hana Financial Group. He is a recipient of multiple INSEAD Executive Education Teaching and Direction Awards.Prior to joining INSEAD, Jay was an assistant professor of Management and Organisation at the Marshall School of Business at the University of Southern California, where he was honoured to receive several teaching awards including Golden Apple Teaching Award for Business Core and Evan C. Thompson Faculty Teaching and Learning Innovation Award. A native of South Korea, Jay received his bachelor’s degree in engineering from Yonsei University in Seoul, South Korea. He earned his PhD in Strategic Management and Organisation Theory from the Wisconsin School of Business at the University of Wisconsin–Madison. He also holds an MBA from the Ross School of Business, University of Michigan.April 2019",
        "pdf_url": "http://faculty.insead.edu/ji-yub-kim/",
        "university_school": "8888_EUR"
    },
    {
        "name": "Neil Bearden",
        "title": "Associate Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/6922.jpg?itok=9zCJ440S",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/j-neil-bearden",
        "intro_desc": "Neil Bearden is an Associate Professor of Decision Sciences at INSEAD. He holds a PhD in Cognitive Psychology from The University of North Carolina at Chapel Hill. He teaches courses on decision making, storytelling, and ethics. He himself is the subject of his current experiments. The main research question is \"How can we improve our daily practices in order to increase our performance and live excellent human lives?\"Neil Bearden is co-directing the INSEAD Leadership Programme for Senior Executives - India.",
        "pdf_url": "https://neilbearden.com/",
        "university_school": "8888_EUR"
    },
    {
        "name": "V. (Paddy) Padmanabhan",
        "title": "Professor of MarketingThe Unilever Chaired Professor of Marketing",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/dept/ee/ilpse/images/Padmanabhan.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/v-paddy-padmanabhan",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Balagopal Vissa",
        "title": "Professor of Entrepreneurship",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/styles/faculty_profile_image/public/facultyprofile/9849.jpg?itok=T7EAlxKj",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/balagopal-vissa",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Allan Filipowicz",
        "title": "",
        "pic_url": "",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Li Huang",
        "title": "Assistant Professor of Organisational Behaviour",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=3412",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/li-huang",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Jon Chilingerian",
        "title": "Adjunct Professor of Organisational Behaviour",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=3308",
        "faculty_sub_url": "",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Enrico Diecidue",
        "title": "Professor of Decision Sciences",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/enrico-diecidue.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/enrico-diecidue",
        "intro_desc": "Enrico Diecidue is a Professor of Decision Sciences at INSEAD. In 1996 he obtained his degree in Economics, with a specialisation in Mathematical Economics, from Bocconi University, Italy. He then joined the CentER (Center for Economic Research), Tilburg University, the Netherlands, where he received his PhD in 2001.Since 2001 he has been a resident faculty member at INSEAD, first in Singapore and then in France. In 2008-2009 he served as a Visiting Professor at Wharton School of the University of Pennsylvania, and in 2010-2011 he took a sabbatical at the Erasmus School of Economics, the Netherlands. His research focuses on decision making under uncertainty. He is interested in the role of regret, aspiration levels, and time in individual decisions. His current research is also addressing the role of groups in complex decisions. Enrico’s research has appeared in leading journals including Decision Analysis, International Economic Review, Journal of Economic Theory, Journal of Mathematical Psychology, Journal of Risk and Uncertainty, Management Science, Mathematical Social Sciences, Theory and Decision. He serves on the Editorial Board of Journal of Risk and Uncertainty and is an Associate Editor for Decision Analysis and for Management Science. He teaches Uncertainty, Data & Judgment (MBA and Global Executive MBA programmes), Management Decision Making (MBA programme), Modules in Decision Making (Executive Education programme) and Decision Sciences (PhD programme). He has won teaching awards at INSEAD and Wharton. Enrico Diecidue is directing the International Directors Programme.",
        "pdf_url": "http://faculty.insead.edu/enrico-diecidue",
        "university_school": "8888_EUR"
    },
    {
        "name": "N. Craig Smith",
        "title": "Affiliate Professor of Ethics and Social ResponsibilityThe INSEAD Chaired Professor of Ethics and Social Responsibility",
        "pic_url": "http://sites.insead.edu/facultyresearch/research/img.cfm?pid=6357",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/n-craig-smith",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Nathan Furr",
        "title": "Associate Professor of Strategy",
        "pic_url": "https://www.insead.edu/sites/default/files/assets/people/nathan-furr.jpg",
        "faculty_sub_url": "https://www.insead.edu/faculty-research/faculty/nathan-furr",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    },
    {
        "name": "Andrew V. Shipilov",
        "title": "Professor of StrategyAkzo Nobel Fellow of Strategic Management",
        "pic_url": "https://sites.insead.edu/facultyresearch/research/img.cfm?pid=9992",
        "faculty_sub_url": "http://networks-and-innovation.insead.edu/",
        "intro_desc": "",
        "pdf_url": "",
        "university_school": "8888_EUR"
    }
]