[
    {
        "name": "Susan Campion",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Todd Hedberg",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Adam Dince",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Kathleen Berry",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Gino Giovannelli",
        "title": "Distinguished Service Faculty",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-giovannelli.jpg",
        "pdf_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/documents/Gino Giovannelli CV.pdf",
        "intro_desc": "Gino Giovannelli, MBA, teaches digital marketing courses in the undergraduate, MBA and Executive Education programs at the University of St. Thomas Opus College of Business. Additionally, he is the lead faculty for the Graduate Certificate in Digital Experience and the Executive Education Certified Digital Marketing Professional program. Giovannelli combines his passion for teaching with his vast industry experience to create a vibrant classroom learning environment.\nAs a proven leader in the interactive marketing space, Giovannelli created Miles Interactive in 2006 to help clients identify how to best leverage the internet to delight customers and maximize business success. Miles Interactive clients include Super Bowl 52 Host Committee, University of Minnesota Alumni Association, Caribou Coffee, SUPERVALU, Famous Dave’s, Life Time Fitness and Sun Country Airlines.\nPrior to starting Miles Interactive, Giovannelli served as vice president of Carlson Interactive, an interactive agency within Carlson Companies. During his tenure at Carlson, he was responsible for leading the online success of Carlson businesses, including Radisson Hotels & Resorts, Country Inn & Suites, TGI Fridays, Regent Seven Seas Cruises and Carlson Wagonlit Travel. In addition, Carlson also served the needs of external clients, such as The Home Depot, Saturn, Northwest Airlines and British Airways.\nGiovannelli received a Bachelor of Science in Mechanical Engineering from Bucknell University and attended the Institute for European Studies in Vienna, Austria. He is a graduate of the MBA program at the University of Minnesota Carlson School of Management and completed the Carlson Companies Executive Leadership Program at the University of Minnesota.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Brendan Bannigan",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Laura Dunham",
        "title": "Associate Professor, Associate Dean of the Schulze School of Entrepreneurship and Best Buy Chair",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-dunham.jpg",
        "pdf_url": "",
        "intro_desc": "Laura Dunham, PhD, is the associate dean of the Schulze School of Entrepreneurship and a professor and department chair in the Entrepreneurship Department at the University of St. Thomas Opus College of Business.\nDunham joined St. Thomas in 2003 from the University of Virginia, where she earned her PhD and MBA from the Darden School of Business. She teaches undergraduate, graduate and executive programs on innovation and entrepreneurial strategy.\nDunham’s research focuses on the managerial and ethical challenges involved in innovation and new business start-up and development. Before her doctoral studies, she worked as a management consultant in the strategy division of Renaissance Worldwide, helping clients such as Oracle, IBM, Lucent and GTE identify, evaluate and develop new growth initiatives.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Gary Kelsey",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Susan Marsnik",
        "title": "Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-Marsnik.jpg",
        "pdf_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/documents/Susan Marsnik CV.pdf",
        "intro_desc": "Susan J. Marsnik, JD, teaches graduate and undergraduate courses in legal strategy for global business and ethical leadership and corporate accountability. She has led undergraduate and graduate study abroad courses and regularly teaches at foreign institutions, including specialized graduate programs at European universities, and as a Fulbright specialist at Beni Suef University in Egypt.\nMarsnik’s research focuses on current issues in global patent and copyright law that impact multinationals doing business across borders. Her research is published in the American Business Law Journal, The Boston College Journal of International & Comparative Law, The Journal of Legal Studies Education, and in law books published in the U.S. and U.K. In 2013, she received the Academy of Legal Studies in Business Hoeber Memorial Award for Excellence in Research. In 2015, she was honored by the British Association of Law Teachers with a lifetime achievement award for contributions to legal education.\nMarsnik is passionate about combining her years in business and legal practice with her broad international experiences to provide undergraduates, MBAs and executives with an integrated perspective on how different legal systems impact business strategies.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Blake Darsow",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Wayne Kaul",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Michael DeVaughn",
        "title": "Associate Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-devaughn1.jpg",
        "pdf_url": "",
        "intro_desc": "Michael DeVaughn, PhD, primarily teaches strategic management courses in the undergraduate business and the Full-time MBA programs at the University St. Thomas. Prior to his academic career, he spent nearly 10 years working for Ralston Purina, PepsiCo, Inc. and Fleet Financial Group (now Bank of America), where he was a vice president in the bank’s Commercial Services Group. His experiences at these firms are prominent in his teachings.\nDeVaughn enjoys directing students’ attention toward messy, thorny and counterintuitive problems facing contemporary firms. He uses different types of media, such as videos, podcasts and interviews, and is likely to “call an audible” (a football term for changing the play) to deviate from the lesson plan when he feels a current media story is germane to a topic in the course. He also enjoys developing his own “homemade” case studies for class discussion based on popular movies where a business firm plays a pivotal role.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Danielle Hansen",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "John Spry",
        "title": "Associate Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty.png",
        "pdf_url": "",
        "intro_desc": "John Spry, PhD, is an associate professor in the Department of Finance at the University of St. Thomas Opus College of Business. He earned his BS in economics at Ohio State University, and his MA and PhD in economics at the University of Rochester. He has been a member of the faculty at Rutgers University, and was a visiting professor at Brandeis University and Ball State University. He has authored several publications in scholarly journals, made frequent conference presentations and served as a reviewer for academic journals.\nSpry’s current areas of research are state and local public finance, the economics of state lotteries, the effects of tax rates on tax bases and applied nonparametric econometrics. His work as a consultant includes a report on the economics and taxation of riverboat casinos for the Indiana Legislature and a report on tax expenditures and the budget process for the Minnesota Department of Revenue. He was also a member of the Minnesota Governor’s 21st Century Tax Reform Commission.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Carie Otto",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Ernest Owens",
        "title": "Assistant Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-Owens.jpg",
        "pdf_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/documents/Ernest Owens CV.pdf",
        "intro_desc": "Ernest L. Owens, Jr. EdD, is an assistant professor in the Department of Management at the University of St. Thomas Opus College of Business. He currently serves on the University Senate and University Faculty Affairs Committee. Owens previously served on several committees, including St. Thomas Executive Committee and Policy Advisory Committee, and as a chair of Faculty Affairs Committee and as the faculty chair for the Opus College of Business. He currently teaches both the undergraduate and graduate courses in project management, and delivers project management training to working professional and executives.\nOwens specializes in project, strategic and operations management. He has taught undergraduate, graduate and professional development courses since 1991. He’s been an adjunct member of the Carlson School of Management, University of Minnesota and the University of Wisconsin River Falls, teaching management, operations and strategic information systems. Owens is a visiting professor at the Universite of Caen in Normandy, France where he teaches leadership and project management to English-speaking students.\nHis industry experience includes roles as director of strategic planning at Unisys, cost engineer at IBM, industrial engineer at Johnson and Johnson and Mass General Hospital, as well as methods analyst at Melville Shoe Corporation.\nAs a consultant, Owens has developed project management training programs for Donaldson Company, Imation, PaR Systems, Mayo Clinic in Rochester, Ameriprise Financial, NRP, Aspen Research, E-Funds, Tenant Corporation, Fairview South Hospital, Fair Isaacs, and PMI Minnesota.\nOwens has been the recipient of numerous awards, including the “Eleven Who Care” from KARE 11 and the “Good Neighbor” from WCCO for his community service. In recognition for his public service and volunteer work, Owens received “The Jefferson Award” and the “Leon H. Sullivan Award” from Opportunities Industrialization Center of America.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "John McVea",
        "title": "Associate Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-mcVea.jpg",
        "pdf_url": "",
        "intro_desc": "John McVea, PhD, researches and teaches in the areas of entrepreneurial strategy and social entrepreneurship.\nMcVea’s work has been published in journals such as the Journal of Business Venturing and the Journal of Business Ethics. He has written more than a dozen business case studies focusing on market entry strategy, innovation field studies, cash flow forecasting, challenges of growth and the use of social media.\nMcVea’s teaching philosophy brings together three approaches: student-centered learning through case discussion, writing across the curriculum and place-based education. These approaches result in highly interactive, discussion-based classroom experiences.\nOriginally from the North of Ireland, McVea has undergraduate degrees in both engineering and economics from the University of Birmingham, England. He has an MBA and a PhD from the Darden School of Business at the University of Virginia.\nBefore returning to academia, McVea spent 12 years working in industry for Dupont, initially in product and market development in the US and ultimately as manager of the textile filament manufacturing operation in the UK. After earning his MBA, he worked for Bain & Co. in Boston as a strategy consultant, advising in fields such as paper manufacturing, oil drilling and private equity acquisition assessment.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Avinash Malshe",
        "title": "Professor",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-Malshe.jpg",
        "pdf_url": "",
        "intro_desc": "Avinash Malshe, PhD, teaches graduate classes in Marketing Management, Applied Business Research, Healthcare Marketing, and Brand Management. He also leads the graduate-level study abroad experience in India.\nMalshe’s research focuses on the development and implementation of marketing and sales strategies in business-to-business (B2B) markets. Specifically, he investigates how various business functions within an organization may work together or at cross-purposes, to (a) enable or inhibit successful development and implementation of business strategies and (b) facilitate value co-creation processes with B2B customers.\nHis research is published in Journal of the Academy of Marketing Science, Journal of Service Research, Journal of Product Innovation Management and Journal of Management, among others. He is the recipient of the prestigious, multi-year University Scholar Grant (fall 2017 – summer 2020). He is also a two-time recipient (2012 and 2018) of the Susan E. Heckler Research Excellence Award at the Opus College of Business.\nMalshe is passionate about combining his deep subject-matter expertise and prior industry experience in international markets to train students, mid-career and senior-level executives to think deeply about the strategic sales and marketing challenges organizations face today and how they may develop actionable solutions that help companies tackle such challenges and win.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Rich Sathe",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Caroline Larson",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Daniel McLaughlin",
        "title": "Adjunct Faculty",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-McLaughlin.jpg",
        "pdf_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/documents/Dan McLaughlin CV.pdf",
        "intro_desc": "Daniel McLaughlin, M.H.A, is the director of the Center for Innovation in the Business of Health Care in the Opus College of Business and is active in teaching, research and speaking at the university, with a special emphasis on health care operations and policy. He also provides consulting services to health care and governmental organizations. McLaughlin is the author of a number of textbooks and management guides published by the American College of Healthcare Executives. He holds degrees in electrical engineering and health care administration from the University of Minnesota.\nFrom 1984 to 1992, McLaughlin was the administrator and CEO of Hennepin County Medical Center - the Level 1 Trauma center in Minneapolis, MN. He served as the chair of the National Association of Public Hospitals and Health Systems and served on President Clinton's Task force on Health Care Reform in 1993. He was the associate administrator for Hennepin County and developed strategies for the health, social service and criminal justice systems. He has been with the University of St. Thomas since 2000.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Mary Slack",
        "title": "Clinical Faculty",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/opus-college-business-faculty-Slack.jpg",
        "pdf_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/documents/Mary Slack CV.pdf",
        "intro_desc": "Mary Eisele Slack’s goal is to give students knowledge and skills they can apply in their jobs. She loves when students share how they used content from class in their jobs. In the leadership classes students discover and define what leadership means to them. In the project management classes, they create a project plan for the course. Seeing students’ progression through the semester and learning how to apply the methodology to their work projects is very rewarding. Slack likes to create learning opportunities that allow students to challenge themselves to make projects applicable to their professional or personal life.\nSlack is a management consultant in human resource and organization development. She specializes in the areas of project management, management development, quality improvement, leadership development, and interpersonal skills. Slack has more than 20 years of corporate experience in training, administration, course development, and project management. She has worked with over 200 organizations. Facilitation of team building sessions, decision-making meetings and strategic planning off-sites are also part of her practice. She is available to help conduct needs assessments, program/course design, development, delivery, and evaluation of organization specific content.",
        "university_school": "6110_CBUS"
    },
    {
        "name": "Alison Smith",
        "title": "",
        "pic_url": "https://business.stthomas.edu/_media-library/faculty-research/faculty-bios/images/terrence-murphy-hall-sunset.jpg",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "6110_CBUS"
    }
]